Repository: flutter-form-builder-ecosystem/form_builder_validators
Catalog: lib/l10n/intl_*.arb
Languages: ar, bg, bn, ca, cs, da, de, el, es, et, fa, fi, fr, he, hi, hr, hu, id, it, ja, ka, km, ko, ku, lo, lv, mn, ms, ne, nl, no, pl, pt, ro, ru, sk, sl, sq, sv, sw, ta, th, tr, uk, vi, zh, zh_hant

# uniqueErrorText
source: Value must be unique.
ar: هذا الحقل يجب أن يحتوي على قيمة فريدة.
bg: Това поле изисква уникална стойност.
bn: মানটি অবশ্যই অনন্য মানগুলির মধ্যে অদ্বিতীয় হতে হবে।
ca: Aquest camp requereix un valor únic.
cs: Hodnota musí být jedinečná.
da: Dette felt skal være unikt.
de: Dieses Feld erfordert einen eindeutigen Wert.
el: Η τιμή πρέπει να είναι μοναδική.
es: Este campo requiere un valor único.
et: See väli peab olema unikaalne.
fa: این ورودی باید یکتا باشد.
fi: Kentän arvon tulee olla uniikki.
fr: Ce champ doit être unique.
he: שדה זה דורש ערך ייחודי.
hi: मान अद्वितीय होनी चाहिए।
hr: Vrijednost mora biti jedinstvena.
hu: Ez a mező egyedi értéket igényel.
id: Nilai harus unik.
it: Questo campo richiede un valore unico.
ja: 値は一意である必要があります。
ka: ველი უნიკალური უნდა იყოს.
km: ទិន្នន័យនេះត្រូវតែជាទិន្នន័យតែមួយ។
ko: 고유해야 합니다.
ku: نرخ دەبێت یەکتر بێت.
lo: ຄ່າໃນຟອມນີ້ຕ້ອງມີຄ່າທີ່ບໍ່ດີທີ່ສຸດ.
lv: Vērtībai jābūt unikālai.
mn: Утга давхардаж байна.
ms: Ruangan ini memerlukan nilai yang unik.
ne: यो क्षेत्रलाई मान्य एकमात्र डाटा चाहिन्छ।
nl: De waarde moet uniek zijn.
no: Dette feltet krever en unik verdi.
pl: To pole wymaga unikalnej wartości.
pt: Este campo requer um valor único.
ro: Valoarea trebuie să fie unică.
ru: Поле должно быть уникальным.
sk: Toto pole vyžaduje unikátnu hodnotu.
sl: Vrednost mora biti edinstvena.
sq: Kjo vlerë duhet të jetë unike.
sv: Detta fält kräver ett unikt värde.
sw: Thamani lazima iwe ya kipekee.
ta: இந்த உள்ளீடு அதிகமான மதிப்புகளை கொண்டிருக்க வேண்டும்.
th: ข้อมูลนี้ต้องเป็นค่าที่ไม่ซ้ำกัน
tr: Bu alanın değeri benzersiz olmalıdır.
uk: Поле має бути унікальним.
vi: Yêu cầu giá trị duy nhất.
zh: 该字段必须是唯一的。
zh_hant: 此欄位需要唯一的值。

# bicErrorText
source: Value must be a valid BIC.
ar: هذا الحقل يتطلب رمز BIC صالح.
bg: Това поле изисква валиден BIC код.
bn: একটি বৈধ BIC প্রয়োজন।
ca: Aquest camp requereix un codi BIC vàlid.
cs: Pole vyžaduje platný BIC kód.
da: Dette felt kræver en gyldig BIC.
de: Dieses Feld erfordert eine gültige BIC.
el: Η τιμή πρέπει να είναι έγκυρος BIC.
es: Este campo requiere un código BIC válido.
et: See väli nõuab kehtivat BIC koodi.
fa: این ورودی به شماره BIC معتبر نیاز دارد.
fi: Vaaditaan oikean muotoinen BIC-koodi.
fr: Ce champ nécessite un code BIC valide.
he: שדה זה דורש מזהה BIC תקין.
hi: मान को वैध BIC होना चाहिए।
hr: Unesite validan BIC.
hu: Ez a mező érvényes BIC kódot igényel.
id: BIC tidak valid.
it: Questo campo richiede un codice BIC valido.
ja: 有効なBICを入力してください。
ka: ველი უნდა იყოს მოქმედი BIC კოდი.
km: ទិន្នន័យនេះត្រូវតែជា BIC តែប៉ុណ្ណោះ។
ko: 유효한 BIC를 입력해 주세요.
ku: نرخ دەبێت BIC-ێکی دروست بێت.
lo: ຄ່າໃນຟອມນີ້ຕ້ອງເປັນລະຫັດ BIC ທີ່ຖືກຕ້ອງ.
lv: Vērtībai jābūt derīgam BIC.
mn: BIC код алдаатай байна.
ms: Ruangan ini memerlukan BIC yang sah.
ne: यो क्षेत्रलाई मान्य BIC कोड चाहिन्छ।
nl: Een geldige BIC is vereist.
no: Dette feltet krever en gyldig BIC.
pl: To pole wymaga prawidłowego numeru BIC.
pt: Este campo requer um código BIC válido.
ro: Acest câmp necesită un cod BIC valid.
ru: Поле должно быть действительным BIC кодом.
sk: Toto pole vyžaduje platný BIC kód.
sl: Vnesite veljaven BIC.
sq: Kjo fushë kërkon një kod BIC të vlefshëm.
sv: Detta fält kräver ett giltigt BIC-nummer.
sw: Sehemu hii inahitaji BIC halali.
ta: இந்த உள்ளீட்டுக்கு சரியான BIC குறியீடு தேவை.
th: ข้อมูลนี้ต้องเป็นรหัส BIC ที่ถูกต้อง
tr: Bu alan geçerli bir BIC gerektirir.
uk: Поле має бути дійсним BIC кодом.
vi: Yêu cầu nhập đúng mã BIC.
zh: 该字段必须是有效的 BIC。
zh_hant: 此欄位需要有效的 BIC 編碼。

# isbnErrorText
source: Value must be a valid ISBN.
ar: هذا الحقل يتطلب رقم ISBN صالح.
bg: Това поле изисква валиден ISBN номер.
bn: একটি বৈধ ISBN প্রয়োজন।
ca: Aquest camp requereix un ISBN vàlid.
cs: Pole vyžaduje platné ISBN.
da: Dette felt kræver et gyldigt ISBN-nummer.
de: Dieses Feld erfordert eine gültige ISBN.
el: Η τιμή πρέπει να είναι έγκυρο ISBN.
es: Este campo requiere un ISBN válido.
et: See väli nõuab kehtivat ISBN koodi.
fa: این ورودی به شماره ISBN معتبر نیاز دارد.
fi: Vaaditaan oikean muotoinen ISBN-koodi.
fr: Ce champ nécessite un ISBN valide.
he: שדה זה דורש מספר ISBN תקין.
hi: मान को वैध ISBN होना चाहिए।
hr: Unesite validan ISBN.
hu: Ez a mező érvényes ISBN számot igényel.
id: ISBN tidak valid.
it: Questo campo richiede un ISBN valido.
ja: 有効なISBNを入力してください。
ka: ველი უნდა იყოს სწორი ISBN ნომერი.
km: ទិន្នន័យនេះត្រូវតែជា ISBN តែប៉ុណ្ណោះ។
ko: 유효한 ISBN을 입력해 주세요.
ku: نرخ دەبێت ISBN-ێکی دروست بێت.
lo: ຄ່າໃນຟອມນີ້ຕ້ອງເປັນ ISBN ທີ່ຖືກຕ້ອງ.
lv: Vērtībai jābūt derīgam ISBN.
mn: ISBN код алдаатай байна.
ms: Ruangan ini memerlukan ISBN yang sah.
ne: यो क्षेत्रलाई मान्य ISBN चाहिन्छ।
nl: Een geldige ISBN is vereist.
no: Dette feltet krever en gyldig ISBN.
pl: To pole wymaga prawidłowego numeru ISBN.
pt: Este campo requer um ISBN válido.
ro: Acest câmp necesită un număr ISBN valid.
ru: Поле должно быть действительным ISBN номером.
sk: Toto pole vyžaduje platné ISBN číslo.
sl: Vnesite veljaven ISBN.
sq: Kjo fushë kërkon një ISBN të vlefshëm.
sv: Detta fält kräver ett giltigt ISBN-nummer.
sw: Sehemu hii inahitaji ISBN halali.
ta: இந்த உள்ளீட்டுக்கு சரியான ISBN எண் தேவை.
th: ข้อมูลนี้ต้องเป็น ISBN ที่ถูกต้อง
tr: Bu alan geçerli bir ISBN gerektirir.
uk: Поле має бути дійсним ISBN номером.
vi: Yêu cầu nhập đúng số ISBN.
zh: 该字段必须是有效的 ISBN。
zh_hant: 此欄位需要有效的 ISBN 編碼。

# singleLineErrorText
source: Value must be a single line.
ar: هذا الحقل يجب أن يحتوي على سطر واحد فقط.
bg: Това поле трябва да съдържа само един ред.
bn: এই ফিল্ডে একটি একক লাইন থাকতে হবে।
ca: Aquest camp ha de ser una línia única.
cs: Pole musí obsahovat pouze jednu řádku.
da: Dette felt skal være en enkelt linje.
de: Dieses Feld darf keine Zeilenumbrüche enthalten.
el: Η τιμή πρέπει να είναι μία γραμμή.
es: Este campo debe contener una sola línea de texto.
et: See väli nõuab ühekordset rida.
fa: این ورودی باید یک خط باشد.
fi: Kentän arvon tulee olla yksirivinen.
fr: Ce champ doit être une seule ligne.
he: שדה זה דורש שורה יחידה.
hi: मान एक ही लाइन होनी चाहिए।
hr: Unesite samo jedan redak teksta.
hu: Ez a mező csak egy sorból állhat.
id: Nilai harus dalam satu baris.
it: Questo campo richiede un testo su una sola riga.
ja: 値は単一行である必要があります。
ka: ველი უნდა შეიცავდეს მხოლოდ ერთ ხაზს.
km: ទិន្នន័យនេះត្រូវតែជា​បន្ទាត់​តែប៉ុណ្ណោះ។
ko: 한 줄로 입력해 주세요.
ku: نرخ دەبێت خطەکەی تەنها بێت.
lo: ຄ່າໃນຟອມນີ້ຕ້ອງຢູ່ໃນຊ່ວງທີ່ເທົ່ານັ້ນ.
lv: Vērtībai jābūt vienā rindā.
mn: Зөвхөн нэг мөрт байх ёстой.
ms: Ruangan ini memerlukan rentetan tunggal.
ne: यो क्षेत्रलाई मान्य एकल लाइन स्ट्रिंग चाहिन्छ।
nl: Dit veld mag geen nieuwe regels bevatten.
no: Dette feltet må være en enkelt linje.
pl: To pole wymaga pojedynczej linii tekstu.
pt: Este campo deve conter apenas uma linha.
ro: Acest câmp trebuie să fie pe o singură linie.
ru: Поле должно содержать только одну строку.
sk: Toto pole vyžaduje jedno riadkový text.
sl: Vrednost mora biti enovrstična.
sq: Kjo fushë kërkon një tekst me një rresht.
sv: Detta fält kräver en enradig text.
sw: Sehemu hii inahitaji mstari mmoja tu.
ta: இந்த உள்ளீட்டு ஒரு வரிசையாக இருக்க வேண்டும்.
th: ข้อมูลนี้ต้องเป็นข้อความในบรรทัดเดียว
tr: Bu alan tek satır olmalıdır.
uk: Поле має бути однорядковим.
vi: Yêu cầu nhập trên một dòng.
zh: 该字段必须是单行文本。
zh_hant: 此欄位必須只包含單行文本。

# timeErrorText
source: Value must be a valid time.
ar: هذا الحقل يتطلب وقت صالح.
bg: Това поле изисква валидно време.
bn: একটি বৈধ সময় প্রয়োজন।
ca: Aquest camp requereix una hora vàlida.
cs: Pole vyžaduje platný čas.
da: Dette felt kræver en gyldig tid.
de: Dieses Feld erfordert eine gültige Uhrzeit.
el: Η τιμή πρέπει να είναι έγκυρη ώρα.
es: Este campo requiere una hora válida.
et: See väli nõuab kehtivat kellaega.
fa: این ورودی به زمان معتبر نیاز دارد.
fi: Vaaditaan oikean muotoinen kellonaika.
fr: Ce champ nécessite une heure valide.
he: שדה זה דורש שעה תקינה.
hi: मान को वैध समय होना चाहिए।
hr: Unesite validno vrijeme.
hu: Ez a mező érvényes időt igényel.
id: Waktu tidak valid.
it: Questo campo richiede un orario valido.
ja: 有効な時間を入力してください。
ka: ველი უნდა იყოს სწორი დრო.
km: ទិន្នន័យនេះត្រូវតែជាពេលវេលាតែប៉ុណ្ណោះ។
ko: 유효한 시간을 입력해 주세요.
ku: نرخ دەبێت کاتێکی دروست بێت.
lo: ຄ່າໃນຟອມນີ້ຕ້ອງເປັນເວລາທີ່ຖືກຕ້ອງ.
lv: Vērtībai jābūt derīgam laikam.
mn: Цаг алдаатай байна.
ms: Ruangan ini memerlukan masa yang sah.
ne: यो क्षेत्रलाई मान्य समय चाहिन्छ।
nl: Een geldige tijd is vereist.
no: Dette feltet krever en gyldig klokkeslett.
pl: To pole wymaga prawidłowej godziny.
pt: Este campo requer uma hora válida.
ro: Acest câmp necesită o oră validă.
ru: Поле должно быть действительным временем.
sk: Toto pole vyžaduje platný čas.
sl: Vnesite veljavno časovno vrednost.
sq: Kjo fushë kërkon një kohë të vlefshme.
sv: Detta fält kräver en giltig tid.
sw: Sehemu hii inahitaji wakati halali.
ta: இந்த உள்ளீட்டுக்கு சரியான நேரம் தேவை.
th: ข้อมูลนี้ต้องเป็นเวลาที่ถูกต้อง
tr: Bu alan geçerli bir saat gerektirir.
uk: Поле має бути дійсним часом.
vi: Yêu cầu nhập đúng định dạng thời gian.
zh: 该字段必须是有效的时间。
zh_hant: 此欄位需要有效的時間。

# dateMustBeInTheFutureErrorText
source: Date must be in the future.
ar: يجب أن يكون التاريخ في المستقبل.
bg: Дата трябва да бъде в бъдещето.
bn: তারিখ ভবিষ্যতে থাকতে হবে।
ca: La data ha de ser al futur.
cs: Datum musí být v budoucnosti.
da: Datoen skal være i fremtiden.
de: Datum muss in der Zukunft liegen.
el: Η ημερομηνία πρέπει να είναι στο μέλλον.
es: La fecha debe estar en el futuro.
et: Kuupäev peab olema tulevikus.
fa: تاریخ باید در آینده باشد.
fi: Päivämäärän tulee olla tulevaisuudessa.
fr: La date doit être dans le futur.
he: התאריך חייב להיות בעתיד.
hi: तिथि भविष्य में होनी चाहिए।
hr: Datum mora biti u budućnosti.
hu: A dátumnak a jövőben kell lennie.
id: Tanggal harus di masa depan.
it: La data deve essere nel futuro.
ja: 日付は未来である必要があります。
ka: თარიღი მომავალში უნდა იყოს.
km: កាលបរិបនេះ​ត្រូវ​ត្រូវ​នៅ​ក្នុង​អនុញ្ញាត
ko: 날짜는 미래여야 합니다.
ku: بەروارەکە دەبێت لە ئامادەی داڕایەوە.
lo: ວັນທີຕ້ອງຢູ່ໃນອະນາຄົດ.
lv: Datumam jābūt nākotnē.
mn: Огноо нь ирэх өмнө байх ёстой.
ms: Tarikh harus dalam masa depan.
ne: मिति भविष्यमा हुनुपर्छ।
nl: Datum moet in de toekomst liggen.
no: Datoen må være i fremtiden.
pl: Data musi być w przyszłości.
pt: Data deve estar no futuro.
ro: Data trebuie să fie în viitor.
ru: Дата должна быть в будущем.
sk: Dátum musí byť v budúcnosti.
sl: Datum mora biti v prihodnosti.
sq: Data duhet të jetë në të ardhmen.
sv: Datumet måste vara i framtiden.
sw: Date ilo fure.
ta: தேதி எதிர்காலத்தில் இருக்க வேண்டும்.
th: วันที่ต้องอยู่ในอนาคต
tr: Tarih gelecekte olmalı.
uk: Дата повинна бути у майбутньому.
vi: Ngày phải ở trong tương lai.
zh: 日期必须是将来的日期。
zh_hant: 日期必須在未來。

# dateMustBeInThePastErrorText
source: Date must be in the past.
ar: يجب أن يكون التاريخ في الماضي.
bg: Дата трябва да бъде в миналото.
bn: তারিখ অতীতে থাকতে হবে।
ca: La data ha de ser al passat.
cs: Datum musí být v minulosti.
da: Datoen skal være i fortiden.
de: Datum muss in der Vergangenheit liegen.
el: Η ημερομηνία πρέπει να είναι στο παρελθόν.
es: La fecha debe estar en el pasado.
et: Kuupäev peab olema minevikus.
fa: تاریخ باید در گذشته باشد.
fi: Päivämäärän tulee olla menneisyydessä.
fr: La date doit être dans le passé.
he: התאריך חייב להיות בעבר.
hi: तिथि भूत काल में होनी चाहिए।
hr: Datum mora biti u prošlosti.
hu: A dátumnak a múltban kell lennie.
id: Tanggal harus di masa lalu.
it: La data deve essere nel passato.
ja: 日付は過去である必要があります。
ka: თარიღი წარსულში უნდა იყოს.
km: កាល​បរិបនេះ​ត្រូវ​ត្រូវ​នៅ​ពី​កន្លះ
ko: 날짜는 과거여야 합니다.
ku: بەروارەکە دەبێت لە گێڕاندنەوەی داڕایەوە.
lo: ວັນທີຕ້ອງຢູ່ໃນອດີດ.
lv: Datumam jābūt pagātnē.
mn: Огноо нь өмнө байх ёстой.
ms: Tarikh harus dalam masa lampau.
ne: मिति अतितमा हुनुपर्छ।
nl: Datum moet in het verleden liggen.
no: Datoen må være i fortiden.
pl: Data musi być w przeszłości.
pt: Data deve estar no passado.
ro: Data trebuie să fie în trecut.
ru: Дата должна быть в прошлом.
sk: Dátum musí byť v minulosti.
sl: Datum mora biti v preteklosti.
sq: Data duhet të jetë në të kaluarën.
sv: Datumet måste vara i det förflutna.
sw: Date du laaynaa.
ta: தேதி கடந்த காலத்தில் இருக்க வேண்டும்.
th: วันที่ต้องอยู่ในอดีต
tr: Tarih geçmişte olmalı.
uk: Дата повинна бути в минулому.
vi: Ngày phải ở trong quá khứ.
zh: 日期必须是过去的日期。
zh_hant: 日期必須在過去。

# fileNameErrorText
source: Value must be a valid file name.
ar: يجب أن تكون القيمة اسم ملف صحيح.
bg: Стойността трябва да бъде валидно име на файл.
bn: মানটি একটি বৈধ ফাইল নাম হতে হবে।
ca: El valor ha de ser un nom de fitxer vàlid.
cs: Hodnota musí být platným názvem souboru.
da: Værdien skal være et gyldigt filnavn.
de: Wert muss ein gültiger Dateiname sein.
el: Η τιμή πρέπει να είναι έγκυρο όνομα αρχείου.
es: El valor debe ser un nombre de archivo válido.
et: Väärtus peab olema kehtiv failinimi.
fa: مقدار باید یک نام فایل معتبر باشد.
fi: Arvon tulee olla kelvollinen tiedostonimi.
fr: La valeur doit être un nom de fichier valide.
he: הערך חייב להיות שם קובץ תקין.
hi: मान को एक मान्य फ़ाइल नाम होना चाहिए।
hr: Vrijednost mora biti valjano ime datoteke.
hu: Az értéknek érvényes fájlnévnek kell lennie.
id: Nilai harus merupakan nama file yang valid.
it: Il valore deve essere un nome file valido.
ja: 値は有効なファイル名である必要があります。
ka: მნიშვნელობა უნდა იყოს ფაილის სწორი სახელი.
km: តម្រូវ​ត្រូវ​ជា​ឈ្មោះ​ឯកសារ​ត្រូវ​បាន​ភ្ជាប់
ko: 값은 유효한 파일 이름이어야 합니다.
ku: گۆڕانکاری دەبێت تاقیبەتی ناونیشانی پەڕگەیە.
lo: ຄ່າຕ້ອງເປັນຊື່ໄຟລ໌ທີ່ຖືກຕ້ອງ.
lv: Vērtībai jābūt derīgam faila nosaukumam.
mn: Утга нь баталгаажсан файлын нэр байх ёстой.
ms: Nilai harus menjadi nama fail yang sah.
ne: मान्य फाइल नाम हुनुपर्छ।
nl: Waarde moet een geldige bestandsnaam zijn.
no: Verdien må være et gyldig filnavn.
pl: Wartość musi być prawidłową nazwą pliku.
pt: O valor deve ser um nome de arquivo válido.
ro: Valoarea trebuie să fie un nume de fișier valid.
ru: Значение должно быть допустимым именем файла.
sk: Hodnota musí byť platným názvom súboru.
sl: Vrednost mora biti veljavno ime datoteke.
sq: Vlera duhet të jetë një emër skedari i vlefshëm.
sv: Värdet måste vara ett giltigt filnamn.
sw: Teel xool mu araal file.
ta: மதிப்பை சரியான கோப்பு பெயராக இருக்க வேண்டும்.
th: ค่าต้องเป็นชื่อไฟล์ที่ถูกต้อง
tr: Değer geçerli bir dosya adı olmalıdır.
uk: Значення повинно бути дійсним ім'ям файлу.
vi: Giá trị phải là tên tệp hợp lệ.
zh: 值必须是一个有效的文件名。
zh_hant: 值必須是有效的檔案名稱。

# negativeNumberErrorText
source: Value must be a negative number.
ar: يجب أن تكون القيمة عددًا سالبًا.
bg: Стойността трябва да бъде отрицателно число.
bn: মানটি একটি নেতিবাচক সংখ্যা হতে হবে।
ca: El valor ha de ser un nombre negatiu.
cs: Hodnota musí být záporné číslo.
da: Værdien skal være et negativt tal.
de: Wert muss eine negative Zahl sein.
el: Η τιμή πρέπει να είναι αρνητικός αριθμός.
es: El valor debe ser un número negativo.
et: Väärtus peab olema negatiivne number.
fa: مقدار باید یک عدد منفی باشد.
fi: Arvon tulee olla negatiivinen luku.
fr: La valeur doit être un nombre négatif.
he: הערך חייב להיות מספר שלילי.
hi: मान को ऋणात्मक संख्या होनी चाहिए।
hr: Vrijednost mora biti negativan broj.
hu: Az értéknek negatívnak kell lennie.
id: Nilai harus merupakan angka negatif.
it: Il valore deve essere un numero negativo.
ja: 値は負の数である必要があります。
ka: მნიშვნელობა უარყოფითი რიცხვი უნდა იყოს.
km: តម្លៃ​ត្រូវ​ត្រូវ​ជា​លេខ​អវិជ្ជមាត្រ
ko: 값은 음수여야 합니다.
ku: گۆڕانکاری دەبێت ژمارەییەکی منفی بێت.
lo: ຄ່າຕ້ອງເປັນເລກລົບ.
lv: Vērtībai jābūt negatīvam skaitlim.
mn: Утга нь сөрөг тоо байх ёстой.
ms: Nilai harus menjadi nombor negatif.
ne: मान्य नकारात्मक संख्या हुनुपर्छ।
nl: Waarde moet een negatief getal zijn.
no: Verdien må være et negativt tall.
pl: Wartość musi być liczbą ujemną.
pt: O valor deve ser um número negativo.
ro: Valoarea trebuie să fie un număr negativ.
ru: Значение должно быть отрицательным числом.
sk: Hodnota musí byť záporné číslo.
sl: Vrednost mora biti negativno število.
sq: Vlera duhet të jetë një numër negativ.
sv: Värdet måste vara ett negativt tal.
sw: Deffee bu xam xam.
ta: மதிப்பு எதிர்காலமாக இருக்க வேண்டும்.
th: ค่าต้องเป็นจำนวนติดลบ
tr: Değer negatif bir sayı olmalıdır.
uk: Значення повинно бути від'ємним числом.
vi: Giá trị phải là số âm.
zh: 值必须是一个负数。
zh_hant: 值必須是負數。

# positiveNumberErrorText
source: Value must be a positive number.
ar: يجب أن تكون القيمة عددًا موجبًا.
bg: Стойността трябва да бъде положително число.
bn: মানটি একটি ধনাত্মক সংখ্যা হতে হবে।
ca: El valor ha de ser un nombre positiu.
cs: Hodnota musí být kladné číslo.
da: Værdien skal være et positivt tal.
de: Wert muss eine positive Zahl sein.
el: Η τιμή πρέπει να είναι θετικός αριθμός.
es: El valor debe ser un número positivo.
et: Väärtus peab olema positiivne number.
fa: مقدار باید یک عدد مثبت باشد.
fi: Arvon tulee olla positiivinen luku.
fr: La valeur doit être un nombre positif.
he: הערך חייב להיות מספר חיובי.
hi: मान को सकारात्मक संख्या होनी चाहिए।
hr: Vrijednost mora biti pozitivan broj.
hu: Az értéknek pozitívnak kell lennie.
id: Nilai harus merupakan angka positif.
it: Il valore deve essere un numero positivo.
ja: 値は正の数である必要があります。
ka: მნიშვნელობა უნდა იყოს დადებითი რიცხვი.
km: តម្លៃ​ត្រូវ​ត្រូវ​ជា​លេខ​វិជ្ជមា​វេ
ko: 값은 양수여야 합니다.
ku: گۆڕانکاری دەبێت ژمارەییەکی موجود بێت.
lo: ຄ່າຕ້ອງເປັນເລກບວກ.
lv: Vērtībai jābūt pozitīvam skaitlim.
mn: Утга нь эерэг тоо байх ёстой.
ms: Nilai harus menjadi nombor positif.
ne: मान्य सकारात्मक संख्या हुनुपर्छ।
nl: Waarde moet een positief getal zijn.
no: Verdien må være et positivt tall.
pl: Wartość musi być liczbą dodatnią.
pt: O valor deve ser um número positivo.
ro: Valoarea trebuie să fie un număr pozitiv.
ru: Значение должно быть положительным числом.
sk: Hodnota musí byť kladné číslo.
sl: Vrednost mora biti pozitivno število.
sq: Vlera duhet të jetë një numër pozitiv.
sv: Värdet måste vara ett positivt tal.
sw: Deffee bu xam xam.
ta: மதிப்பு ஒரு இருக்க வேண்டும்.
th: ค่าต้องเป็นจำนวนบวก
tr: Değer pozitif bir sayı olmalıdır.
uk: Значення повинно бути позитивним числом.
vi: Giá trị phải là số dương.
zh: 值必须是一个正数。
zh_hant: 值必須是正數。

# notZeroNumberErrorText
source: Value must not be zero.
ar: يجب ألا تكون القيمة صفراً.
bg: Стойността не трябва да бъде нула.
bn: মানটি শূন্য না হতে হবে।
ca: El valor no pot ser zero.
cs: Hodnota nesmí být nula.
da: Værdien må ikke være nul.
de: Wert darf nicht null sein.
el: Η τιμή δεν πρέπει να είναι μηδέν.
es: El valor no debe ser cero.
et: Väärtus ei tohi olla null.
fa: مقدار نباید صفر باشد.
fi: Arvon ei tule olla nolla.
fr: La valeur ne doit pas être zéro.
he: הערך לא יכול להיות אפס.
hi: मान शून्य नहीं होनी चाहिए।
hr: Vrijednost ne smije biti nula.
hu: Az érték nem lehet nulla.
id: Nilai tidak boleh nol.
it: Il valore non deve essere zero.
ja: 値はゼロであってはいけません。
ka: მნიშვნელობა არ უნდა იყოს ნული.
km: តម្លៃ​មិន​ត្រូវ​ជា​សូន្យ
ko: 값은 0이 아니어야 합니다.
ku: گۆڕانکاری دەبێت ژمارەییەکی ناکەوە.
lo: ຄ່າຕ້ອງບໍ່ເປັນສູນ.
lv: Vērtībai nevajadzētu būt nullei.
mn: Утга нь нэг биш байх ёстой.
ms: Nilai tidak boleh menjadi sifar.
ne: मान्य शून्य हुनुपर्छ।
nl: Waarde mag niet nul zijn.
no: Verdien kan ikke være null.
pl: Wartość nie może być zerem.
pt: O valor não pode ser zero.
ro: Valoarea nu trebuie să fie zero.
ru: Значение не должно быть нулевым.
sk: Hodnota nemôže byť nula.
sl: Vrednost ne sme biti enaka nič.
sq: Vlera nuk duhet të jetë zero.
sv: Värdet får inte vara noll.
sw: Deffee waa 0 loo xanbaareeyo.
ta: மதிப்பு பூஜ்யமாக இருக்க வேண்டில்லை.
th: ค่าต้องไม่เป็นศูนย์
tr: Değer sıfır olmamalıdır.
uk: Значення не повинно бути нулем.
vi: Giá trị không được là số không.
zh: 值不能为零。
zh_hant: 值不能為零。

# ssnErrorText
source: Value must be a valid Social Security Number.
ar: يجب أن تكون القيمة رقم تأمين اجتماعي صحيح.
bg: Стойността трябва да бъде валиден номер за социално осигуряване.
bn: মানটি একটি বৈধ সোশ্যাল সিকিউরিটি নম্বর হতে হবে।
ca: El valor ha de ser un Número de Seguretat Social vàlid.
cs: Hodnota musí být platné číslo sociálního zabezpečení.
da: Værdien skal være et gyldigt CPR-nummer.
de: Wert muss eine gültige Sozialversicherungsnummer sein.
el: Η τιμή πρέπει να είναι έγκυρος Αριθμός Κοινωνικής Ασφάλισης.
es: El valor debe ser un número de Seguro Social válido.
et: Väärtus peab olema kehtiv sotsiaalkindlustuse number.
fa: مقدار باید یک شماره تأمین اجتماعی معتبر باشد.
fi: Arvon tulee olla kelvollinen henkilötunnus.
fr: La valeur doit être un numéro de sécurité sociale valide.
he: הערך חייב להיות מספר סודי חברתי תקין.
hi: मान को वैध सोशल सिक्योरिटी नंबर होना चाहिए।
hr: Vrijednost mora biti valjani broj socijalnog osiguranja.
hu: Az értéknek érvényes TAJ számnak kell lennie.
id: Nilai harus merupakan Nomor Asuransi Sosial yang valid.
it: Il valore deve essere un numero di previdenza sociale valido.
ja: 値は有効な社会保障番号である必要があります。
ka: მნიშვნელობა უნდა იყოს მოქმედი სოციალური დაზღვევის ნომერი.
km: តម្លៃ​ត្រូវ​ត្រូវ​ជា​លេខ​សម្ពាធ​សង្ខេប​ត្រូវ​បាន
ko: 값은 유효한 주민등록번호여야 합니다.
ku: گۆڕانکاری دەبێت ژمارەییەکی ژێر سندوقی ئەمنی بێت.
lo: ຄ່າຕ້ອງເປັນເລກປະຊາຊົນທີ່ຖືກຕ້ອງ.
lv: Vērtībai jābūt derīgam sociālās apdrošināšanas numuram.
mn: Утга нь баталгаажсан нийгмийн дугаар байх ёстой.
ms: Nilai harus menjadi Nombor Keselamatan Sosial yang sah.
ne: मान्य सामाजिक सुरक्षा संख्या हुनुपर्छ।
nl: Waarde moet een geldig burgerservicenummer zijn.
no: Verdien må være et gyldig personnummer.
pl: Wartość musi być prawidłowym numerem ubezpieczenia społecznego.
pt: O valor deve ser um Número de Seguro Social válido.
ro: Valoarea trebuie să fie un Număr de Asigurare Socială valid.
ru: Значение должно быть действительным номером социального страхования.
sk: Hodnota musí byť platné číslo sociálneho zabezpečenia.
sl: Vrednost mora biti veljavna številka socialnega zavarovanja.
sq: Vlera duhet të jetë një numër Social Security i vlefshëm.
sv: Värdet måste vara ett giltigt personnummer.
sw: Deffee waa nambarka xidhiidhka bulshada ee saxda ah.
ta: மதிப்பு சமூக காப்பொலி எண் இருக்க வேண்டும்.
th: ค่าต้องเป็นหมายเลขประจำตัวประชาชนที่ถูกต้อง
tr: Değer geçerli bir Sosyal Güvenlik Numarası olmalıdır.
uk: Значення повинно бути дійсним номером соціального страхування.
vi: Giá trị phải là số An Sinh Xã Hội hợp lệ.
zh: 值必须是一个有效的社会保险号码。
zh_hant: 值必須是有效的社會安全號碼。
