Repository: flutter-form-builder-ecosystem/form_builder_validators
Catalog: lib/l10n/intl_*.arb
Languages: ar, bg, bn, ca, cs, da, de, el, es, et, fa, fi, fr, he, hi, hr, hu, id, it, ja, ka, km, ko, ku, lo, lv, mn, ms, ne, nl, no, pl, pt, ro, ru, sk, sl, sq, sv, sw, ta, th, tr, uk, vi, zh, zh_hant

# notMatchErrorText
source: Value must not match pattern
ar: يجب ألا تتطابق القيمة مع النمط
bg: Стойността не трябва да съответства на модела
bn: মানটি প্যাটার্নের সাথে মেলে না
ca: El valor no ha de coincidir amb el patró
cs: Hodnota nesmí odpovídat vzoru
da: Værdien må ikke matche mønsteret
de: Der Wert darf nicht dem Muster entsprechen
el: Η τιμή δεν πρέπει να ταιριάζει με το μοτίβο
es: El valor no debe coincidir con el patrón
et: Väärtus ei tohi mustrile vastata
fa: مقدار نباید با الگو مطابقت داشته باشد
fi: Arvo ei saa vastata mallia
fr: La valeur ne doit pas correspondre au modèle
he: הערך לא צריך להתאים לתבנית
hi: मान पैटर्न से मेल नहीं खाना चाहिए
hr: Vrijednost se ne smije poklapati s uzorkom
hu: Az érték nem egyezhet meg a mintával
id: Nilai tidak boleh cocok dengan pola
it: Il valore non deve corrispondere al pattern
ja: 値はパターンと一致してはいけません
km: តម្លៃមិនត្រូវផ្គូផ្គងជាមួយគំរូ
ko: 값은 패턴과 일치하면 안 됩니다
ku: نرخ نابێت لەگەڵ نموونەکەدا بگونجێت
lo: ຄ່າບໍ່ຄວນກົງກັບແບບແຜນ
lv: Vērtībai nevajadzētu atbilst paraugam
mn: Утга нь хэв маягтай таарах ёсгүй
ms: Nilai tidak sepatutnya sepadan dengan corak
ne: मान ढाँचासँग मेल खानु हुँदैन
nl: De waarde mag niet overeenkomen met het patroon
no: Verdien skal ikke matche mønsteret
pl: Wartość nie powinna pasować do wzorca
pt: O valor não deve corresponder ao padrão
ro: Valoarea nu trebuie să se potrivească cu modelul
ru: Значение не должно соответствовать шаблону
sk: Hodnota sa nesmie zhodovať so vzorom
sl: Vrednost se ne sme ujemati z vzorcem
sq: Vlera nuk duhet të përputhet me modelin
sv: Värdet får inte matcha mönstret
sw: Thamani haipaswi kulingana na muundo
ta: மதிப்பு வடிவத்துடன் பொருந்தக்கூடாது
th: ค่าต้องไม่ตรงกับรูปแบบ
tr: Değer desenle eşleşmemelidir
uk: Значення не повинно відповідати шаблону
vi: Giá trị không được khớp với mẫu
zh: 值不应与模式匹配
zh_hant: 值不應與模式匹配

# satisfyErrorText
source: Value does not satisfy the condition.
ar: القيمة لا تحقق الشرط.
bg: Стойността не отговаря на условието.
bn: মান শর্ত পূরণ করে না।
ca: El valor no compleix la condició.
cs: Hodnota nesplňuje podmínku.
da: Værdien opfylder ikke betingelsen.
de: Der Wert erfüllt die Bedingung nicht.
el: Η αξία δεν ικανοποιεί τη συνθήκη.
es: El valor no cumple la condición.
et: Väärtus ei vasta tingimustele.
fa: مقدار شرط را برآورده نمی‌کند.
fi: Arvo ei täytä ehtoa.
fr: La valeur ne satisfait pas la condition.
he: הערך אינו עומד בתנאי.
hi: मान शर्त को पूरा नहीं करता।
hr: Vrijednost ne zadovoljava uvjet.
hu: Az érték nem teljesíti a feltételt.
id: Nilai tidak memenuhi kondisi.
it: Il valore non soddisfa la condizione.
ja: 値が条件を満たしていません。
km: តម្លៃមិនបំពេញលក្ខខណ្ឌ។
ko: 값이 조건을 만족하지 않습니다.
ku: Nirx şert bicîh nake.
lo: ຄ່າບໍ່ຕອບສະໜອງເງື່ອນໄຂ.
lv: Vērtība neatbilst nosacījumam.
mn: Утга нөхцлийг хангахгүй байна.
ms: Nilai tidak memenuhi syarat.
ne: मूल्यले सर्त पूरा गर्दैन।
nl: Waarde voldoet niet aan de voorwaarde.
no: Verdi oppfyller ikke betingelsen.
pl: Wartość nie spełnia warunku.
pt: O valor não satisfaz a condição.
ro: Valoarea nu satisface condiția.
ru: Значение не удовлетворяет условию.
sk: Hodnota nespĺňa podmienku.
sl: Vrednost ne izpolnjuje pogoja.
sq: Vlera nuk plotëson kushtin.
sv: Värdet uppfyller inte villkoret.
sw: Thamani haifikii sharti.
ta: மதிப்பு நிபந்தனையை பூர்த்தி செய்யவில்லை।
th: ค่าไม่เป็นไปตามเงื่อนไข.
tr: Değer koşulu karşılamıyor.
uk: Значення не задовольняє умову.
vi: Giá trị không thỏa mãn điều kiện.
zh: 值不满足条件。
zh_hant: 值不滿足條件。

# andSeparator
source: and
ar: و
bg: и
bn: এবং
ca: i
cs: a
da: og
de: und
el: και
es: y
et: ja
fa: و
fi: ja
fr: et
he: ו
hi: और
hr: i
hu: és
id: dan
it: e
ja: と
km: និង
ko: 그리고
ku: û
lo: ແລະ
lv: un
mn: ба
ms: dan
ne: र
nl: en
no: og
pl: i
pt: e
ro: și
ru: и
sk: a
sl: in
sq: dhe
sv: och
sw: na
ta: மற்றும்
th: และ
tr: ve
uk: і
vi: và
zh: 和
zh_hant: 和

# betweenLengthErrorText
source: Value must have a length that is between {min} and {max}, inclusive.
ar: يجب أن يكون طول القيمة بين {min} و {max}، شاملة.
bg: Стойността трябва да има дължина между {min} и {max}, включително.
bn: মানটির দৈর্ঘ্য {min} এবং {max} এর মধ্যে হতে হবে, সহ.
ca: El valor ha de tenir una longitud entre {min} i {max}, inclosos.
cs: Hodnota musí mít délku mezi {min} a {max} včetně.
da: Værdien skal have en længde mellem {min} og {max}, inklusive.
de: Der Wert muss eine Länge zwischen {min} und {max} haben, einschließlich.
el: Η τιμή πρέπει να έχει μήκος μεταξύ {min} και {max}, συμπεριλαμβανομένων.
es: El valor debe tener una longitud entre {min} y {max}, inclusive.
et: Väärtuse pikkus peab olema vahemikus {min} kuni {max}, kaasa arvatud.
fa: مقدار باید طولی بین {min} و {max}، به صورت شامل داشته باشد.
fi: Arvon pituuden on oltava välillä {min} ja {max}, mukaan lukien.
fr: La valeur doit avoir une longueur comprise entre {min} et {max}, inclus.
he: הערך חייב להיות באורך שבין {min} ל-{max}, כולל.
hi: मान की लंबाई {min} और {max} के बीच होनी चाहिए, सहित.
hr: Vrijednost mora imati duljinu između {min} i {max}, uključivo.
hu: Az értéknek {min} és {max} közötti hosszúságúnak kell lennie, beleértve.
id: Nilai harus memiliki panjang antara {min} dan {max}, inklusif.
it: Il valore deve avere una lunghezza compresa tra {min} e {max}, inclusi.
ja: 値の長さは{min}から{max}の間（両端を含む）である必要があります。
km: តម្លៃត្រូវតែមានប្រវែងរវាង {min} និង {max} រួមបញ្ចូលទាំងពីរ។
ko: 값의 길이는 {min}에서 {max} 사이여야 합니다(포함).
ku: Nirx divê dirêjahiya wê di navbera {min} û {max} de be, tevlî wan.
lo: ຄ່າຕ້ອງມີຄວາມຍາວລະຫວ່າງ {min} ແລະ {max}, ລວມທັງສອງຄ່າ.
lv: Vērtības garumam jābūt starp {min} un {max}, ieskaitot.
mn: Утгын урт нь {min}-с {max} хүртэл байх ёстой, оруулан тооцно.
ms: Nilai mesti mempunyai panjang antara {min} dan {max}, termasuk.
ne: मान को लम्बाई {min} र {max} बीचमा हुनुपर्छ, समावेश गरेर।
nl: De waarde moet een lengte hebben tussen {min} en {max}, inclusief.
no: Verdien må ha en lengde mellom {min} og {max}, inkludert.
pl: Wartość musi mieć długość pomiędzy {min} a {max}, włącznie.
pt: O valor deve ter um comprimento entre {min} e {max}, inclusive.
ro: Valoarea trebuie să aibă o lungime între {min} și {max}, inclusiv.
ru: Значение должно иметь длину от {min} до {max} включительно.
sk: Hodnota musí mať dĺžku medzi {min} a {max}, vrátane.
sl: Vrednost mora imeti dolžino med {min} in {max}, vključno.
sq: Vlera duhet të ketë një gjatësi midis {min} dhe {max}, përfshirë.
sv: Värdet måste ha en längd mellan {min} och {max}, inklusive.
sw: Thamani lazima iwe na urefu kati ya {min} na {max}, ikijumuisha.
ta: மதிப்பு {min} மற்றும் {max} இடையே நீளம் கொண்டிருக்க வேண்டும், உள்ளடங்கலாக.
th: ค่าต้องมีความยาวระหว่าง {min} และ {max} รวมทั้งสองค่า
tr: Değer, {min} ile {max} arasında bir uzunluğa sahip olmalıdır, dahil.
uk: Значення повинно мати довжину від {min} до {max} включно.
vi: Giá trị phải có độ dài trong khoảng từ {min} đến {max}, bao gồm cả hai giá trị.
zh: 值的长度必须在 {min} 和 {max} 之间（包含）。
zh_hant: 值的長度必須在 {min} 和 {max} 之間（包含）。

# creditCardErrorText
source: This field requires a valid credit card number.
ar: القيمة المدخلة لا تصلح كرقم بطاقة إئتمانية.
bg: Това поле изисква валиден номер на кредитна карта.
bn: বৈধ ক্রেডিট কার্ড নম্বর প্রয়োজন।
ca: Aquest camp requereix un número de targeta de crèdit vàlid.
cs: Pole vyžaduje platné číslo kreditní karty.
da: Dette felt kræver et gyldigt kreditkort nummer.
de: Für dieses Feld ist eine gültige Kreditkartennummer erforderlich.
el: Η τιμή πρέπει να είναι έγκυρη πιστωτική κάρτα.
es: Este campo requiere un número de tarjeta de crédito válido.
et: Sellele väljale tuleb sisestada korrektne krediitkaardi number.
fa: این ورودی به شماره کارت اعتباری معتبر نیاز دارد.
fi: Luottokortin numero on oltava oikeassa muodossa.
fr: Ce champ nécessite un numéro de carte de crédit valide.
he: שדה זה דורש מספר כרטיס אשראי תקין.
hi: इस फ़ील्ड में एक मान्य क्रेडिट कार्ड नंबर की आवश्यकता है।
hr: Unesite validan broj kreditne kartice.
hu: A megadott érték nem egy érvényes bankkártya szám.
id: Nomor kartu kredit tidak valid.
it: Questo campo richiede un numero di carta di credito valido.
ja: 有効なクレジットカード番号を入力してください。
ka: ველის მნიშვნელობა უნდა იყოს საკრედიტო ბარათის ნომერი.
km: ទិន្នន័យនេះត្រូវតែជាលេខកាតឥណទានតែប៉ុណ្ណោះ។
ko: 유효한 카드 번호를 입력해 주세요.
ku: ئەم خانە پێویستە ژمارەی کارتی کرێدیتێکی دروست هەبێت.
lo: ຄ່າໃນຟອມນີ້ຕ້ອງຢູ່ໃນຮູບແບບຂອງເລກບັດເຄຣດິດ.
lv: Šis lauks prasa derīgu kredītkartes numuru.
mn: Картын дугаар алдаатай байна.
ms: Ruangan ini memerlukan nombor kad kredit yang sah.
ne: यो क्षेत्रलाई मान्य क्रेडिट कार्ड नम्बर चाहिन्छ।
nl: Een geldig creditcardnummer is vereist.
no: Dette feltet krever et gyldig kredittkortnummer.
pl: To pole wymaga podania ważnego numeru karty kredytowej.
pt: Este campo requer um número de cartão de crédito válido.
ro: Acest câmp necesită un număr valid de card de credit.
ru: Значение поля должно быть номером кредитной карты.
sk: Toto pole vyžaduje platné číslo platobnej karty.
sl: Vnesite veljavno številko kreditne kartice.
sq: Kjo fushë kërkon një numër të vlefshëm për kartën e kreditit.
sv: Detta fält kräver ett giltigt kreditkortsnummer.
sw: Sehemu hii inahitaji nambari halali ya kadi ya mkopo.
ta: இந்த உள்ளீட்டுக்கு சரியான கிரெடிட் கார்டு எண் தேவை.
th: ข้อมูลนี้ต้องเป็นเลขบัตรเครดิตเท่านั้น
tr: Bu alan geçerli bir kredi kartı numarası gerektirir.
uk: Значення поля має бути номером кредитної картки.
vi: Yêu cầu nhập đúng số thẻ tín dụng.
zh: 该字段必须是有效的信用卡号。
zh_hant: 此欄位需要有效的信用卡號碼。

# dateStringErrorText
source: This field requires a valid date string.
ar: هذا الحقل يتطلب تاريخا صالحا.
bg: Това поле изисква валиден низ за дата.
bn: একটি বৈধ তারিখ প্রয়োজন।
ca: Aquest camp requereix una cadena de data vàlida.
cs: Pole vyžaduje platný zápis data.
da: Dette felt kræver en gyldig dato.
de: Dieses Feld erfordert ein gültiges Datum.
el: Η τιμή πρέπει να είναι έγκυρη ημερομηνία.
es: Este campo requiere una cadena de fecha válida.
et: Sellele väljale tuleb sisestada korrektne kuupäev.
fa: این ورودی به یک تاریخ معتبر نیاز دارد.
fi: Päivämäärä ei ole oikeassa muodossa.
fr: Ce champ nécessite une chaîne de date valide.
he: שדה זה דורש מחרוזת תאריך תקינה.
hi: इस फ़ील्ड में एक मान्य तिथि स्ट्रिंग की आवश्यकता है।
hr: Unesite validan datum.
hu: Ennek a mezőnek dátumnak kell lennie.
id: Tanggal tidak valid.
it: Questo campo richiede una data valida.
ja: 正しい日付を入力してください。
ka: ველი უნდა იყოს თარიღი.
km: ទិន្នន័យ​នេះ​ត្រូវ​តែ​ជា​កាលបរិច្ឆេទតែប៉ុណ្ណោះ។
ko: 날짜 형식이 올바르지 않습니다.
ku: ئەم خانە پێویستە دەستپێکی بەروارێکی دروست هەبێت.
lo: ຄ່າໃນຟອມນີ້ຕ້ອງຢູ່ໃນຮູບແບບຂອງວັນທີ.
lv: Šis lauks prasa derīgu datuma virkni.
mn: Огнооны загварт таарахгүй байна.
ms: Ruangan ini memerlukan rentetan tarikh yang sah.
ne: यो क्षेत्रलाई मान्य मिति स्ट्रिंग चाहिन्छ।
nl: Een geldige datum is vereist.
no: Dette feltet krever en gyldig dato.
pl: To pole wymaga prawidłowej daty.
pt: Este campo requer uma string de data válida.
ro: Acest câmp necesită un șir de date valid.
ru: Поле должно быть датой.
sk: Toto pole vyžaduje platný dátum.
sl: Vnesite veljaven datum.
sq: Kjo fushë kërkon një datë të vlefshme.
sv: Detta fält kräver ett giltigt datum.
sw: Sehemu hii inahitaji mfuatano halali wa tarehe.
ta: இந்த உள்ளீட்டுக்கு சரியான தேதி தேவை.
th: ข้อมูลนี้ต้องเป็นวันที่เท่านั้น
tr: Bu alan geçerli bir tarih gerektirir.
uk: Поле має бути датою.
vi: Yêu cầu nhập đúng định dạng ngày.
zh: 该字段必须是有效的时间日期。
zh_hant: 此欄位需要有效的日期字符串。

# emailErrorText
source: This field requires a valid email address.
ar: هذا الحقل يتطلب عنوان بريد إلكتروني صالح.
bg: Това поле изисква валиден имейл адрес.
bn: একটি বৈধ ইমেল আইডি প্রয়োজন।
ca: Aquest camp requereix una adreça de correu electrònic vàlida.
cs: Pole vyžaduje platnou e-mailovou adresu.
da: Dette felt kræver en gyldig e-mail adresse.
de: Für dieses Feld ist eine gültige E-Mail-Adresse erforderlich.
el: Το πεδίο πρέπει να έχει μία έγκυρη διεύθυνση email.
es: Este campo requiere una dirección de correo electrónico válida.
et: See väli nõuab kehtivat e-posti aadressi.
fa: این ورودی به یک آدرس ایمیل معتبر نیاز دارد.
fi: Sähköpostiosoitteen muoto ei ole oikea.
fr: Ce champ nécessite une adresse e-mail valide.
he: שדה זה דורש כתובת דוא"ל תקינה.
hi: इस फ़ील्ड में एक मान्य ईमेल पता की आवश्यकता है।
hr: Unesite validnu e-mail adresu.
hu: A megadott érték nem egy érvényes email cím.
id: Alamat email tidak valid.
it: Questo campo richiede un indirizzo email valido.
ja: 有効なメールアドレスを入力してください。
ka: ველი უნდა იყოს email მისამართი.
km: ទិន្នន័យ​នេះ​ត្រូវ​តែ​ជាអ៊ីមែលតែប៉ុណ្ណោះ។
ko: 이메일 주소 형식이 올바르지 않습니다.
ku: ئەم خانە پێویستە ناونیشانی ئیمەیڵێکی دروست هەبێت.
lo: ຄ່າໃນຟອມນີ້ຕ້ອງຢູ່ໃນຮູບແບບຂອງອີເມວ.
lv: Šis lauks prasa derīgu e-pasta adresi.
mn: И-мэйл хаяг алдаатай байна.
ms: Ruangan ini memerlukan alamat e-mel yang sah.
ne: यो क्षेत्रलाई मान्य इमेल ठेगाना चाहिन्छ।
nl: Een geldig e-mailadres is vereist.
no: Dette feltet krever en gyldig e-postadresse.
pl: To pole wymaga prawidłowego adresu e-mail.
pt: Este campo requer um endereço de e-mail válido.
ro: Acest câmp necesită o adresă de e-mail validă.
ru: Поле должно быть email адресом.
sk: Toto pole vyžaduje platnú emailovú adresu.
sl: Vnesite veljaven e-mail naslov.
sq: Kjo fushë kërkon një adresë e E-mail-i të vlefshme.
sv: Detta fält kräver en giltig e-postadress.
sw: Sehemu hii inahitaji barua pepe halali.
ta: இந்த உள்ளீட்டுக்கு சரியான மின்னஞ்சல் முகவரி தேவை.
th: กรุณาระบุ email ของคุณ
tr: Bu alan geçerli bir e-posta adresi gerektirir.
uk: Поле має бути email адресою.
vi: Nhập đúng email.
zh: 该字段必须是有效的电子邮件地址。
zh_hant: 此欄位需要有效的電子郵件地址。

# equalErrorText
source: This field value must be equal to {value}.
ar: يجب أن تكون القيمة المدخلة مساوية لـ {value}.
bg: Стойността на това поле трябва да е равна на {value}.
bn: মান {value} সমান হতে হবে।
ca: Aquest valor de camp ha de ser igual a {value}.
cs: Hodnota se musí rovnat {value}.
da: Dette felts værdi skal være lig med {value}.
de: Dieser Feldwert muss gleich {value} sein.
el: Η τιμή πρέπει να είναι ίση με {value}.
es: Este campo debe ser igual a {value}.
et: See väärtus peab olema {value}.
fa: مقدار این ورودی باید برابر با {value} باشد.
fi: Kentän on vastattava arvoa {value}.
fr: Cette valeur de champ doit être égale à {value}.
he: ערך זה חייב להיות שווה ל {value}.
hi: इस फील्ड का मान {value} के बराबर होना चाहिए।
hr: Vrijednost mora biti jednaka {value}.
hu: Ennek a mezőértéknek meg kell egyeznie {value}.
id: Nilai bidang ini harus sama dengan {value}.
it: Il valore di questo campo deve essere uguale a {value}.
ja: {value}に一致していません。
ka: ველის მნიშვნელობა უნდა იყოს ტოლი {value}.
km: ទិន្នន័យនេះត្រូវតែស្មើនឹង {value} តែប៉ុណ្ណោះ។
ko: 이 필드의 값은 반드시 {value}와 같아야 합니다.
ku: نرخی ئەم خانەیە دەبێت یەکسان بە {value}.
lo: ຄ່າໃນຟອມນີ້ຕ້ອງເທົ່າກັບ {value}.
lv: Šī lauka vērtībai jābūt vienādai ar {value}.
mn: {value}-тэй тэнцүү утга оруулна уу.
ms: Nilai ruangan ini wajib sama dengan {value}.
ne: यो क्षेत्रको मान {value} बराबर हुनुपर्छ।
nl: De waarde moet gelijk zijn aan {value}.
no: Verdien i dette feltet må være lik {value}.
pl: Wartość tego pola musi wynosić {value}.
pt: Este valor de campo deve ser igual a {value}.
ro: Valoarea câmpului trebuie să fie egală cu {value}.
ru: Значение поля должно быть равно {value}.
sk: Hodnota tohto poľa musí byť {value}.
sl: Vrednost mora biti enaka {value}.
sq: Kjo vlerë duhet të jetë e barabartë me {value}.
sv: Detta fältvärde måste vara lika med {value}.
sw: Thamani ya sehemu hii lazima iwe sawa na {value}.
ta: இந்த உள்ளீடு மதிப்பு {value}க்கு சமமாக இருக்க வேண்டும்.
th: ข้อมูลนี้ต้องเท่ากับ {value} เท่านั้น
tr: Bu alanın değeri, {value} değerine eşit olmalıdır.
uk: Значення поля має дорівнювати {value}.
vi: Bắt buộc bằng {value}.
zh: 该字段必须等于 {value}。
zh_hant: 此欄位必須與 {value} 相符

# equalLengthErrorText
source: Value must have a length equal to {length}.
ar: يجب أن يكون طول القيمة يساوي {length}
bg: Стойността трябва да има дължина, равна на {length}
bn: মানটির দৈর্ঘ্য {length} সমান হতে হবে।
ca: El valor ha de tenir una longitud igual a {length}.
cs: Hodnota musí mít délku rovnu {length}.
da: Værdiens længde skal være lig med {length}.
de: Der Wert muss eine Länge von {length} haben.
el: Η τιμή πρέπει να έχει μήκος ίσο με {length}.
es: El valor debe tener una longitud igual a {length}.
et: Väärtuse pikkus peab olema võrdne {length}.
fa: طول مقدار باید برابر باشد {length}.
fi: Merkkijonon pituus on oltava {length}.
fr: La valeur doit avoir une longueur égale à {length}.
he: ערך זה חייב להיות באורך שווה ל {length}.
hi: मान की लंबाई {length} के बराबर होनी चाहिए
hr: Vrijednost mora biti duga {length} znakova.
hu: Az értéknek hosszúnak kell lennie {length}.
id: Nilai harus memiliki panjang yang sama dengan {length}.
it: Il valore deve avere una lunghezza uguale a {length}.
ja: 値の長さは{length}と等しい必要があります。
ka: მნიშვნელობას უნდა ჰქონდეს სიგრძე, რომელიც ტოლი უნდა იყოს {length}.
km: ប្រវែងតួអក្សរទិន្នន័យត្រូវតែស្មើនឹង {length}។
ko: 값은 {length}와 같은 길이를 가져야 합니다.
ku: نرخ دەبێت درێژایی هەبێت یەکسان بە {length}
lo: ມູນຄ່າຕ້ອງມີຄວາມຍາວເທົ່າກັບ {length}.
lv: Vērtībai jābūt garumā, kas vienāds ar {length}.
mn: {length}-тэй тэнцүү урттай утга оруулна уу.
ms: Nilai mesti mempunyai panjang yang sama dengan {length}.
ne: मानको लम्बाइ {length} बराबर हुनुपर्छ।
nl: Waarde moet een lengte hebben die gelijk is aan {length}.
no: Verdien må ha lengden {length}.
pl: Wartość musi mieć długość równą {length}.
pt: O valor deve ter um comprimento igual a {length}.
ro: Valoarea trebuie să aibă o lungime egală cu {length}.
ru: Значение должно иметь длину, равную {length}.
sk: Hodnota musí mať dĺžku rovnú {length}.
sl: Besedilo mora biti dolgo {length} znakov.
sq: Vlera duhet të ketë një gjatësi të barabartë me {length}
sv: Värdet måste ha en längd lika med {length}.
sw: Thamani lazima iwe na urefu sawa na {length}.
ta: மதிப்பு {length}க்கு சமமான நீளத்தைக் கொண்டிருக்க வேண்டும்.
th: ความยาวตัวอักษาต้องมีจำนวนเท่ากับ {length}
tr: Değerin uzunluğu {length} değerine eşit olmalıdır.
uk: Значення повинно мати довжину, рівну {length}.
vi: Độ dài phải bằng {length}.
zh: 该字段的长度必须等于 {length}。
zh_hant: 值必須具有等於 {length} 的長度

# integerErrorText
source: This field requires a valid integer.
ar: القيمة المدخلة ليست رقما صحيحا.
bg: Това поле изисква валидно цяло число.
bn: মান অবশ্যই একটি পূর্ণসংখ্যা হতে হবে।
ca: Aquest camp requereix un nombre enter vàlid.
cs: Hodnota musí být celé číslo.
da: Værdien skal være et heltal.
de: Der Wert muss eine ganze Zahl sein.
el: Η τιμή πρέπει να είναι ακέραιος αριθμός.
es: Este campo requiere un entero válido.
et: Sisend peab olema täisarv.
fa: این ورودی به یک عدد صحیح معتبر نیاز دارد.
fi: Tarvitaan voimassa oleva kokonaisluku.
fr: Ce champ nécessite un entier valide.
he: שדה זה דורש מספר שלם תקין.
hi: इस फ़ील्ड में एक मान्य पूर्णांक की आवश्यकता है।
hr: Vrijednost mora biti cijeli broj.
hu: Ez a mező érvényes egész számot igényel.
id: Nilai harus berupa bilangan bulat.
it: Il valore deve essere un numero intero.
ja: 整数で入力してください。
ka: ველი უნდა იყოს მთელი რიცხვი.
km: ទិន្នន័យនេះត្រូវតែជាលេខតែប៉ុណ្ណោះ។
ko: 정수만 입력 가능합니다.
ku: ئەم خانە پێویستە ژمارەی تەواوێکی دروست هەبێت.
lo: ຄ່າທີ່ປ້ອນໃສ່ຕ້ອງເປັນໂຕເລກຖ້ວນເທົ່ານັ້ນ.
lv: Šis lauks prasa derīgu veselu skaitli.
mn: Бүхэл тоон утга оруулна уу.
ms: Ruangan ini memerlukan integer yang sah.
ne: यो क्षेत्रलाई मान्य पूर्णांक चाहिन्छ।
nl: Dit veld vereist een geheel getal.
no: Verdien må være et heltall.
pl: Wartość musi być liczbą całkowitą.
pt: Este campo requer um número inteiro válido.
ro: Acest câmp necesită un număr întreg valid.
ru: Поле должно быть целым числом.
sk: Hodnota musí byť celé číslo.
sl: Vnesite celo število.
sq: Kjo fushë kërkon një numër të plotë të vlefshëm.
sv: Värdet måste vara ett heltal.
sw: Sehemu hii inahitaji nambari kamili halali.
ta: இந்த உள்ளீட்டுக்கு சரியான முழு எண் தேவை.
th: ข้อมูลนี้ต้องเป็นตัวเลขเท่านั้น
tr: Bu alan geçerli bir tamsayı gerektirir.
uk: Поле має бути цілим числом.
vi: Yêu cầu nhập một số nguyên.
zh: 该字段必须是整数。
zh_hant: 此欄位需要有效的整數。

# ipErrorText
source: This field requires a valid IP.
ar: هذا الحقل يتطلب عنوان IP صالح.
bg: Това поле изисква валиден IP.
bn: একটি বৈধ আইপি এড্রেস প্রয়োজন।
ca: Aquest camp requereix una IP vàlida.
cs: Pole vyžaduje platnou IP adresu.
da: Dette felt kræver en gyldig IP.
de: Dieses Feld erfordert eine gültige IP-Adresse.
el: Η τιμή πρέπει να είναι έγκυρη διεύθυνση IP.
es: Este campo requiere una IP válida.
et: Sellele väljale tuleb sisestada korrektne IP-aadress.
fa: این قسمت نیاز به یک IP معتبر دارد.
fi: IP-osoitteen muoto on annettava oikein.
fr: Ce champ nécessite une adresse IP valide.
he: שדה זה דורש כתובת IP תקינה.
hi: इस फ़ील्ड में एक मान्य आईपी की आवश्यकता है।
hr: Unesite validnu IP adresu.
hu: A megadott érték nem egy érvényes IP cím.
id: Alamat IP tidak valid.
it: Questo campo richiede un indirizzo IP valido.
ja: 有効なIPアドレスを入力してください。
ka: ველი უნდა იყოს IP მისამართი.
km: ទិន្នន័យនេះត្រូវតែជា IP តែប៉ុណ្ណោះ។
ko: 유효한 IP를 입력해 주세요.
ku: ئەم خانە پێویستە IP-ێکی دروست هەبێت.
lo: ຄ່າໃນຟອມນີ້ຕ້ອງຢູ່ໃນຮູບແບບຂອງເລກ IP.
lv: Šis lauks prasa derīgu IP adresi.
mn: IP хаяг алдаатай байна.
ms: Ruangan ini memerlukan IP yang sah.
ne: यो क्षेत्रलाई मान्य आईपी ठेगाना चाहिन्छ।
nl: Een geldig IP-adres is vereist.
no: Dette feltet krever en gyldig IP-adresse.
pl: To pole wymaga prawidłowego adresu IP.
pt: Este campo requer um IP válido.
ro: Acest câmp necesită un IP valid.
ru: Поле должно быть IP адресом.
sk: Toto pole vyžaduje platnú IP adresu.
sl: Vnesite veljaven IP naslov.
sq: Kjo fushë kërkon një IP të vlefshme.
sv: Detta fält kräver en giltig IP-adress.
sw: Sehemu hii inahitaji IP halali.
ta: இந்த உள்ளீட்டுக்கு சரியான ஐபி தேவை.
th: ข้อมูลนี้ต้องเป็น IP เท่านั้น
tr: Bu alan geçerli bir IP adresi gerektirir.
uk: Поле має бути IP адресою.
vi: Yêu cầu nhập đúng địa chỉ IP.
zh: 该字段必须是有效的 IP。
zh_hant: 此欄位需要有效的 IP。

# matchErrorText
source: Value does not match pattern.
ar: القيمة المدخلة لا تطابق الصيغة المطلوبة.
bg: Стойността не съответства на модела.
bn: মান প্যাটার্নের সাথে মেলে না।
ca: El valor no coincideix amb el patró.
cs: Hodnota neodpovídá vzoru.
da: Værdien matcher ikke mønstret.
de: Der Wert stimmt nicht mit dem Muster überein.
el: Η τιμή δεν ταιριάζει με το μοτίβο.
es: El valor no coincide con el patrón requerido.
et: Sisend ei vasta mustrile.
fa: مقدار با الگو مطابقت ندارد.
fi: Arvo ei vastaa muotovaatimuksia.
fr: La valeur ne correspond pas au modèle.
he: ערך זה אינו תואם לתבנית.
hi: मान पैटर्न के साथ मेल नहीं खाता।
hr: Vrijednost ne odgovara uzorku.
hu: A megadott érték nem egyezik a szükséges formátummal.
id: Nilai tidak cocok dengan pola.
it: Il valore non corrisponde al formato richiesto.
ja: 値が正規表現と一致しません。
ka: მნიშვნელობა უნდა შეესაბამებოდეს ნიმუშს.
km: ទិន្នន័យនេះមិនត្រូវគ្នានឹងទម្រង់ដែលបានបញ្ជាក់ទេ។
ko: 필드의 값이 패턴과 맞지 않습니다.
ku: نرخ ناگونجێت پاتێرن.
lo: ຄ່າບໍ່ຖືກຕ້ອງຕາມຮູບແບບທີ່ກຳນົດ.
lv: Vērtība neatbilst paraugam.
mn: Утга загварт таарахгүй байна.
ms: Nilai tidak sepadan dengan corak.
ne: मान ढाँचासँग मेल खाँदैन।
nl: De waarde komt niet overeen met het patroon.
no: Verdien samsvarer ikke med mønsteret.
pl: Wartość nie pasuje do oczekiwanego wzorca.
pt: O valor não corresponde ao padrão.
ro: Valoarea nu se potrivește cu modelul.
ru: Значение должно удовлетворять шаблону.
sk: Hodnota nevyhovuje očakávanému tvaru.
sl: Vrednost ne ustreza predpisanemu vzorcu.
sq: Vlera nuk përputhet me shabllonin.
sv: Värdet matchar inte mönstret.
sw: Thamani hailingani na muundo.
ta: மதிப்பு முறையுடன் பொருந்தவில்லை.
th: ข้อมูลนี้ไม่ตรงกับรูปแบบที่ระบุไว้
tr: Lütfen geçerli bir değer giriniz.
uk: Значення має відповідати шаблону.
vi: Giá trị không khớp.
zh: 该字段格式不正确。
zh_hant: 此欄位與格式不匹配。
