Repository: flutter-form-builder-ecosystem/form_builder_validators
Catalog: lib/l10n/intl_*.arb
Languages: ar, bg, bn, ca, cs, da, de, el, es, et, fa, fi, fr, he, hi, hr, hu, id, it, ja, ka, km, ko, ku, lo, lv, mn, ms, ne, nl, no, pl, pt, ro, ru, sk, sl, sq, sv, sw, ta, th, tr, uk, vi, zh, zh_hant

# mustBeTrueErrorText
source: This field must be true.
ar: يجب أن تكون هذه القيمة صحيحة.
bg: Това поле трябва да е истина.
bn: এই ফিল্ডটি সত্য হতে হবে।
ca: Aquest camp ha de ser cert.
cs: Toto pole musí být pravdivé.
da: Dette felt skal være sandt.
de: Dieses Feld muss wahr sein.
el: Αυτό το πεδίο πρέπει να είναι αληθές.
es: Este campo debe ser verdadero.
et: See väli peab olema tõene.
fa: این ورودی باید صحیح باشد.
fi: Kentän on oltava tosi.
fr: Ce champ doit être vrai.
he: שדה זה חייב להיות נכון.
hi: यह फ़ील्ड सच होना चाहिए।
hr: Ovo polje mora biti istinito.
hu: Ennek a mezőnek igaznak kell lennie.
id: Bidang ini harus benar.
it: Questo campo deve essere vero.
ja: このフィールドはtrueでなければなりません。
ka: ველი უნდა იყოს ჭეშმარიტი.
km: ទិន្នន័យ​នេះត្រូវតែពិតតែប៉ុណ្ណោះ។
ko: 이 필드는 true여야 합니다.
ku: ئەم خانە دەبێت ڕاست بێت.
lo: ຄ່າໃນຟອມນີ້ຕ້ອງແມ່ນ true.
lv: Šim laukam jābūt patiesam.
mn: Энэ талбар нь үнэн байх ёстой.
ms: Ruangan ini mesti benar.
ne: यो क्षेत्र सत्य हुनुपर्छ।
nl: Dit veld moet waar zijn.
no: Dette feltet må være sant.
pl: To pole musi być prawdziwe.
pt: Este campo deve ser verdadeiro.
ro: Acest câmp trebuie să fie adevărat.
ru: Поле должно быть истинным.
sk: Toto pole musí byť pravdivé.
sl: Polje mora biti resnično.
sq: Kjo fushë duhet të jetë e vërtetë.
sv: Detta fält måste vara sant.
sw: Sehemu hii lazima iwe kweli.
ta: இந்த உள்ளீடு உண்மையானதாக இருக்க வேண்டும்.
th: ข้อมูลนี้ต้องเป็นจริง
tr: Bu alan doğru olmalıdır.
uk: Поле має бути істинним.
vi: Yêu cầu phải đúng.
zh: 该字段必须为真。
zh_hant: 此欄位必須為真。

# mustBeFalseErrorText
source: This field must be false.
ar: يجب أن تكون هذه القيمة خاطئة.
bg: Това поле трябва да е невярно.
bn: এই ফিল্ডটি মিথ্যা হতে হবে।
ca: Aquest camp ha de ser fals.
cs: Toto pole musí být nepravdivé.
da: Dette felt skal være falsk.
de: Dieses Feld muss falsch sein.
el: Αυτό το πεδίο πρέπει να είναι ψευδές.
es: Este campo debe ser falso.
et: See väli peab olema väär.
fa: این ورودی باید نادرست باشد.
fi: Kentän on oltava epätosi.
fr: Ce champ doit être faux.
he: שדה זה חייב להיות שגוי.
hi: यह फ़ील्ड झूठ होना चाहिए।
hr: Ovo polje mora biti lažno.
hu: Ennek a mezőnek hamisnak kell lennie.
id: Bidang ini harus salah.
it: Questo campo deve essere falso.
ja: このフィールドはfalseでなければなりません。
ka: ველი უნდა იყოს ყალბი.
km: ទិន្នន័យ​នេះត្រូវតែមិនពិតតែប៉ុណ្ណោះ។
ko: 이 필드는 false여야 합니다.
ku: ئەم خانە دەبێت هەڵە بێت.
lo: ຄ່າໃນຟອມນີ້ຕ້ອງແມ່ນ false.
lv: Šim laukam jābūt nepatiesam.
mn: Энэ талбар нь худал байх ёстой.
ms: Ruangan ini mesti palsu.
ne: यो क्षेत्र असत्य हुनुपर्छ।
nl: Dit veld moet onwaar zijn.
no: Dette feltet må være usant.
pl: To pole musi być fałszywe.
pt: Este campo deve ser falso.
ro: Acest câmp trebuie să fie fals.
ru: Поле должно быть ложным.
sk: Toto pole musí byť nepravdivé.
sl: Polje mora biti neresnično.
sq: Kjo fushë duhet të jetë e gabuar.
sv: Detta fält måste vara falskt.
sw: Sehemu hii lazima iwe uongo.
ta: இந்த உள்ளீடு பொய்யாக இருக்க வேண்டும்.
th: ข้อมูลนี้ต้องเป็นเท็จ
tr: Bu alan yanlış olmalıdır.
uk: Поле має бути хибним.
vi: Yêu cầu phải sai.
zh: 该字段必须为假。
zh_hant: 此欄位必須為假。

# containsSpecialCharErrorText
source: Value must contain at least {min} special characters.
ar: هذا الحقل يجب أن يحتوي على حرف خاص.
bg: Това поле трябва да съдържа специален символ.
bn: এই ফিল্ডে একটি বিশেষ অক্ষর থাকতে হবে।
ca: Aquest camp ha de contenir un caràcter especial.
cs: Pole musí obsahovat speciální znak.
da: Dette felt skal indeholde et specialtegn.
de: Dieses Feld muss ein Sonderzeichen enthalten.
el: Η τιμή πρέπει να περιέχει έναν ειδικό χαρακτήρα.
es: Este campo debe contener un carácter especial.
et: See väli peab sisaldama erilist märki.
fa: این ورودی باید دارای یک کاراکتر خاص باشد.
fi: Kentän on sisällettävä erikoismerkki.
fr: Ce champ doit contenir un caractère spécial.
he: שדה זה חייב להכיל תו מיוחד.
hi: मान में कम से कम {min} विशेष वर्ण होने चाहिए।
hr: Ovo polje mora sadržavati poseban znak.
hu: Ennek a mezőnek speciális karaktert kell tartalmaznia.
id: Bidang ini harus mengandung karakter khusus.
it: Questo campo deve contenere un carattere speciale.
ja: このフィールドには特殊文字を含める必要があります。
ka: ველი უნდა შეიცავდეს განსაკუთრებულ ხასიათს.
km: ទិន្នន័យ​នេះ​ត្រូវ​តែ​មានតួអក្សរពិសេសចំនួន {min} យ៉ាងតិច។
ko: 이 필드는 특수 문자를 포함해야 합니다.
ku: نرخ دەبێت بەلایەنی کەم {min} کاراکتری تایبەتی تێدایە.
lo: ຄ່າໃນຟອມນີ້ຕ້ອງມີອັກສອນພິເສດ.
lv: Vērtībai jāsatur vismaz {min} speciālas rakstzīmes.
mn: Тусгай тэмдэгт агуулсан байх ёстой.
ms: Ruangan ini mesti mengandungi aksara khas.
ne: यो क्षेत्रमा विशेष वर्ण हुनुपर्छ।
nl: Dit veld moet een speciaal teken bevatten.
no: Dette feltet må inneholde spesialtegn.
pl: To pole musi zawierać znak specjalny.
pt: Este campo deve conter um caractere especial.
ro: Acest câmp trebuie să conțină un caracter special.
ru: Поле должно содержать специальный символ.
sk: Toto pole musí obsahovať špeciálny znak.
sl: Vrednost mora vsebovati posebne znake.
sq: Kjo fushë duhet të përmbajë një karakter të veçantë.
sv: Detta fält måste innehålla ett specialtecken.
sw: Sehemu hii lazima iwe na herufi maalum.
ta: இந்த உள்ளீடு சிறப்பு எழுத்துக்களை கொண்டிருக்க வேண்டும்.
th: ข้อมูลนี้ต้องมีอักขระพิเศษ
tr: Bu alan özel karakter içermelidir.
uk: Поле має містити спеціальний символ.
vi: Yêu cầu chứa ký tự đặc biệt.
zh: 该字段必须包含特殊字符。
zh_hant: 此欄位需要包含特殊字符。

# containsUppercaseCharErrorText
source: Value must contain at least {min} uppercase characters.
ar: هذا الحقل يجب أن يحتوي على حرف كبير.
bg: Това поле трябва да съдържа главна буква.
bn: এই ফিল্ডে একটি বড় হাতের অক্ষর থাকতে হবে।
ca: Aquest camp ha de contenir una majúscula.
cs: Pole musí obsahovat velké písmeno.
da: Dette felt skal indeholde et stort bogstav.
de: Dieses Feld muss einen Großbuchstaben enthalten.
el: Η τιμή πρέπει να περιέχει ένα κεφαλαίο γράμμα.
es: Este campo debe contener una letra mayúscula.
et: See väli peab sisaldama suurtähte.
fa: این ورودی باید دارای یک حرف بزرگ باشد.
fi: Kentän on sisällettävä iso kirjain.
fr: Ce champ doit contenir une lettre majuscule.
he: שדה זה חייב להכיל אות רישית.
hi: मान में कम से कम {min} अपरकेस वर्ण होने चाहिए।
hr: Ovo polje mora sadržavati jedno veliko slovo.
hu: Ennek a mezőnek nagybetűt kell tartalmaznia.
id: Bidang ini harus mengandung huruf besar.
it: Questo campo deve contenere una lettera maiuscola.
ja: このフィールドには大文字を含める必要があります。
ka: ველი უნდა შეიცავდეს დიდ ასოებს.
km: ទិន្នន័យ​នេះ​ត្រូវ​តែ​មានតួអក្សរធំចំនួន {min} យ៉ាងតិច។
ko: 이 필드는 대문자를 포함해야 합니다.
ku: نرخ دەبێت بەلایەنی کەم {min} کاراکتری گەورەنووس تێدایە.
lo: ຄ່າໃນຟອມນີ້ຕ້ອງມີອັກສອນຕົວໃຫຍ່.
lv: Vērtībai jāsatur vismaz {min} lielie burti.
mn: Том үсэг агуулсан байх ёстой.
ms: Ruangan ini mesti mengandungi huruf besar.
ne: यो क्षेत्रमा ठूला अक्षर हुनुपर्छ।
nl: Dit veld moet een hoofdletter bevatten.
no: Dette feltet må inneholde store bokstaver.
pl: To pole musi zawierać wielką literę.
pt: Este campo deve conter uma letra maiúscula.
ro: Acest câmp trebuie să conțină o literă mare.
ru: Поле должно содержать заглавные буквы.
sk: Toto pole musí obsahovať veľké písmená.
sl: Vrednost mora vsebovati velike črke.
sq: Kjo fushë duhet të përmbajë një shkronjë të madhe.
sv: Detta fält måste innehålla versaler.
sw: Sehemu hii lazima iwe na herufi kubwa.
ta: இந்த உள்ளீடு பெரிய எழுத்துக்களை கொண்டிருக்க வேண்டும்.
th: ข้อมูลนี้ต้องมีอักษรตัวใหญ่
tr: Bu alan büyük harf içermelidir.
uk: Поле має містити великі літери.
vi: Yêu cầu chứa chữ hoa.
zh: 该字段必须包含大写字母。
zh_hant: 此欄位需要包含大寫字母。

# containsLowercaseCharErrorText
source: Value must contain at least {min} lowercase characters.
ar: هذا الحقل يجب أن يحتوي على حرف صغير.
bg: Това поле трябва да съдържа малка буква.
bn: এই ফিল্ডে একটি ছোট হাতের অক্ষর থাকতে হবে।
ca: Aquest camp ha de contenir una minúscula.
cs: Pole musí obsahovat malé písmeno.
da: Dette felt skal indeholde et lille bogstav.
de: Dieses Feld muss einen Kleinbuchstaben enthalten.
el: Η τιμή πρέπει να περιέχει ένα μικρό γράμμα.
es: Este campo debe contener una letra minúscula.
et: See väli peab sisaldama väiketähte.
fa: این ورودی باید دارای یک حرف کوچک باشد.
fi: Kentän on sisällettävä pieni kirjain.
fr: Ce champ doit contenir une lettre minuscule.
he: שדה זה חייב להכיל אות קטנה.
hi: मान में कम से कम {min} लोअरकेस वर्ण होने चाहिए।
hr: Ovo polje mora sadržavati jedno malo slovo.
hu: Ennek a mezőnek kisbetűt kell tartalmaznia.
id: Bidang ini harus mengandung huruf kecil.
it: Questo campo deve contenere una lettera minuscola.
ja: このフィールドには小文字を含める必要があります。
ka: ველი უნდა შეიცავდეს მცირე ასოებს.
km: ទិន្នន័យ​នេះ​ត្រូវ​តែ​មានតួអក្សរតូចចំនួន {min} យ៉ាងតិច។
ko: 이 필드는 소문자를 포함해야 합니다.
ku: نرخ دەبێت بەلایەنی کەم {min} کاراکتری بچوکنووس تێدایە.
lo: ຄ່າໃນຟອມນີ້ຕ້ອງມີອັກສອນຕົວເລັກ.
lv: Vērtībai jāsatur vismaz {min} mazie burti.
mn: Жижиг үсэг агуулсан байх ёстой.
ms: Ruangan ini mesti mengandungi huruf kecil.
ne: यो क्षेत्रमा साना अक्षर हुनुपर्छ।
nl: Dit veld moet een kleine letter bevatten.
no: Dette feltet må inneholde små bokstaver.
pl: To pole musi zawierać małą literę.
pt: Este campo deve conter uma letra minúscula.
ro: Acest câmp trebuie să conțină o literă mică.
ru: Поле должно содержать строчные буквы.
sk: Toto pole musí obsahovať malé písmená.
sl: Vrednost mora vsebovati male črke.
sq: Kjo fushë duhet të përmbajë një shkronjë të vogël.
sv: Detta fält måste innehålla gemener.
sw: Sehemu hii lazima iwe na herufi ndogo.
ta: இந்த உள்ளீடு சிறிய எழுத்துக்களை கொண்டிருக்க வேண்டும்.
th: ข้อมูลนี้ต้องมีอักษรตัวเล็ก
tr: Bu alan küçük harf içermelidir.
uk: Поле має містити малі літери.
vi: Yêu cầu chứa chữ thường.
zh: 该字段必须包含小写字母。
zh_hant: 此欄位需要包含小寫字母。

# containsNumberErrorText
source: Value must contain at least {min} numbers.
ar: هذا الحقل يجب أن يحتوي على رقم.
bg: Това поле трябва да съдържа число.
bn: এই ফিল্ডে একটি সংখ্যা থাকতে হবে।
ca: Aquest camp ha de contenir un número.
cs: Pole musí obsahovat číslo.
da: Dette felt skal indeholde et tal.
de: Dieses Feld muss eine Zahl enthalten.
el: Η τιμή πρέπει να περιέχει έναν αριθμό.
es: Este campo debe contener un número.
et: See väli peab sisaldama numbrit.
fa: این ورودی باید دارای یک عدد باشد.
fi: Kentän on sisällettävä numero.
fr: Ce champ doit contenir un chiffre.
he: שדה זה חייב להכיל מספר.
hi: मान में कम से कम {min} संख्याएँ होनी चाहिए।
hr: Ovo polje mora sadržavati jedan broj.
hu: Ennek a mezőnek számot kell tartalmaznia.
id: Bidang ini harus mengandung angka.
it: Questo campo deve contenere un numero.
ja: このフィールドには数字を含める必要があります。
ka: ველი უნდა შეიცავდეს რიცხვებს.
km: ទិន្នន័យ​នេះ​ត្រូវ​តែ​មានលេខចំនួន {min} យ៉ាងតិច។
ko: 이 필드는 숫자를 포함해야 합니다.
ku: نرخ دەبێت بەلایەنی کەم {min} ژمارە تێدایە.
lo: ຄ່າໃນຟອມນີ້ຕ້ອງມີຕົວເລກ.
lv: Vērtībai jāsatur vismaz {min} cipari.
mn: Тоон утга агуулсан байх ёстой.
ms: Ruangan ini mesti mengandungi nombor.
ne: यो क्षेत्रमा संख्या हुनुपर्छ।
nl: Dit veld moet een cijfer bevatten.
no: Dette feltet må inneholde tall.
pl: To pole musi zawierać cyfrę.
pt: Este campo deve conter um número.
ro: Acest câmp trebuie să conțină un număr.
ru: Поле должно содержать цифры.
sk: Toto pole musí obsahovať číslo.
sl: Vrednost mora vsebovati številke.
sq: Kjo fushë duhet të përmbajë një numër.
sv: Detta fält måste innehålla siffror.
sw: Sehemu hii lazima iwe na nambari.
ta: இந்த உள்ளீடு எண்களை கொண்டிருக்க வேண்டும்.
th: ข้อมูลนี้ต้องมีตัวเลข
tr: Bu alan bir rakam içermelidir.
uk: Поле має містити число.
vi: Yêu cầu chứa số.
zh: 该字段必须包含数字。
zh_hant: 此欄位需要包含數字。

# alphabeticalErrorText
source: Value must be alphabetical.
ar: هذا الحقل يجب أن يحتوي على حروف أبجدية فقط.
bg: Това поле трябва да съдържа само букви.
bn: এই ফিল্ডে কেবল বর্ণমালা থাকা উচিত।
ca: Aquest camp només ha de contenir lletres.
cs: Pole musí obsahovat pouze písmena.
da: Dette felt skal kun indeholde bogstaver.
de: Dieses Feld darf nur Buchstaben enthalten.
el: Η τιμή πρέπει να περιέχει μόνο γράμματα.
es: Este campo debe contener solo letras.
et: See väli peab sisaldama ainult tähti.
fa: این ورودی باید فقط حروف الفبا را شامل شود.
fi: Kentän on sisällettävä vain kirjaimia.
fr: Ce champ doit contenir uniquement des lettres.
he: שדה זה חייב להכיל אותיות בלבד.
hi: मान को वर्णमाला के क्रम में होना चाहिए।
hr: Ovo polje mora sadržavati samo slova.
hu: Ennek a mezőnek csak betűket kell tartalmaznia.
id: Bidang ini harus hanya mengandung huruf.
it: Questo campo deve contenere solo lettere.
ja: このフィールドはアルファベットのみを含める必要があります。
ka: ველი უნდა შეიცავდეს მხოლოდ ასოებს.
km: ទិន្នន័យ​នេះ​ត្រូវ​តែ​ជា​អក្ខរក្រមតែប៉ុណ្ណោះ។
ko: 이 필드는 문자만 포함해야 합니다.
ku: نرخ دەبێت ئەلفوبێت بێت.
lo: ຄ່າໃນຟອມນີ້ຕ້ອງມີແຕ່ອັກສອນເທົ່ານັ້ນ.
lv: Vērtībai jābūt alfabētiskai.
mn: Зөвхөн үсэг агуулсан байх ёстой.
ms: Ruangan ini mesti mengandungi huruf sahaja.
ne: यो क्षेत्रमा मात्र अक्षरहरू हुनुपर्छ।
nl: Dit veld mag alleen letters bevatten.
no: Dette feltet må inneholde kun bokstaver.
pl: To pole może zawierać tylko litery.
pt: Este campo deve conter apenas letras.
ro: Acest câmp trebuie să conțină doar litere.
ru: Поле должно содержать только буквы.
sk: Toto pole musí obsahovať iba písmená.
sl: Vrednost mora vsebovati samo črke.
sq: Kjo fushë duhet të përmbajë vetëm shkronja alfabetike.
sv: Detta fält får endast innehålla bokstäver.
sw: Sehemu hii lazima iwe na herufi pekee.
ta: இந்த உள்ளீடு எழுத்துக்களை மட்டுமே கொண்டிருக்க வேண்டும்.
th: ข้อมูลนี้ต้องมีเฉพาะตัวอักษร
tr: Bu alan sadece harf içermelidir.
uk: Поле має містити тільки літери.
vi: Yêu cầu chỉ chứa chữ cái.
zh: 该字段只能包含字母。
zh_hant: 此欄位只能包含字母。

# uuidErrorText
source: Value must be a valid UUID.
ar: هذا الحقل يتطلب UUID صالح.
bg: Това поле изисква валиден UUID.
bn: একটি বৈধ UUID প্রয়োজন।
ca: Aquest camp requereix un UUID vàlid.
cs: Pole vyžaduje platný UUID.
da: Dette felt kræver en gyldig UUID.
de: Dieses Feld erfordert eine gültige UUID.
el: Η τιμή πρέπει να είναι έγκυρο UUID.
es: Este campo requiere un UUID válido.
et: See väli nõuab kehtivat UUID-d.
fa: این ورودی به UUID معتبر نیاز دارد.
fi: Vaaditaan oikean muotoinen UUID.
fr: Ce champ nécessite un UUID valide.
he: שדה זה דורש UUID תקין.
hi: मान को एक मान्य UUID होना चाहिए।
hr: Unesite validan UUID.
hu: Ez a mező érvényes UUID-t igényel.
id: UUID tidak valid.
it: Questo campo richiede un UUID valido.
ja: 有効なUUIDを入力してください。
ka: ველი უნდა იყოს მოქმედი UUID.
km: ទិន្នន័យនេះត្រូវតែជា UUID តែប៉ុណ្ណោះ។
ko: 유효한 UUID를 입력해 주세요.
ku: نرخ دەبێت UUID-ێکی دروست بێت.
lo: ຄ່າໃນຟອມນີ້ຕ້ອງແມ່ນ UUID ທີ່ຖືກຕ້ອງ.
lv: Vērtībai jābūt derīgam UUID.
mn: UUID алдаатай байна.
ms: Ruangan ini memerlukan UUID yang sah.
ne: यो क्षेत्रलाई मान्य UUID चाहिन्छ।
nl: Een geldige UUID is vereist.
no: Dette feltet krever en gyldig UUID.
pl: To pole wymaga prawidłowego UUID.
pt: Este campo requer um UUID válido.
ro: Acest câmp necesită un UUID valid.
ru: Поле должно быть действительным UUID.
sk: Toto pole vyžaduje platné UUID.
sl: Vnesite veljaven UUID.
sq: Kjo fushë kërkon një UUID të vlefshëm.
sv: Detta fält kräver ett giltigt UUID.
sw: Sehemu hii inahitaji UUID halali.
ta: இந்த உள்ளீட்டுக்கு சரியான UUID தேவை.
th: ข้อมูลนี้ต้องเป็น UUID ที่ถูกต้อง
tr: Bu alan geçerli bir UUID gerektirir.
uk: Поле має бути дійсним UUID.
vi: Yêu cầu nhập đúng UUID.
zh: 该字段必须是有效的 UUID。
zh_hant: 此欄位需要有效的 UUID。

# jsonErrorText
source: Value must be valid JSON.
ar: هذا الحقل يتطلب JSON صالح.
bg: Това поле изисква валиден JSON.
bn: একটি বৈধ JSON প্রয়োজন।
ca: Aquest camp requereix un JSON vàlid.
cs: Pole vyžaduje platný JSON.
da: Dette felt kræver en gyldig JSON.
de: Dieses Feld erfordert ein gültiges JSON.
el: Η τιμή πρέπει να είναι έγκυρο JSON.
es: Este campo requiere un JSON válido.
et: See väli nõuab kehtivat JSON-i.
fa: این ورودی به JSON معتبر نیاز دارد.
fi: Vaaditaan oikean muotoinen JSON.
fr: Ce champ nécessite un JSON valide.
he: שדה זה דורש JSON תקין.
hi: मान मान्य JSON होना चाहिए।
hr: Unesite validan JSON.
hu: Ez a mező érvényes JSON-t igényel.
id: JSON tidak valid.
it: Questo campo richiede un JSON valido.
ja: 有効なJSONを入力してください。
ka: ველი უნდა იყოს მოქმედი JSON.
km: ទិន្នន័យនេះត្រូវតែជា JSON តែប៉ុណ្ណោះ។
ko: 유효한 JSON을 입력해 주세요.
ku: نرخ دەبێت JSON-ێکی دروست بێت.
lo: ຄ່າໃນຟອມນີ້ຕ້ອງແມ່ນ JSON ທີ່ຖືກຕ້ອງ.
lv: Vērtībai jābūt derīgam JSON.
mn: JSON алдаатай байна.
ms: Ruangan ini memerlukan JSON yang sah.
ne: यो क्षेत्रलाई मान्य JSON चाहिन्छ।
nl: Een geldige JSON is vereist.
no: Dette feltet krever en gyldig JSON.
pl: To pole wymaga prawidłowego JSON.
pt: Este campo requer um JSON válido.
ro: Acest câmp necesită un JSON valid.
ru: Поле должно быть действительным JSON.
sk: Toto pole vyžaduje platný JSON.
sl: Vnesite veljaven JSON.
sq: Kjo fushë kërkon një JSON të vlefshëm.
sv: Detta fält kräver en giltig JSON.
sw: Sehemu hii inahitaji JSON halali.
ta: இந்த உள்ளீட்டுக்கு சரியான JSON தேவை.
th: ข้อมูลนี้ต้องเป็น JSON ที่ถูกต้อง
tr: Bu alan geçerli bir JSON gerektirir.
uk: Поле має бути дійсним JSON.
vi: Yêu cầu nhập đúng định dạng JSON.
zh: 该字段必须是有效的 JSON。
zh_hant: 此欄位需要有效的 JSON。

# latitudeErrorText
source: Value must be a valid latitude.
ar: هذا الحقل يتطلب دائرة عرض صالحة.
bg: Това поле изисква валидна географска ширина.
bn: একটি বৈধ অক্ষাংশ প্রয়োজন।
ca: Aquest camp requereix una latitud vàlida.
cs: Pole vyžaduje platnou zeměpisnou šířku.
da: Dette felt kræver en gyldig breddegrad.
de: Dieses Feld erfordert einen gültigen Breitengrad.
el: Η τιμή πρέπει να είναι έγκυρο γεωγραφικό πλάτος.
es: Este campo requiere una latitud válida.
et: See väli nõuab kehtivat laiuskraadi.
fa: این ورودی به عرض جغرافیایی معتبر نیاز دارد.
fi: Vaaditaan oikean muotoinen leveysaste.
fr: Ce champ nécessite une latitude valide.
he: שדה זה דורש קו רוחב תקין.
hi: मान को वैध अक्षांश होना चाहिए।
hr: Unesite validnu geografsku širinu.
hu: Ez a mező érvényes szélességi fokot igényel.
id: Garis lintang tidak valid.
it: Questo campo richiede una latitudine valida.
ja: 有効な緯度を入力してください。
ka: ველი უნდა იყოს სწორი განედი.
km: ទិន្នន័យ​នេះ​ត្រូវ​តែ​ជា​រយៈទទឹងតែប៉ុណ្ណោះ។
ko: 유효한 위도를 입력해 주세요.
ku: نرخ دەبێت لاتیتیودێکی دروست بێت.
lo: ຄ່າໃນຟອມນີ້ຕ້ອງແມ່ນລະດັບຊັ້ນທີ່ຖືກຕ້ອງ.
lv: Vērtībai jābūt derīgam platumam.
mn: Өргөрөг алдаатай байна.
ms: Ruangan ini memerlukan latitud yang sah.
ne: यो क्षेत्रलाई मान्य अक्षांश चाहिन्छ।
nl: Een geldige breedtegraad is vereist.
no: Dette feltet krever en gyldig breddegrad.
pl: To pole wymaga prawidłowej szerokości geograficznej.
pt: Este campo requer uma latitude válida.
ro: Acest câmp necesită o latitudine validă.
ru: Поле должно быть действительной широтой.
sk: Toto pole vyžaduje platnú zemepisnú šírku.
sl: Vnesite veljavno zemljepisno širino.
sq: Kjo fushë kërkon një gjerësi gjeografike të vlefshme.
sv: Detta fält kräver en giltig latitud.
sw: Sehemu hii inahitaji latitudo halali.
ta: இந்த உள்ளீட்டுக்கு சரியான அகலாங்கு தேவை.
th: ข้อมูลนี้ต้องเป็นค่าละติจูดที่ถูกต้อง
tr: Bu alan geçerli bir enlem gerektirir.
uk: Поле має бути дійсною широтою.
vi: Yêu cầu nhập đúng vĩ độ.
zh: 该字段必须是有效的纬度。
zh_hant: 此欄位需要有效的緯度。

# longitudeErrorText
source: Value must be a valid longitude.
ar: هذا الحقل يتطلب خط طول صالح.
bg: Това поле изисква валидна географска дължина.
bn: একটি বৈধ দ্রাঘিমাংশ প্রয়োজন।
ca: Aquest camp requereix una longitud vàlida.
cs: Pole vyžaduje platnou zeměpisnou délku.
da: Dette felt kræver en gyldig længdegrad.
de: Dieses Feld erfordert einen gültigen Längengrad.
el: Η τιμή πρέπει να είναι έγκυρο γεωγραφικό μήκος.
es: Este campo requiere una longitud válida.
et: See väli nõuab kehtivat pikkuskraadi.
fa: این ورودی به طول جغرافیایی معتبر نیاز دارد.
fi: Vaaditaan oikean muotoinen pituusaste.
fr: Ce champ nécessite une longitude valide.
he: שדה זה דורש קו אורך תקין.
hi: मान को वैध देशान्तर होना चाहिए।
hr: Unesite validnu geografsku dužinu.
hu: Ez a mező érvényes hosszúsági fokot igényel.
id: Garis bujur tidak valid.
it: Questo campo richiede una longitudine valida.
ja: 有効な経度を入力してください。
ka: ველი უნდა იყოს სწორი გრძედი.
km: ទិន្នន័យ​នេះ​ត្រូវ​តែ​ជា​រយៈបណ្តោយតែប៉ុណ្ណោះ។
ko: 유효한 경도를 입력해 주세요.
ku: نرخ دەبێت لۆنگیتیودێکی دروست بێت.
lo: ຄ່າໃນຟອມນີ້ຕ້ອງແມ່ນລະດັບຊັ້ນທີ່ຖືກຕ້ອງ.
lv: Vērtībai jābūt derīgam garumam.
mn: Уртраг алдаатай байна.
ms: Ruangan ini memerlukan longitud yang sah.
ne: यो क्षेत्रलाई मान्य देशान्तर चाहिन्छ।
nl: Een geldige lengtegraad is vereist.
no: Dette feltet krever en gyldig lengdegrad.
pl: To pole wymaga prawidłowej długości geograficznej.
pt: Este campo requer uma longitude válida.
ro: Acest câmp necesită o longitudine validă.
ru: Поле должно быть действительной долготой.
sk: Toto pole vyžaduje platnú zemepisnú dĺžku.
sl: Vnesite veljavno zemljepisno dolžino.
sq: Kjo fushë kërkon një gjatësi gjeografike të vlefshme.
sv: Detta fält kräver en giltig longitud.
sw: Sehemu hii inahitaji longitudo halali.
ta: இந்த உள்ளீட்டுக்கு சரியான நீளாங்கு தேவை.
th: ข้อมูลนี้ต้องเป็นค่าลองจิจูดที่ถูกต้อง
tr: Bu alan geçerli bir boylam gerektirir.
uk: Поле має бути дійсною довготою.
vi: Yêu cầu nhập đúng kinh độ.
zh: 该字段必须是有效的经度。
zh_hant: 此欄位需要有效的經度。

# base64ErrorText
source: Value must be a valid base64 string.
ar: هذا الحقل يتطلب سلسلة Base64 صالحة.
bg: Това поле изисква валиден низ в Base64 формат.
bn: একটি বৈধ Base64 স্ট্রিং প্রয়োজন।
ca: Aquest camp requereix una cadena Base64 vàlida.
cs: Pole vyžaduje platný řetězec Base64.
da: Dette felt kræver en gyldig Base64-streng.
de: Dieses Feld erfordert eine gültige Base64-Zeichenkette.
el: Η τιμή πρέπει να είναι έγκυρη ακολουθία Base64.
es: Este campo requiere una cadena Base64 válida.
et: See väli nõuab kehtivat Base64 stringi.
fa: این ورودی به رشته معتبر Base64 نیاز دارد.
fi: Vaaditaan oikean muotoinen Base64-merkkijono.
fr: Ce champ nécessite une chaîne Base64 valide.
he: שדה זה דורש מחרוזת Base64 תקינה.
hi: मान को वैध बेस64 स्ट्रिंग होना चाहिए।
hr: Unesite validan Base64 string.
hu: Ez a mező érvényes Base64 karakterláncot igényel.
id: String Base64 tidak valid.
it: Questo campo richiede una stringa Base64 valida.
ja: 有効なBase64文字列を入力してください。
ka: ველი უნდა იყოს მოქმედი Base64 სტრიქონი.
km: ទិន្នន័យនេះត្រូវតែជា Base64 តែប៉ុណ្ណោះ។
ko: 유효한 Base64 문자열을 입력해 주세요.
ku: نرخ دەبێت بەرزێکی base64 دروست بێت.
lo: ຄ່າໃນຟອມນີ້ຕ້ອງແມ່ນຂໍ້ຄວາມ Base64 ທີ່ຖືກຕ້ອງ.
lv: Vērtībai jābūt derīgai base64 virknei.
mn: Base64 мөр алдаатай байна.
ms: Ruangan ini memerlukan rentetan Base64 yang sah.
ne: यो क्षेत्रलाई मान्य Base64 स्ट्रिंग चाहिन्छ।
nl: Een geldige Base64-tekenreeks is vereist.
no: Dette feltet krever en gyldig Base64-streng.
pl: To pole wymaga prawidłowego ciągu Base64.
pt: Este campo requer uma string Base64 válida.
ro: Acest câmp necesită un șir Base64 valid.
ru: Поле должно быть действительной строкой Base64.
sk: Toto pole vyžaduje platný Base64 reťazec.
sl: Vnesite veljaven Base64 niz.
sq: Kjo fushë kërkon një string Base64 të vlefshëm.
sv: Detta fält kräver en giltig Base64-sträng.
sw: Sehemu hii inahitaji mfuatano halali wa Base64.
ta: இந்த உள்ளீட்டுக்கு சரியான Base64 வரிசை தேவை.
th: ข้อมูลนี้ต้องเป็น Base64 ที่ถูกต้อง
tr: Bu alan geçerli bir Base64 dizesi gerektirir.
uk: Поле має бути дійсним рядком Base64.
vi: Yêu cầu nhập đúng chuỗi Base64.
zh: 该字段必须是有效的 Base64 字符串。
zh_hant: 此欄位需要有效的 Base64 字符串。
