Repository: flutter-form-builder-ecosystem/form_builder_validators
Catalog: lib/l10n/intl_*.arb
Languages: ar, bg, bn, ca, cs, da, de, el, es, et, fa, fi, fr, he, hi, hr, hu, id, it, ja, ka, km, ko, ku, lo, lv, mn, ms, ne, nl, no, pl, pt, ro, ru, sk, sl, sq, sv, sw, ta, th, tr, uk, vi, zh, zh_hant

# pathErrorText
source: Value must be a valid path.
ar: هذا الحقل يتطلب مسارا صالحا.
bg: Това поле изисква валиден път.
bn: একটি বৈধ পাথ প্রয়োজন।
ca: Aquest camp requereix un camí vàlid.
cs: Pole vyžaduje platnou cestu.
da: Dette felt kræver en gyldig sti.
de: Dieses Feld erfordert einen gültigen Pfad.
el: Η τιμή πρέπει να είναι έγκυρη διαδρομή.
es: Este campo requiere una ruta válida.
et: See väli nõuab kehtivat rada.
fa: این ورودی به مسیر معتبر نیاز دارد.
fi: Vaaditaan oikean muotoinen polku.
fr: Ce champ nécessite un chemin valide.
he: שדה זה דורש נתיב תקין.
hi: मान को वैध पथ होना चाहिए।
hr: Unesite validnu putanju.
hu: Ez a mező érvényes elérési utat igényel.
id: Path tidak valid.
it: Questo campo richiede un percorso valido.
ja: 有効なパスを入力してください。
ka: ველი უნდა იყოს სწორი გზა.
km: ទិន្នន័យនេះត្រូវតែជា Path តែប៉ុណ្ណោះ។
ko: 유효한 경로를 입력해 주세요.
ku: نرخ دەبێت ڕێڕەوی دروست بێت.
lo: ຄ່າໃນຟອມນີ້ຕ້ອງແມ່ນທາງທີ່ຖືກຕ້ອງ.
lv: Vērtībai jābūt derīgam ceļam.
mn: Зам алдаатай байна.
ms: Ruangan ini memerlukan laluan yang sah.
ne: यो क्षेत्रलाई मान्य पथ चाहिन्छ।
nl: Een geldig pad is vereist.
no: Dette feltet krever en gyldig bane.
pl: To pole wymaga prawidłowej ścieżki.
pt: Este campo requer um caminho válido.
ro: Acest câmp necesită o cale validă.
ru: Поле должно быть действительным путем.
sk: Toto pole vyžaduje platnú cestu.
sl: Vnesite veljavno pot.
sq: Kjo fushë kërkon një rrugë të vlefshme.
sv: Detta fält kräver en giltig sökväg.
sw: Sehemu hii inahitaji njia halali.
ta: இந்த உள்ளீட்டுக்கு சரியான பாதை தேவை.
th: ข้อมูลนี้ต้องเป็นเส้นทางที่ถูกต้อง
tr: Bu alan geçerli bir yol gerektirir.
uk: Поле має бути дійсним шляхом.
vi: Yêu cầu nhập đúng đường dẫn.
zh: 该字段必须是有效的路径。
zh_hant: 此欄位需要有效的路徑。

# oddNumberErrorText
source: Value must be an odd number.
ar: هذا الحقل يتطلب رقما فرديا.
bg: Това поле изисква нечетно число.
bn: এই ফিল্ডে একটি বিজোড় সংখ্যা থাকতে হবে।
ca: Aquest camp requereix un número senar.
cs: Pole vyžaduje liché číslo.
da: Dette felt kræver et ulige tal.
de: Dieses Feld erfordert eine ungerade Zahl.
el: Η τιμή πρέπει να είναι περιττός αριθμός.
es: Este campo requiere un número impar.
et: See väli nõuab paaritu arvu.
fa: این ورودی به یک عدد فرد نیاز دارد.
fi: Kenttä vaatii parittoman luvun.
fr: Ce champ nécessite un nombre impair.
he: שדה זה דורש מספר אי זוגי.
hi: मान को विषम संख्या होनी चाहिए।
hr: Ovo polje zahtijeva neparan broj.
hu: Ez a mező páratlan számot igényel.
id: Bidang ini memerlukan angka ganjil.
it: Questo campo richiede un numero dispari.
ja: 値は奇数でなければなりません。
ka: ველი კენტი რიცხვი უნდა იყოს.
km: ទិន្នន័យ​នេះ​ត្រូវ​តែ​ជាលេខចំនួនសេសតែប៉ុណ្ណោះ។
ko: 이 필드는 홀수여야 합니다.
ku: نرخ دەبێت ژمارەی تاک بێت.
lo: ຄ່າໃນຟອມນີ້ຕ້ອງແມ່ນເລກຄີ.
lv: Vērtībai jābūt nepāra skaitlim.
mn: Сондгой тоо оруулна уу.
ms: Ruangan ini memerlukan nombor ganjil.
ne: यो क्षेत्रलाई बिषम संख्या चाहिन्छ।
nl: Dit veld vereist een oneven getal.
no: Dette feltet krever et oddetall.
pl: To pole wymaga liczby nieparzystej.
pt: Este campo requer um número ímpar.
ro: Acest câmp necesită un număr impar.
ru: Поле должно быть нечетным числом.
sk: Toto pole vyžaduje nepárne číslo.
sl: Vrednost mora biti liho število.
sq: Kjo fushë kërkon një numër tek.
sv: Detta fält kräver ett udda nummer.
sw: Sehemu hii inahitaji nambari isiyo ya kawaida.
ta: இந்த உள்ளீட்டுக்கு ஒற்றையன் எண் தேவை.
th: ข้อมูลนี้ต้องเป็นเลขคี่
tr: Bu alan tek sayı gerektirir.
uk: Поле має бути непарним числом.
vi: Yêu cầu nhập số lẻ.
zh: 该字段必须是奇数。
zh_hant: 此欄位需要奇數。

# evenNumberErrorText
source: Value must be an even number.
ar: هذا الحقل يتطلب رقما زوجيا.
bg: Това поле изисква четно число.
bn: এই ফিল্ডে একটি জোড় সংখ্যা থাকতে হবে।
ca: Aquest camp requereix un número parell.
cs: Pole vyžaduje sudé číslo.
da: Dette felt kræver et lige tal.
de: Dieses Feld erfordert eine gerade Zahl.
el: Η τιμή πρέπει να είναι ζυγός αριθμός.
es: Este campo requiere un número par.
et: See väli nõuab paarisarvu.
fa: این ورودی به یک عدد زوج نیاز دارد.
fi: Kenttä vaatii parillisen luvun.
fr: Ce champ nécessite un nombre pair.
he: שדה זה דורש מספר זוגי.
hi: मान को सम संख्या होनी चाहिए।
hr: Ovo polje zahtijeva paran broj.
hu: Ez a mező páros számot igényel.
id: Bidang ini memerlukan angka genap.
it: Questo campo richiede un numero pari.
ja: 値は偶数でなければなりません。
ka: ველი ლუწი რიცხვი უნდა იყოს.
km: ទិន្នន័យ​នេះ​ត្រូវ​តែ​ជាលេខចំនួនគូតែប៉ុណ្ណោះ។
ko: 이 필드는 짝수여야 합니다.
ku: نرخ دەبێت ژمارەی جفت بێت.
lo: ຄ່າໃນຟອມນີ້ຕ້ອງແມ່ນເລກຄູ່.
lv: Vērtībai jābūt pāra skaitlim.
mn: Тэгш тоо оруулна уу.
ms: Ruangan ini memerlukan nombor genap.
ne: यो क्षेत्रलाई सम संख्या चाहिन्छ।
nl: Dit veld vereist een even getal.
no: Dette feltet krever et partall.
pl: To pole wymaga liczby parzystej.
pt: Este campo requer um número par.
ro: Acest câmp necesită un număr par.
ru: Поле должно быть четным числом.
sk: Toto pole vyžaduje párne číslo.
sl: Vrednost mora biti sodo število.
sq: Kjo fushë kërkon një numër çift.
sv: Detta fält kräver ett jämnt nummer.
sw: Sehemu hii inahitaji nambari ya kawaida.
ta: இந்த உள்ளீட்டுக்கு சீரான எண் தேவை.
th: ข้อมูลนี้ต้องเป็นเลขคู่
tr: Bu alan çift sayı gerektirir.
uk: Поле має бути парним числом.
vi: Yêu cầu nhập số chẵn.
zh: 该字段必须是偶数。
zh_hant: 此欄位需要偶數。

# portNumberErrorText
source: Value must be a valid port number between {min} and {max}.
ar: هذا الحقل يتطلب رقما صالحا للمنفذ.
bg: Това поле изисква валиден номер на порт.
bn: একটি বৈধ পোর্ট নম্বর প্রয়োজন।
ca: Aquest camp requereix un número de port vàlid.
cs: Pole vyžaduje platné číslo portu.
da: Dette felt kræver et gyldigt portnummer.
de: Dieses Feld erfordert eine gültige Portnummer.
el: Η τιμή πρέπει να είναι έγκυρος αριθμός θύρας.
es: Este campo requiere un número de puerto válido.
et: See väli nõuab kehtivat pordinumbrit.
fa: این ورودی به شماره پورت معتبر نیاز دارد.
fi: Vaaditaan oikean muotoinen porttinumero.
fr: Ce champ nécessite un numéro de port valide.
he: שדה זה דורש מספר פורט תקין.
hi: मान को {min} और {max} के बीच एक वैध पोर्ट संख्या होनी चाहिए।
hr: Unesite validan broj porta.
hu: Ez a mező érvényes portszámot igényel.
id: Nomor port tidak valid.
it: Questo campo richiede un numero di porta valido.
ja: 有効なポート番号を入力してください。
ka: ველი უნდა იყოს სწორი პორტის ნომერი.
km: ទិន្នន័យនេះត្រូវតែជា Port number ដែលស្ថិតនៅក្នុងចន្លោះ {min} និង {max} តែប៉ុណ្ណោះ។
ko: 유효한 포트 번호를 입력해 주세요.
ku: نرخ دەبێت ژمارەی پۆرتێکی دروست بێت لە نێوان {min} و {max}.
lo: ຄ່າໃນຟອມນີ້ຕ້ອງເປັນເລກທ່າແມ່ນຖືກຕ້ອງ.
lv: Vērtībai jābūt derīgam porta numuram starp {min} un {max}.
mn: Портын дугаар алдаатай байна.
ms: Ruangan ini memerlukan nombor port yang sah.
ne: यो क्षेत्रलाई मान्य पोर्ट नम्बर चाहिन्छ।
nl: Een geldig poortnummer is vereist.
no: Dette feltet krever et gyldig portnummer.
pl: To pole wymaga prawidłowego numeru portu.
pt: Este campo requer um número de porta válido.
ro: Acest câmp necesită un număr de port valid.
ru: Поле должно быть действительным номером порта.
sk: Toto pole vyžaduje platné číslo portu.
sl: Vnesite veljavno številko vrat.
sq: Kjo fushë kërkon një numër porti të vlefshëm.
sv: Detta fält kräver ett giltigt portnummer.
sw: Sehemu hii inahitaji nambari halali ya bandari.
ta: இந்த உள்ளீட்டுக்கு சரியான போர்ட் எண் தேவை.
th: ข้อมูลนี้ต้องเป็นหมายเลขพอร์ตที่ถูกต้อง
tr: Bu alan geçerli bir port numarası gerektirir.
uk: Поле має бути дійсним номером порту.
vi: Yêu cầu nhập đúng số cổng.
zh: 该字段必须是有效的端口号。
zh_hant: 此欄位需要有效的端口號。

# macAddressErrorText
source: Value must be a valid MAC address.
ar: هذا الحقل يتطلب عنوان MAC صالح.
bg: Това поле изисква валиден MAC адрес.
bn: একটি বৈধ MAC ঠিকানা প্রয়োজন।
ca: Aquest camp requereix una adreça MAC vàlida.
cs: Pole vyžaduje platnou MAC adresu.
da: Dette felt kræver en gyldig MAC-adresse.
de: Dieses Feld erfordert eine gültige MAC-Adresse.
el: Η τιμή πρέπει να είναι έγκυρη διεύθυνση MAC.
es: Este campo requiere una dirección MAC válida.
et: See väli nõuab kehtivat MAC aadressi.
fa: این ورودی به آدرس MAC معتبر نیاز دارد.
fi: Vaaditaan oikean muotoinen MAC-osoite.
fr: Ce champ nécessite une adresse MAC valide.
he: שדה זה דורש כתובת MAC תקינה.
hi: मान को वैध मैक पता होना चाहिए।
hr: Unesite validnu MAC adresu.
hu: Ez a mező érvényes MAC címet igényel.
id: Alamat MAC tidak valid.
it: Questo campo richiede un indirizzo MAC valido.
ja: 有効なMACアドレスを入力してください。
ka: ველი უნდა იყოს სწორი MAC მისამართი.
km: ទិន្នន័យនេះត្រូវតែជា MAC address តែប៉ុណ្ណោះ។
ko: 유효한 MAC 주소를 입력해 주세요.
ku: نرخ دەبێت ناونیشانی MAC-ێکی دروست بێت.
lo: ຄ່າໃນຟອມນີ້ຕ້ອງເປັນທີ່ຢູ່ MAC ທີ່ຖືກຕ້ອງ.
lv: Vērtībai jābūt derīgai MAC adresei.
mn: MAC хаяг алдаатай байна.
ms: Ruangan ini memerlukan alamat MAC yang sah.
ne: यो क्षेत्रलाई मान्य MAC ठेगाना चाहिन्छ।
nl: Een geldig MAC-adres is vereist.
no: Dette feltet krever en gyldig MAC-adresse.
pl: To pole wymaga prawidłowego adresu MAC.
pt: Este campo requer um endereço MAC válido.
ro: Acest câmp necesită o adresă MAC validă.
ru: Поле должно быть действительным MAC адресом.
sk: Toto pole vyžaduje platnú MAC adresu.
sl: Vnesite veljaven MAC naslov.
sq: Kjo fushë kërkon një adresë MAC të vlefshme.
sv: Detta fält kräver en giltig MAC-adress.
sw: Sehemu hii inahitaji anwani halali ya MAC.
ta: இந்த உள்ளீட்டுக்கு சரியான MAC முகவரி தேவை.
th: ข้อมูลนี้ต้องเป็น MAC address ที่ถูกต้อง
tr: Bu alan geçerli bir MAC adresi gerektirir.
uk: Поле має бути дійсною MAC адресою.
vi: Yêu cầu nhập đúng địa chỉ MAC.
zh: 该字段必须是有效的 MAC 地址。
zh_hant: 此欄位需要有效的 MAC 地址。

# startsWithErrorText
source: Value must start with {value}.
ar: القيمة يجب أن تبدأ بـ {value}.
bg: Стойността трябва да започва с {value}.
bn: মানটি {value} দিয়ে শুরু হতে হবে।
ca: El valor ha de començar amb {value}.
cs: Hodnota musí začínat na {value}.
da: Værdien skal starte med {value}.
de: Der Wert muss mit {value} beginnen.
el: Η τιμή πρέπει να ξεκινά με {value}.
es: El valor debe comenzar con {value}.
et: Väärtus peab algama {value}-ga.
fa: مقدار باید با {value} شروع شود.
fi: Arvon on alettava merkillä {value}.
fr: La valeur doit commencer par {value}.
he: הערך חייב להתחיל עם {value}.
hi: मान {value} के साथ शुरू होना चाहिए।
hr: Vrijednost mora početi sa {value}.
hu: Az értéknek {value}-val/vel kell kezdődnie.
id: Nilai harus dimulai dengan {value}.
it: Il valore deve iniziare con {value}.
ja: 値は{value}で始まる必要があります。
ka: მნიშვნელობა უნდა იწყებოდეს {value}.
km: ទិន្នន័យ​នេះត្រូវតែចាប់ផ្តើមជាមួយ {value}។
ko: 값은 {value}로 시작해야 합니다.
ku: نرخ دەبێت دەستپێ بکات بە {value}.
lo: ຄ່າຕ້ອງເລີ່ມຕົ້ນດ້ວຍ {value}.
lv: Vērtībai jāsākas ar {value}.
mn: Утга нь {value}-ээр эхлэх ёстой.
ms: Nilai mesti bermula dengan {value}.
ne: मान {value} बाट सुरु हुनुपर्छ।
nl: De waarde moet beginnen met {value}.
no: Verdien må starte med {value}.
pl: Wartość musi zaczynać się od {value}.
pt: O valor deve começar com {value}.
ro: Valoarea trebuie să înceapă cu {value}.
ru: Значение должно начинаться с {value}.
sk: Hodnota musí začínať na {value}.
sl: Vrednost se mora začeti z {value}.
sq: Vlera duhet të fillojë me {value}.
sv: Värdet måste börja med {value}.
sw: Thamani lazima ianze na {value}.
ta: மதிப்பு {value} மூலம் தொடங்க வேண்டும்.
th: ข้อมูลนี้ต้องขึ้นต้นด้วย {value}
tr: Değer {value} ile başlamalıdır.
uk: Значення має починатися з {value}.
vi: Giá trị phải bắt đầu bằng {value}.
zh: 值必须以 {value} 开头。
zh_hant: 值必須以 {value} 開頭。

# endsWithErrorText
source: Value must end with {value}.
ar: القيمة يجب أن تنتهي بـ {value}.
bg: Стойността трябва да завършва с {value}.
bn: মানটি {value} দিয়ে শেষ হতে হবে।
ca: El valor ha d'acabar amb {value}.
cs: Hodnota musí končit na {value}.
da: Værdien skal slutte med {value}.
de: Der Wert muss mit {value} enden.
el: Η τιμή πρέπει να τελειώνει με {value}.
es: El valor debe terminar con {value}.
et: Väärtus peab lõppema {value}-ga.
fa: مقدار باید با {value} پایان یابد.
fi: Arvon on loputtava merkkiin {value}.
fr: La valeur doit se terminer par {value}.
he: הערך חייב להסתיים עם {value}.
hi: मान {value} के साथ समाप्त होना चाहिए।
hr: Vrijednost mora završiti sa {value}.
hu: Az értéknek {value}-val/vel kell végződnie.
id: Nilai harus diakhiri dengan {value}.
it: Il valore deve terminare con {value}.
ja: 値は{value}で終わる必要があります。
ka: მნიშვნელობა უნდა მთავრდებოდეს {value}.
km: ទិន្នន័យ​នេះត្រូវតែបញ្ចប់ជាមួយ {value}។
ko: 값은 {value}로 끝나야 합니다.
ku: نرخ دەبێت کۆتایی پێببە بە {value}.
lo: ຄ່າຕ້ອງສິ້ນສຸດດ້ວຍ {value}.
lv: Vērtībai jābeidzas ar {value}.
mn: Утга нь {value}-ээр төгсөх ёстой.
ms: Nilai mesti berakhir dengan {value}.
ne: मान {value} मा समाप्त हुनुपर्छ।
nl: De waarde moet eindigen met {value}.
no: Verdien må slutte med {value}.
pl: Wartość musi kończyć się na {value}.
pt: O valor deve terminar com {value}.
ro: Valoarea trebuie să se termine cu {value}.
ru: Значение должно заканчиваться на {value}.
sk: Hodnota musí končiť na {value}.
sl: Vrednost se mora končati z {value}.
sq: Vlera duhet të përfundojë me {value}.
sv: Värdet måste sluta med {value}.
sw: Thamani lazima imalizike na {value}.
ta: மதிப்பு {value}ல் முடிவடைய வேண்டும்.
th: ข้อมูลนี้ต้องลงท้ายด้วย {value}
tr: Değer {value} ile bitmelidir.
uk: Значення має закінчуватися на {value}.
vi: Giá trị phải kết thúc bằng {value}.
zh: 值必须以 {value} 结尾。
zh_hant: 值必須以 {value} 結尾。

# containsErrorText
source: Value must contain {value}.
ar: القيمة يجب أن تحتوي على {value}.
bg: Стойността трябва да съдържа {value}.
bn: মানটি {value} ধারণ করতে হবে।
ca: El valor ha de contenir {value}.
cs: Hodnota musí obsahovat {value}.
da: Værdien skal indeholde {value}.
de: Der Wert muss {value} enthalten.
el: Η τιμή πρέπει να περιέχει {value}.
es: El valor debe contener {value}.
et: Väärtus peab sisaldama {value}.
fa: مقدار باید شامل {value} باشد.
fi: Arvon on sisällettävä {value}.
fr: La valeur doit contenir {value}.
he: הערך חייב להכיל את {value}.
hi: मान में {value} होना चाहिए।
hr: Vrijednost mora sadržavati {value}.
hu: Az értéknek tartalmaznia kell {value}-t.
id: Nilai harus mengandung {value}.
it: Il valore deve contenere {value}.
ja: 値は{value}を含む必要があります。
ka: მნიშვნელობა უნდა შეიცავდეს {value}.
km: ទិន្នន័យ​នេះត្រូវតែរួមបញ្ចូលជាមួយ {value}។
ko: 값은 {value}를 포함해야 합니다.
ku: نرخ دەبێت تێبکەوێت {value}.
lo: ຄ່າຕ້ອງປະກອບດ້ວຍ {value}.
lv: Vērtībai jāsatur {value}.
mn: Утга нь {value}-г агуулсан байх ёстой.
ms: Nilai mesti mengandungi {value}.
ne: मानले {value} समावेश गर्नुपर्छ।
nl: De waarde moet {value} bevatten.
no: Verdien må inneholde {value}.
pl: Wartość musi zawierać {value}.
pt: O valor deve conter {value}.
ro: Valoarea trebuie să conțină {value}.
ru: Значение должно содержать {value}.
sk: Hodnota musí obsahovať {value}.
sl: Vrednost mora vsebovati {value}.
sq: Vlera duhet të përmbajë {value}.
sv: Värdet måste innehålla {value}.
sw: Thamani lazima iwe na {value}.
ta: மதிப்பு {value} ஐ கொண்டிருக்க வேண்டும்.
th: ข้อมูลนี้ต้องประกอบด้วย {value}
tr: Değer {value} içermelidir.
uk: Значення має містити {value}.
vi: Giá trị phải chứa {value}.
zh: 值必须包含 {value}。
zh_hant: 值必須包含 {value}。

# doesNotContainElementErrorText
source: Value may not be in list.
ar: القيمة قد لا تكون في القائمة.
bg: Стойността не може да бъде в списъка.
bn: মান তালিকায় থাকতে পারবে না।
ca: El valor no pot estar a la llista.
cs: Hodnota nesmí být v seznamu.
da: Værdien må ikke være på listen.
de: Wert darf nicht in der Liste enthalten sein.
el: Η τιμή δεν μπορεί να είναι στη λίστα.
es: El valor no puede estar en la lista.
et: Väärtus ei tohi olla nimekirjas.
fa: مقدار نباید در لیست باشد.
fi: Arvo ei saa olla luettelossa.
fr: La valeur ne peut pas être dans la liste.
he: הערך לא יכול להיות ברשימה.
hi: मान सूची में नहीं हो सकता.
hr: Vrijednost ne smije biti na popisu.
hu: Az érték nem lehet a listában.
id: Nilai tidak boleh ada dalam daftar.
it: Il valore non può essere nell'elenco.
ja: 値はリストに含まれていない可能性があります。
km: តម្លៃមិនអាចមានក្នុងបញ្ជីបានទេ។
ko: 값은 목록에 포함되지 않을 수 있습니다.
ku: Nirx nabe ku di lîsteyê de be.
lo: ຄ່າອາດຈະບໍ່ຢູ່ໃນລາຍການ.
lv: Vērtība nedrīkst būt sarakstā.
mn: Утга жагсаалтад байж болохгүй.
ms: Nilai tidak boleh berada dalam senarai.
ne: मान सूचीमा नहुन सक्छ।
nl: Waarde mag niet in de lijst staan.
no: Verdien kan ikke være i listen.
pl: Wartość nie może znajdować się na liście.
pt: O valor não pode estar na lista.
ro: Valoarea nu poate fi în listă.
ru: Значение не может быть в списке.
sk: Hodnota nesmie byť v zozname.
sl: Vrednost ne sme biti na seznamu.
sq: Vlera nuk mund të jetë në listë.
sv: Värdet får inte finnas i listan.
sw: Thamani haiwezi kuwa kwenye orodha.
ta: மதிப்பு பட்டியலில் இருக்கக்கூடாது.
th: ค่าต้องไม่อยู่ในรายการ
tr: Değer listede olmayabilir.
uk: Значення не може бути у списку.
vi: Giá trị không được có trong danh sách.
zh: 值不能在列表中。
zh_hant: 值不能在列表中。

# betweenErrorText
source: Value must be between {min} and {max}.
ar: القيمة يجب أن تكون بين {min} و {max}.
bg: Стойността трябва да е между {min} и {max}.
bn: মানটি {min} এবং {max} এর মধ্যে হতে হবে।
ca: El valor ha d'estar entre {min} i {max}.
cs: Hodnota musí být mezi {min} a {max}.
da: Værdien skal være mellem {min} og {max}.
de: Der Wert muss zwischen {min} und {max} liegen.
el: Η τιμή πρέπει να είναι μεταξύ {min} και {max}.
es: El valor debe estar entre {min} y {max}.
et: Väärtus peab olema vahemikus {min} kuni {max}.
fa: مقدار باید بین {min} و {max} باشد.
fi: Arvon on oltava välillä {min} ja {max}.
fr: La valeur doit être comprise entre {min} et {max}.
he: הערך חייב להיות בין {min} לבין {max}.
hi: मान {min} और {max} के बीच होना चाहिए।
hr: Vrijednost mora biti između {min} i {max}.
hu: Az értéknek {min} és {max} között kell lennie.
id: Nilai harus antara {min} dan {max}.
it: Il valore deve essere compreso tra {min} e {max}.
ja: 値は{min}から{max}の間である必要があります。
ka: მნიშვნელობა უნდა იყოს შორის {min} და {max}.
km: ទិន្នន័យ​នេះត្រូវតែនៅចន្លោះ {min} និង {max}។
ko: 값은 {min}와 {max} 사이여야 합니다.
ku: نرخ دەبێت لە نێوان {min} و {max} بێت.
lo: ຄ່າຕ້ອງຢູ່ລະຫວ່າງ {min} ແລະ {max}.
lv: Vērtībai jābūt starp {min} un {max}.
mn: Утга нь {min} ба {max} хооронд байх ёстой.
ms: Nilai mesti antara {min} dan {max}.
ne: मान {min} र {max} को बीचमा हुनुपर्छ।
nl: De waarde moet tussen {min} en {max} liggen.
no: Verdien må være mellom {min} og {max}.
pl: Wartość musi być pomiędzy {min} a {max}.
pt: O valor deve estar entre {min} e {max}.
ro: Valoarea trebuie să fie între {min} și {max}.
ru: Значение должно быть между {min} и {max}.
sk: Hodnota musí byť medzi {min} a {max}.
sl: Vrednost mora biti med {min} in {max}.
sq: Vlera duhet të jetë ndërmjet {min} dhe {max}.
sv: Värdet måste vara mellan {min} och {max}.
sw: Thamani lazima iwe kati ya {min} na {max}.
ta: மதிப்பு {min} மற்றும் {max} இடையில் இருக்க வேண்டும்.
th: ข้อมูลนี้ต้องอยู่ระหว่าง {min} และ {max}
tr: Değer {min} ile {max} arasında olmalıdır.
uk: Значення має бути між {min} і {max}.
vi: Giá trị phải nằm trong khoảng từ {min} đến {max}.
zh: 值必须在 {min} 和 {max} 之间。
zh_hant: 值必須在 {min} 和 {max} 之間。

# containsElementErrorText
source: Value must be in list.
ar: القيمة يجب أن تكون ضمن القائمة المسموح بها.
bg: Стойността трябва да е в списъка с допустими стойности.
bn: মানটি অনুমোদিত তালিকার মধ্যে থাকতে হবে।
ca: El valor ha d'estar en la llista de valors permesos.
cs: Hodnota musí být v seznamu povolených hodnot.
da: Værdien skal være på listen over tilladte værdier.
de: Der Wert muss in der Liste der zulässigen Werte sein.
el: Η τιμή πρέπει να είναι στη λίστα των επιτρεπόμενων τιμών.
es: El valor debe estar en la lista de valores permitidos.
et: Väärtus peab olema lubatud väärtuste nimekirjas.
fa: مقدار باید در لیست مقادیر مجاز باشد.
fi: Arvon on oltava sallittujen arvojen luettelossa.
fr: La valeur doit être dans la liste des valeurs autorisées.
he: הערך חייב להיות ברשימת הערכים המותרים.
hi: मान सूची में होना चाहिए।
hr: Vrijednost mora biti na listi dopuštenih vrijednosti.
hu: Az értéknek az engedélyezett értékek listájában kell lennie.
id: Nilai harus ada dalam daftar nilai yang diizinkan.
it: Il valore deve essere presente nell'elenco dei valori consentiti.
ja: 値は許可された値のリストに含まれている必要があります。
ka: მნიშვნელობა უნდა იყოს ვალიდური მნიშვნელობების სიაში.
km: ទិន្នន័យ​នេះ​ត្រូវតែមាននៅក្នុងបញ្ជីតម្លៃដែលអនុញ្ញាតតែប៉ុណ្ណោះ។
ko: 값은 허용된 값 목록에 있어야 합니다.
ku: نرخ دەبێت لە لیست بێت.
lo: ຄ່າຕ້ອງຢູ່ໃນລາຍຊື່ຂອງມູນຄ່າທີ່ອະນຸຍາດ.
lv: Vērtībai jābūt sarakstā.
mn: Утга нь зөвшөөрөгдсөн утгуудын жагсаалтад байх ёстой.
ms: Nilai mesti berada dalam senarai nilai yang dibenarkan.
ne: मान अनुमत मानहरूको सूचीमा हुनुपर्छ।
nl: De waarde moet in de lijst met toegestane waarden staan.
no: Verdien må være i listen over tillatte verdier.
pl: Wartość musi być na liście dozwolonych wartości.
pt: O valor deve estar na lista de valores permitidos.
ro: Valoarea trebuie să fie în lista valorilor permise.
ru: Значение должно быть в списке допустимых значений.
sk: Hodnota musí byť v zozname povolených hodnôt.
sl: Vrednost mora biti v seznamu dovoljenih vrednosti.
sq: Vlera duhet të jetë në listën e vlefshme.
sv: Värdet måste vara med i listan över tillåtna värden.
sw: Thamani lazima iwe kwenye orodha ya thamani zinazokubalika.
ta: மதிப்பு அனுமதிக்கப்பட்ட மதிப்புகளின் பட்டியலில் இருக்க வேண்டும்.
th: ข้อมูลนี้ต้องอยู่ในรายการค่าที่อนุญาต
tr: Değer izin verilen değerler listesinde olmalıdır.
uk: Значення має бути в списку дозволених значень.
vi: Giá trị phải nằm trong danh sách các giá trị hợp lệ.
zh: 值必须在允许的值列表中。
zh_hant: 值必須在允許的值列表中。

# ibanErrorText
source: Value must be a valid IBAN.
ar: هذا الحقل يتطلب IBAN صالح.
bg: Това поле изисква валиден IBAN.
bn: একটি বৈধ IBAN প্রয়োজন।
ca: Aquest camp requereix un IBAN vàlid.
cs: Pole vyžaduje platné IBAN.
da: Dette felt kræver en gyldig IBAN.
de: Dieses Feld erfordert eine gültige IBAN.
el: Η τιμή πρέπει να είναι έγκυρο IBAN.
es: Este campo requiere un IBAN válido.
et: See väli nõuab kehtivat IBAN-i.
fa: این ورودی به شماره IBAN معتبر نیاز دارد.
fi: Vaaditaan oikean muotoinen IBAN-tilinumero.
fr: Ce champ nécessite un IBAN valide.
he: שדה זה דורש מספר IBAN תקין.
hi: मान को वैध IBAN होना चाहिए।
hr: Unesite validan IBAN.
hu: Ez a mező érvényes IBAN számot igényel.
id: IBAN tidak valid.
it: Questo campo richiede un IBAN valido.
ja: 有効なIBANを入力してください。
ka: ველი უნდა იყოს სწორი IBAN ნომერი.
km: ទិន្នន័យនេះត្រូវតែជា IBAN តែប៉ុណ្ណោះ។
ko: 유효한 IBAN을 입력해 주세요.
ku: نرخ دەبێت IBAN-ێکی دروست بێت.
lo: ຄ່າໃນຟອມນີ້ຕ້ອງເປັນລະຫັດ IBAN ທີ່ຖືກຕ້ອງ.
lv: Vērtībai jābūt derīgam IBAN.
mn: IBAN алдаатай байна.
ms: Ruangan ini memerlukan IBAN yang sah.
ne: यो क्षेत्रलाई मान्य IBAN चाहिन्छ।
nl: Een geldige IBAN is vereist.
no: Dette feltet krever en gyldig IBAN.
pl: To pole wymaga prawidłowego numeru IBAN.
pt: Este campo requer um IBAN válido.
ro: Acest câmp necesită un IBAN valid.
ru: Поле должно быть действительным IBAN номером.
sk: Toto pole vyžaduje platné IBAN číslo.
sl: Vnesite veljaven IBAN.
sq: Kjo fushë kërkon një IBAN të vlefshëm.
sv: Detta fält kräver ett giltigt IBAN-nummer.
sw: Sehemu hii inahitaji IBAN halali.
ta: இந்த உள்ளீட்டுக்கு சரியான ஐபான் தேவை.
th: ข้อมูลนี้ต้องเป็น IBAN ที่ถูกต้อง
tr: Bu alan geçerli bir IBAN gerektirir.
uk: Поле має бути дійсним IBAN номером.
vi: Yêu cầu nhập đúng số IBAN.
zh: 该字段必须是有效的 IBAN。
zh_hant: 此欄位需要有效的 IBAN。
