Repository: flutter-form-builder-ecosystem/form_builder_validators
Catalog: lib/l10n/intl_*.arb
Languages: ar, bg, bn, ca, cs, da, de, el, es, et, fa, fi, fr, he, hi, hr, hu, id, it, ja, ka, km, ko, ku, lo, lv, mn, ms, ne, nl, no, pl, pt, ro, ru, sk, sl, sq, sv, sw, ta, th, tr, uk, vi, zh, zh_hant

# floatErrorText
source: Value must be a valid floating point number.
ar: يجب أن تكون القيمة رقم عشري صالح.
bg: Стойността трябва да бъде валидно число с плаваща запетая.
bn: মান একটি বৈধ ভাসমান বিন্দু সংখ্যা হতে হবে।
ca: El valor ha de ser un nombre de coma flotant vàlid.
cs: Hodnota musí být platné desetinné číslo.
da: Værdien skal være et gyldigt flydende punkt nummer.
de: Der Wert muss eine gültige Fließkommazahl sein.
el: Η τιμή πρέπει να είναι έγκυρος δεκαδικός αριθμός κινητής υποδιαστολής.
es: El valor debe ser un número de punto flotante válido.
et: Väärtus peab olema kehtiv ujukomaarv.
fa: مقدار باید یک عدد اعشاری معتبر باشد.
fi: Arvon on oltava kelvollinen liukuluku.
fr: La valeur doit être un nombre à virgule flottante valide.
he: הערך חייב להיות מספר נקודה צפה חוקי.
hi: मान्य फ़्लोटिंग पॉइंट नंबर होना चाहिए।
hr: Vrijednost mora biti valjani broj s pomičnim zarezom.
hu: Az értéknek érvényes lebegőpontos számnak kell lennie.
id: Nilai harus berupa angka floating point yang valid.
it: Il valore deve essere un numero in virgola mobile valido.
ja: 値は有効な浮動小数点数でなければなりません。
ka: მნიშვნელობა უნდა იყოს სწორი მცურავი წვეთოვანი რიცხვი.
km: តម្លៃត្រូវតែជាចំនួនទសភាគត្រឹមត្រូវ។
ko: 값은 유효한 부동 소수점 수여야 합니다.
ku: Gerrdê hewce ye ku zêdeya rast bibe.
lo: ຄ່າຕ້ອງເປັນໂຕເລກ float ທີ່ຖືກຕ້ອງ.
lv: Vērtībai jābūt derīgam decimālskaitlim.
mn: Утга нь буцаж ирдэг зөв хөвөгч цэгийн тоо байх ёстой.
ms: Nilai mesti nombor terapung sah.
ne: मान्यता प्राप्त फ्लोटिङ पोइन्ट नम्बर हुनुपर्छ।
nl: Waarde moet een geldig drijvend-komma getal zijn.
no: Verdien må være et gyldig flyttall.
pl: Wartość musi być prawidłową liczbą zmiennoprzecinkową.
pt: O valor deve ser um número de ponto flutuante válido.
ro: Valoarea trebuie să fie un număr zecimal valid.
ru: Значение должно быть допустимым числом с плавающей запятой.
sk: Hodnota musí byť platné desatinné číslo.
sl: Vrednost mora biti veljavno število s plavajočo vejico.
sq: Vlera duhet të jetë një numër i vlefshëm me pikë lundruese.
sv: Värdet måste vara ett giltigt flyttal.
sw: Thamani lazima iwe nambari sahihi ya nukta mvutano.
ta: மதிப்பு சரியான மிதக்கும் புள்ளி எண் ஆக இருக்க வேண்டும்.
th: ค่าต้องเป็นตัวเลขทศนิยมที่ถูกต้อง
tr: Değer geçerli bir noktalı sayı olmalıdır.
uk: Значення повинно бути дійсним числом з плаваючою комою.
vi: Giá trị phải là một số dấu phẩy động hợp lệ.
zh: 值必须是有效的浮点数。
zh_hant: 數值必須為有效的浮點數。

# hexadecimalErrorText
source: Value must be a valid hexadecimal number.
ar: يجب أن تكون القيمة رقم سداسي عشري صالح.
bg: Стойността трябва да бъде валиден шестнадесетичен номер.
bn: মান একটি বৈধ হেক্সাডেসিমাল সংখ্যা হতে হবে।
ca: El valor ha de ser un nombre hexadecimal vàlid.
cs: Hodnota musí být platné šestnáctkové číslo.
da: Værdien skal være et gyldigt hexadecimalt nummer.
de: Der Wert muss eine gültige hexadezimale Zahl sein.
el: Η τιμή πρέπει να είναι έγκυρος δεκαεξαδικός αριθμός.
es: El valor debe ser un número hexadecimal válido.
et: Väärtus peab olema kehtiv kuueteistkümnendkohtade süsteemi arv.
fa: مقدار باید یک عدد هگزادسیمال معتبر باشد.
fi: Arvon on oltava kelvollinen heksadesimaaliluku.
fr: La valeur doit être un nombre hexadécimal valide.
he: הערך חייב להיות מספר הקסדצימלי חוקי.
hi: मान्य हेक्साडेसिमल नंबर होना चाहिए।
hr: Vrijednost mora biti valjani heksadecimalni broj.
hu: Az értéknek érvényes hexadecimális számnak kell lennie.
id: Nilai harus berupa angka heksadesimal yang valid.
it: Il valore deve essere un numero esadecimale valido.
ja: 値は有効な16進数でなければなりません。
ka: მნიშვნელობა უნდა იყოს სწორი თექვსმეტობითი რიცხვი.
km: តម្លៃត្រូវតែជាលេខសិប្បកម្មត្រឹមត្រូវ។
ko: 값은 유효한 16진수여야 합니다.
ku: Gerrdê hewce ye ku hexa de rast bibe.
lo: ຄ່າຕ້ອງເປັນໂຕເລກເຮັກຊະເດສິມທີ່ຖືກຕ້ອງ.
lv: Vērtībai jābūt derīgam heksadecimālam skaitlim.
mn: Утга нь буцаж ирдэг зөв арван зургаатын тоо байх ёстой.
ms: Nilai mesti nombor heksadesimal sah.
ne: मान्यता प्राप्त हेक्साडेसिमल नम्बर हुनुपर्छ।
nl: Waarde moet een geldig hexadecimaal getal zijn.
no: Verdien må være et gyldig heksadesimalt tall.
pl: Wartość musi być prawidłową liczbą szesnastkową.
pt: O valor deve ser um número hexadecimal válido.
ro: Valoarea trebuie să fie un număr hexadecimal valid.
ru: Значение должно быть допустимым шестнадцатеричным числом.
sk: Hodnota musí byť platné hexadecimálne číslo.
sl: Vrednost mora biti veljavno šestnajstiško število.
sq: Vlera duhet të jetë një numër i vlefshëm heksadecimal.
sv: Värdet måste vara ett giltigt hexadecimaltal.
sw: Thamani lazima iwe nambari sahihi ya hekshadesimali.
ta: மதிப்பு சரியான ஹெக்சாடெசிமல் எண் ஆக இருக்க வேண்டும்.
th: ค่าต้องเป็นเลขฐานสิบหกที่ถูกต้อง
tr: Değer geçerli bir onaltılık sayı olmalıdır.
uk: Значення повинно бути дійсним шістнадцятковим числом.
vi: Giá trị phải là một số thập lục phân hợp lệ.
zh: 值必须是有效的十六进制数。
zh_hant: 數值必須為有效的十六進位數字。

# betweenNumErrorText
source: Value must be {minInclusive, select, true{greater than or equal to} other{greater than}} {min} and {maxInclusive, select, true{less than or equal to} other{less than}} {max}
ar: يجب أن تكون القيمة {minInclusive, select, true{أكبر من أو تساوي} other{أكبر من}} {min} و{maxInclusive, select, true{أقل من أو تساوي} other{أقل من}} {max}
bg: Стойността трябва да бъде {minInclusive, select, true{по-голяма или равна на} other{по-голяма от}} {min} и {maxInclusive, select, true{по-малка или равна на} other{по-малка от}} {max}
bn: মান অবশ্যই {minInclusive, select, true{বড় বা সমান হতে হবে} other{বড় হতে হবে}} {min} এবং {maxInclusive, select, true{ছোট বা সমান হতে হবে} other{ছোট হতে হবে}} {max}
ca: El valor ha de ser {minInclusive, select, true{més gran o igual que} other{més gran que}} {min} i {maxInclusive, select, true{més petit o igual que} other{més petit que}} {max}
cs: Hodnota musí být {minInclusive, select, true{větší nebo rovna} other{větší než}} {min} a {maxInclusive, select, true{menší nebo rovna} other{menší než}} {max}
da: Værdien skal være {minInclusive, select, true{større end eller lig med} other{større end}} {min} og {maxInclusive, select, true{mindre end eller lig med} other{mindre end}} {max}
de: Der Wert muss {minInclusive, select, true{größer oder gleich} other{größer als}} {min} und {maxInclusive, select, true{kleiner oder gleich} other{kleiner als}} {max} sein
el: Η τιμή πρέπει να είναι {minInclusive, select, true{μεγαλύτερη ή ίση με} other{μεγαλύτερη από}} {min} και {maxInclusive, select, true{μικρότερη ή ίση με} other{μικρότερη από}} {max}
es: El valor debe ser {minInclusive, select, true{mayor o igual que} other{mayor que}} {min} y {maxInclusive, select, true{menor o igual que} other{menor que}} {max}
et: Väärtus peab olema {minInclusive, select, true{suurem või võrdne kui} other{suurem kui}} {min} ja {maxInclusive, select, true{väiksem või võrdne kui} other{väiksem kui}} {max}
fa: مقدار باید {minInclusive, select, true{بزرگتر یا مساوی با} other{بزرگتر از}} {min} و {maxInclusive, select, true{کوچکتر یا مساوی با} other{کوچکتر از}} {max} باشد
fi: Arvon täytyy olla {minInclusive, select, true{suurempi tai yhtä suuri kuin} other{suurempi kuin}} {min} ja {maxInclusive, select, true{pienempi tai yhtä suuri kuin} other{pienempi kuin}} {max}
fr: La valeur doit être {minInclusive, select, true{supérieure ou égale à} other{supérieure à}} {min} et {maxInclusive, select, true{inférieure ou égale à} other{inférieure à}} {max}
he: הערך חייב להיות {minInclusive, select, true{גדול או שווה ל} other{גדול מ}} {min} ו{maxInclusive, select, true{קטן או שווה ל} other{קטן מ}} {max}
hi: मान {minInclusive, select, true{से बड़ा या बराबर} other{से बड़ा}} {min} और {maxInclusive, select, true{से छोटा या बराबर} other{से छोटा}} {max} होना चाहिए
hr: Vrijednost mora biti {minInclusive, select, true{veća ili jednaka} other{veća od}} {min} i {maxInclusive, select, true{manja ili jednaka} other{manja od}} {max}
hu: Az értéknek {minInclusive, select, true{nagyobbnak vagy egyenlőnek kell lennie mint} other{nagyobbnak kell lennie mint}} {min} és {maxInclusive, select, true{kisebbnek vagy egyenlőnek kell lennie mint} other{kisebbnek kell lennie mint}} {max}
id: Nilai harus {minInclusive, select, true{lebih besar dari atau sama dengan} other{lebih besar dari}} {min} dan {maxInclusive, select, true{kurang dari atau sama dengan} other{kurang dari}} {max}
it: Il valore deve essere {minInclusive, select, true{maggiore o uguale a} other{maggiore di}} {min} e {maxInclusive, select, true{minore o uguale a} other{minore di}} {max}
ja: 値は{minInclusive, select, true{以上} other{より大きい}} {min} かつ {maxInclusive, select, true{以下} other{未満}} {max} である必要があります
km: តម្លៃត្រូវតែ {minInclusive, select, true{ធំជាងឬស្មើ} other{ធំជាង}} {min} និង {maxInclusive, select, true{តូចជាងឬស្មើ} other{តូចជាង}} {max}
ko: 값은 {min}보다 {minInclusive, select, true{크거나 같고} other{크고}} {max}보다 {maxInclusive, select, true{작거나 같아야} other{작아야}} 합니다
ku: Nirx divê {minInclusive, select, true{mezintir an wekhev be ji} other{mezintir be ji}} {min} û {maxInclusive, select, true{kêmtir an wekhev be ji} other{kêmtir be ji}} {max}
lo: ຄ່າຕ້ອງ {minInclusive, select, true{ໃຫຍ່ກວ່າ ຫຼື ເທົ່າກັບ} other{ໃຫຍ່ກວ່າ}} {min} ແລະ {maxInclusive, select, true{ນ້ອຍກວ່າ ຫຼື ເທົ່າກັບ} other{ນ້ອຍກວ່າ}} {max}
lv: Vērtībai jābūt {minInclusive, select, true{lielākai vai vienādai ar} other{lielākai nekā}} {min} un {maxInclusive, select, true{mazākai vai vienādai ar} other{mazākai nekā}} {max}
mn: Утга нь {minInclusive, select, true{-аас их буюу тэнцүү} other{-аас их}} {min} ба {maxInclusive, select, true{-аас бага буюу тэнцүү} other{-аас бага}} {max} байх ёстой
ms: Nilai mesti {minInclusive, select, true{lebih besar atau sama dengan} other{lebih besar daripada}} {min} dan {maxInclusive, select, true{kurang atau sama dengan} other{kurang daripada}} {max}
ne: मान {minInclusive, select, true{बराबर वा बढी} other{भन्दा बढी}} {min} र {maxInclusive, select, true{बराबर वा कम} other{भन्दा कम}} {max} हुनुपर्छ
nl: Waarde moet {minInclusive, select, true{groter dan of gelijk aan} other{groter dan}} {min} en {maxInclusive, select, true{kleiner dan of gelijk aan} other{kleiner dan}} {max} zijn
no: Verdien må være {minInclusive, select, true{større enn eller lik} other{større enn}} {min} og {maxInclusive, select, true{mindre enn eller lik} other{mindre enn}} {max}
pl: Wartość musi być {minInclusive, select, true{większa lub równa} other{większa niż}} {min} i {maxInclusive, select, true{mniejsza lub równa} other{mniejsza niż}} {max}
pt: O valor deve ser {minInclusive, select, true{maior ou igual a} other{maior que}} {min} e {maxInclusive, select, true{menor ou igual a} other{menor que}} {max}
ro: Valoarea trebuie să fie {minInclusive, select, true{mai mare sau egală cu} other{mai mare decât}} {min} și {maxInclusive, select, true{mai mică sau egală cu} other{mai mică decât}} {max}
ru: Значение должно быть {minInclusive, select, true{больше или равно} other{больше}} {min} и {maxInclusive, select, true{меньше или равно} other{меньше}} {max}
sk: Hodnota musí byť {minInclusive, select, true{väčšia alebo rovná} other{väčšia ako}} {min} a {maxInclusive, select, true{menšia alebo rovná} other{menšia ako}} {max}
sl: Vrednost mora biti {minInclusive, select, true{večja ali enaka} other{večja od}} {min} in {maxInclusive, select, true{manjša ali enaka} other{manjša od}} {max}
sq: Vlera duhet të jetë {minInclusive, select, true{më e madhe ose e barabartë me} other{më e madhe se}} {min} dhe {maxInclusive, select, true{më e vogël ose e barabartë me} other{më e vogël se}} {max}
sv: Värdet måste vara {minInclusive, select, true{större än eller lika med} other{större än}} {min} och {maxInclusive, select, true{mindre än eller lika med} other{mindre än}} {max}
sw: Thamani lazima iwe {minInclusive, select, true{kubwa kuliko au sawa na} other{kubwa kuliko}} {min} na {maxInclusive, select, true{ndogo kuliko au sawa na} other{ndogo kuliko}} {max}
ta: மதிப்பு {minInclusive, select, true{இதற்கு சமமாகவோ அல்லது அதிகமாகவோ} other{இதற்கு மேல்}} {min} மற்றும் {maxInclusive, select, true{இதற்கு சமமாகவோ அல்லது குறைவாகவோ} other{இதற்கு குறைவாக}} {max} இருக்க வேண்டும்
th: ค่าต้องอยู่ {minInclusive, select, true{มากกว่าหรือเท่ากับ} other{มากกว่า}} {min} และ {maxInclusive, select, true{น้อยกว่าหรือเท่ากับ} other{น้อยกว่า}} {max}
tr: Değer {minInclusive, select, true{büyük veya eşit olmalı} other{büyük olmalı}} {min} ve {maxInclusive, select, true{küçük veya eşit olmalı} other{küçük olmalı}} {max}
uk: Значення має бути {minInclusive, select, true{більше або дорівнювати} other{більше ніж}} {min} та {maxInclusive, select, true{менше або дорівнювати} other{менше ніж}} {max}
vi: Giá trị phải {minInclusive, select, true{lớn hơn hoặc bằng} other{lớn hơn}} {min} và {maxInclusive, select, true{nhỏ hơn hoặc bằng} other{nhỏ hơn}} {max}
zh: 数值必须{minInclusive, select, true{大于或等于} other{大于}}{min}且{maxInclusive, select, true{小于或等于} other{小于}}{max}
zh_hant: 數值必須{minInclusive, select, true{大於或等於} other{大於}} {min} 且 {maxInclusive, select, true{小於或等於} other{小於}} {max}

# booleanErrorText
source: This field requires a valid boolean (true or false).
ar: يتطلب هذا الحقل قيمة منطقية صحيحة (صح أو خطأ).
bg: Това поле изисква валидна булева стойност (вярно или грешно).
bn: এই ক্ষেত্রে একটি বৈধ বুলিয়ান মান (সত্য বা মিথ্যা) প্রয়োজন।
ca: Aquest camp requereix un valor booleà vàlid (true o false).
cs: Toto pole vyžaduje platnou logickou hodnotu (true nebo false).
da: Dette felt kræver en gyldig boolean (sand eller falsk).
de: Dieses Feld erfordert einen gültigen booleschen Wert (true oder false).
el: Αυτό το πεδίο απαιτεί μια έγκυρη λογική τιμή (true ή false).
es: Este campo requiere un valor booleano válido (verdadero o falso).
et: See väli nõuab kehtivat tõeväärtust (tõene või väär).
fa: این فیلد نیاز به یک مقدار منطقی معتبر دارد (درست یا نادرست)
fi: Tämä kenttä vaatii kelvollisen totuusarvon (tosi tai epätosi)
fr: Ce champ nécessite une valeur booléenne valide (vrai ou faux).
he: שדה זה דורש ערך בוליאני תקין (אמת או שקר)
hi: इस फ़ील्ड में एक मान्य बूलियन (सत्य या असत्य) की आवश्यकता है
hr: Ovo polje zahtijeva valjanu boolean vrijednost (true ili false).
hu: Ehhez a mezőhöz érvényes logikai érték szükséges (igaz vagy hamis).
id: Bidang ini memerlukan nilai boolean yang valid (true atau false).
it: Questo campo richiede un valore booleano valido (vero o falso).
ja: このフィールドには有効な真偽値（true または false）が必要です
km: វាលនេះត្រូវការតម្លៃប៊ូលីនត្រឹមត្រូវ (ពិត ឬ មិនពិត)
ko: 이 필드는 유효한 불리언 값(true 또는 false)이 필요합니다
ku: Ev qad pêdivî bi nirxeke rast a boolean e (rast an şaş)
lo: ຊ່ອງນີ້ຕ້ອງການຄ່າ boolean ທີ່ຖືກຕ້ອງ (true ຫຼື false)
lv: Šim laukam nepieciešama derīga būla vērtība (true vai false)
mn: Энэ талбарт зөвхөн үнэн эсвэл худал утга оруулах шаардлагатай
ms: Medan ini memerlukan nilai boolean yang sah (benar atau palsu)
ne: यो फिल्डमा मान्य बुलियन (सत्य वा असत्य) आवश्यक छ
nl: Dit veld vereist een geldige booleaanse waarde (true of false)
no: Dette feltet krever en gyldig boolsk verdi (sann eller usann)
pl: To pole wymaga prawidłowej wartości logicznej (prawda lub fałsz)
pt: Este campo requer um valor booleano válido (verdadeiro ou falso)
ro: Acest câmp necesită o valoare booleană validă (adevărat sau fals)
ru: Это поле требует допустимое логическое значение (true или false)
sk: Toto pole vyžaduje platnú boolovskú hodnotu (true alebo false)
sl: To polje zahteva veljavno logično vrednost (true ali false)
sq: Kjo fushë kërkon një vlerë të vlefshme booleane (true ose false)
sv: Detta fält kräver ett giltigt booleskt värde (sant eller falskt)
sw: Sehemu hii inahitaji boolean halali (kweli au si kweli)
ta: இந்த புலம் சரியான பூலியன் மதிப்பை (உண்மை அல்லது பொய்) தேவைப்படுகிறது
th: ฟิลด์นี้ต้องการค่าบูลีนที่ถูกต้อง (จริงหรือเท็จ)
tr: Bu alan geçerli bir boolean değeri (true veya false) gerektirir.
uk: Це поле вимагає дійсного логічного значення (true або false)
vi: Trường này yêu cầu một giá trị boolean hợp lệ (true hoặc false)
zh: 此字段需要有效的布尔值（true或false）
zh_hant: 此欄位需要有效的布林值（true 或 false）

# dateMustBeAfterErrorText
source: Date must be after {reference}.
ar: يجب أن يكون التاريخ بعد {reference}.
bg: Датата трябва да бъде след {reference}.
bn: তারিখ অবশ্যই {reference} এর পরে হতে হবে।
ca: La data ha de ser posterior a {reference}.
cs: Datum musí být po {reference}.
da: Datoen skal være efter {reference}.
de: Das Datum muss nach {reference} liegen.
el: Η ημερομηνία πρέπει να είναι μετά τις {reference}.
es: La fecha debe ser posterior a {reference}.
et: Kuupäev peab olema pärast {reference}.
fa: تاریخ باید بعد از {reference} باشد
fi: Päivämäärän täytyy olla {reference} jälkeen
fr: La date doit être après {reference}.
he: התאריך חייב להיות אחרי {reference}
hi: दिनांक {reference} के बाद का होना चाहिए
hr: Datum mora biti nakon {reference}.
hu: A dátumnak {reference} utáninak kell lennie.
id: Tanggal harus setelah {reference}.
it: La data deve essere successiva a {reference}.
ja: 日付は{reference}より後である必要があります
km: កាលបរិច្ឆេទត្រូវតែនៅក្រោយ {reference}
ko: 날짜는 {reference} 이후여야 합니다
ku: Dîrok divê piştî {reference} be
lo: ວັນທີຕ້ອງຢູ່ຫຼັງຈາກ {reference}
lv: Datumam jābūt pēc {reference}
mn: Огноо {reference}-с хойш байх ёстой
ms: Tarikh mesti selepas {reference}
ne: मिति {reference} पछि हुनुपर्छ
nl: Datum moet na {reference} zijn
no: Datoen må være etter {reference}
pl: Data musi być późniejsza niż {reference}
pt: A data deve ser posterior a {reference}
ro: Data trebuie să fie după {reference}
ru: Дата должна быть после {reference}
sk: Dátum musí byť po {reference}
sl: Datum mora biti po {reference}
sq: Data duhet të jetë pas {reference}
sv: Datumet måste vara efter {reference}
sw: Tarehe lazima iwe baada ya {reference}
ta: தேதி {reference}க்கு பிறகு இருக்க வேண்டும்
th: วันที่ต้องอยู่หลัง {reference}
tr: Tarih {reference} tarihinden sonra olmalıdır.
uk: Дата має бути після {reference}
vi: Ngày phải sau {reference}
zh: 日期必须在{reference}之后
zh_hant: 日期必須在 {reference} 之後

# dateMustBeBeforeErrorText
source: Date must be before {reference}.
ar: يجب أن يكون التاريخ قبل {reference}.
bg: Датата трябва да бъде преди {reference}.
bn: তারিখ অবশ্যই {reference} এর আগে হতে হবে।
ca: La data ha de ser anterior a {reference}.
cs: Datum musí být před {reference}.
da: Datoen skal være før {reference}.
de: Das Datum muss vor {reference} liegen.
el: Η ημερομηνία πρέπει να είναι πριν τις {reference}.
es: La fecha debe ser anterior a {reference}.
et: Kuupäev peab olema enne {reference}.
fa: تاریخ باید قبل از {reference} باشد
fi: Päivämäärän täytyy olla ennen {reference}
fr: La date doit être avant {reference}.
he: התאריך חייב להיות לפני {reference}
hi: दिनांक {reference} से पहले का होना चाहिए
hr: Datum mora biti prije {reference}.
hu: A dátumnak {reference} előttinek kell lennie.
id: Tanggal harus sebelum {reference}.
it: La data deve essere precedente a {reference}.
ja: 日付は{reference}より前である必要があります
km: កាលបរិច្ឆេទត្រូវតែនៅមុន {reference}
ko: 날짜는 {reference} 이전이어야 합니다
ku: Dîrok divê beriya {reference} be
lo: ວັນທີຕ້ອງຢູ່ກ່ອນ {reference}
lv: Datumam jābūt pirms {reference}
mn: Огноо {reference}-с өмнө байх ёстой
ms: Tarikh mesti sebelum {reference}
ne: मिति {reference} अघि हुनुपर्छ
nl: Datum moet voor {reference} zijn
no: Datoen må være før {reference}
pl: Data musi być wcześniejsza niż {reference}
pt: A data deve ser anterior a {reference}
ro: Data trebuie să fie înainte de {reference}
ru: Дата должна быть до {reference}
sk: Dátum musí byť pred {reference}
sl: Datum mora biti pred {reference}
sq: Data duhet të jetë para {reference}
sv: Datumet måste vara före {reference}
sw: Tarehe lazima iwe kabla ya {reference}
ta: தேதி {reference}க்கு முன் இருக்க வேண்டும்
th: วันที่ต้องอยู่ก่อน {reference}
tr: Tarih {reference} tarihinden önce olmalıdır.
uk: Дата має бути до {reference}
vi: Ngày phải trước {reference}
zh: 日期必须在{reference}之前
zh_hant: 日期必須在 {reference} 之前

# dateMustBeBetweenErrorText
source: Date must be between {minReference} and {maxReference}.
ar: يجب أن يكون التاريخ بين {minReference} و {maxReference}.
bg: Датата трябва да бъде между {minReference} и {maxReference}.
bn: তারিখ অবশ্যই {minReference} এবং {maxReference} এর মধ্যে হতে হবে।
ca: La data ha d'estar entre {minReference} i {maxReference}.
cs: Datum musí být mezi {minReference} a {maxReference}.
da: Datoen skal være mellem {minReference} og {maxReference}.
de: Das Datum muss zwischen {minReference} und {maxReference} liegen.
el: Η ημερομηνία πρέπει να είναι μεταξύ {minReference} και {maxReference}.
es: La fecha debe estar entre {minReference} y {maxReference}.
et: Kuupäev peab olema vahemikus {minReference} kuni {maxReference}.
fa: تاریخ باید بین {minReference} و {maxReference} باشد
fi: Päivämäärän täytyy olla välillä {minReference} ja {maxReference}
fr: La date doit être comprise entre {minReference} et {maxReference}.
he: התאריך חייב להיות בין {minReference} לבין {maxReference}
hi: दिनांक {minReference} और {maxReference} के बीच होना चाहिए
hr: Datum mora biti između {minReference} i {maxReference}.
hu: A dátumnak {minReference} és {maxReference} között kell lennie.
id: Tanggal harus di antara {minReference} dan {maxReference}.
it: La data deve essere compresa tra {minReference} e {maxReference}.
ja: 日付は{minReference}から{maxReference}の間である必要があります
km: កាលបរិច្ឆេទត្រូវតែនៅចន្លោះ {minReference} និង {maxReference}
ko: 날짜는 {minReference}와 {maxReference} 사이여야 합니다
ku: Dîrok divê di navbera {minReference} û {maxReference} de be
lo: ວັນທີຕ້ອງຢູ່ລະຫວ່າງ {minReference} ແລະ {maxReference}
lv: Datumam jābūt starp {minReference} un {maxReference}
mn: Огноо {minReference} ба {maxReference}-ны хооронд байх ёстой
ms: Tarikh mesti antara {minReference} dan {maxReference}
ne: मिति {minReference} र {maxReference} बीच हुनुपर्छ
nl: Datum moet tussen {minReference} en {maxReference} liggen
no: Datoen må være mellom {minReference} og {maxReference}
pl: Data musi być pomiędzy {minReference} a {maxReference}
pt: A data deve estar entre {minReference} e {maxReference}
ro: Data trebuie să fie între {minReference} și {maxReference}
ru: Дата должна быть между {minReference} и {maxReference}
sk: Dátum musí byť medzi {minReference} a {maxReference}
sl: Datum mora biti med {minReference} in {maxReference}
sq: Data duhet të jetë midis {minReference} dhe {maxReference}
sv: Datumet måste vara mellan {minReference} och {maxReference}
sw: Tarehe lazima iwe kati ya {minReference} na {maxReference}
ta: தேதி {minReference} மற்றும் {maxReference}க்கு இடையில் இருக்க வேண்டும்
th: วันที่ต้องอยู่ระหว่าง {minReference} และ {maxReference}
tr: Tarih {minReference} ve {maxReference} arasında olmalıdır.
uk: Дата має бути між {minReference} та {maxReference}
vi: Ngày phải nằm giữa {minReference} và {maxReference}
zh: 日期必须在{minReference}和{maxReference}之间
zh_hant: 日期必須在 {minReference} 和 {maxReference} 之間
