Repository: flutter-form-builder-ecosystem/form_builder_validators
Catalog: lib/l10n/intl_*.arb
Languages: ar, bg, bn, ca, cs, da, de, el, es, et, fa, fi, fr, he, hi, hr, hu, id, it, ja, ka, km, ko, ku, lo, lv, mn, ms, ne, nl, no, pl, pt, ro, ru, sk, sl, sq, sv, sw, ta, th, tr, uk, vi, zh, zh_hant

# dateTimeErrorText
source: This field requires a valid datetime.
ar: يتطلب هذا الحقل تاريخًا وتوقيتًا صحيحًا.
bg: Това поле изисква валидна дата и час.
bn: এই ক্ষেত্রে একটি বৈধ তারিখ ও সময় প্রয়োজন।
ca: Aquest camp requereix una data i hora vàlides.
cs: Toto pole vyžaduje platné datum a čas.
da: Dette felt kræver en gyldig dato og tidspunkt.
de: Dieses Feld erfordert eine gültige Datums- und Zeitangabe.
el: Αυτό το πεδίο απαιτεί μια έγκυρη ημερομηνία και ώρα.
es: Este campo requiere una fecha y hora válidas.
et: See väli nõuab kehtivat kuupäeva ja kellaaega.
fa: این فیلد نیاز به یک تاریخ و زمان معتبر دارد
fi: Tämä kenttä vaatii kelvollisen päivämäärän ja ajan
fr: Ce champ nécessite une date et une heure valides.
he: שדה זה דורש תאריך ושעה תקינים
hi: इस फ़ील्ड में एक मान्य दिनांक और समय की आवश्यकता है
hr: Ovo polje zahtijeva valjani datum i vrijeme.
hu: Ehhez a mezőhöz érvényes dátum és időpont szükséges.
id: Bidang ini memerlukan datetime yang valid.
it: Questo campo richiede una data e ora valida.
ja: このフィールドには有効な日時が必要です
km: វាលនេះត្រូវការកាលបរិច្ឆេទនិងពេលវេលាត្រឹមត្រូវ
ko: 이 필드는 유효한 날짜/시간이 필요합니다
ku: Ev qad pêdivî bi dîrokeke derbasdar e
lo: ຊ່ອງນີ້ຕ້ອງການວັນທີແລະເວລາທີ່ຖືກຕ້ອງ
lv: Šim laukam nepieciešams derīgs datums un laiks
mn: Энэ талбарт зөв огноо оруулах шаардлагатай
ms: Medan ini memerlukan tarikh dan masa yang sah
ne: यो फिल्डमा मान्य मिति र समय आवश्यक छ
nl: Dit veld vereist een geldige datum en tijd
no: Dette feltet krever en gyldig dato og tid
pl: To pole wymaga prawidłowej daty i godziny
pt: Este campo requer uma data e hora válidas
ro: Acest câmp necesită o dată și oră validă
ru: Это поле требует действительную дату и время
sk: Toto pole vyžaduje platný dátum a čas
sl: To polje zahteva veljaven datum in čas
sq: Kjo fushë kërkon një datë të vlefshme
sv: Detta fält kräver ett giltigt datum och tid
sw: Sehemu hii inahitaji tarehe na wakati halali
ta: இந்த புலம் சரியான தேதி மற்றும் நேரத்தை தேவைப்படுகிறது
th: ฟิลด์นี้ต้องการวันที่และเวลาที่ถูกต้อง
tr: Bu alan geçerli bir tarih ve saat gerektirir.
uk: Це поле вимагає дійсної дати та часу
vi: Trường này yêu cầu một ngày giờ hợp lệ
zh: 此字段需要有效的日期时间
zh_hant: 此欄位需要有效的日期時間

# greaterThanErrorText
source: Value must be greater than {min}.
ar: يجب أن تكون القيمة أكبر من {min}.
bg: Стойността трябва да бъде по-голяма от {min}.
bn: মান অবশ্যই {min} এর চেয়ে বড় হতে হবে।
ca: El valor ha de ser més gran que {min}.
cs: Hodnota musí být větší než {min}.
da: Værdien skal være større end {min}.
de: Der Wert muss größer als {min} sein.
el: Η τιμή πρέπει να είναι μεγαλύτερη από {min}.
es: El valor debe ser mayor que {min}.
et: Väärtus peab olema suurem kui {min}.
fa: مقدار باید بزرگتر از {min} باشد
fi: Arvon täytyy olla suurempi kuin {min}
fr: La valeur doit être supérieure à {min}.
he: הערך חייב להיות גדול מ-{min}
hi: मान {min} से बड़ा होना चाहिए
hr: Vrijednost mora biti veća od {min}.
hu: Az értéknek nagyobbnak kell lennie mint {min}.
id: Nilai harus lebih besar dari {min}.
it: Il valore deve essere maggiore di {min}.
ja: 値は{min}より大きい必要があります
km: តម្លៃត្រូវតែធំជាង {min}
ko: 값은 {min}보다 커야 합니다
ku: Nirx divê ji {min} mezintir be
lo: ຄ່າຕ້ອງໃຫຍ່ກວ່າ {min}
lv: Vērtībai jābūt lielākai par {min}
mn: Утга {min}-аас их байх ёстой
ms: Nilai mesti lebih besar daripada {min}
ne: मान {min} भन्दा बढी हुनुपर्छ
nl: Waarde moet groter zijn dan {min}
no: Verdien må være større enn {min}
pl: Wartość musi być większa niż {min}
pt: O valor deve ser maior que {min}
ro: Valoarea trebuie să fie mai mare decât {min}
ru: Значение должно быть больше {min}
sk: Hodnota musí byť väčšia ako {min}
sl: Vrednost mora biti večja od {min}
sq: Vlera duhet të jetë më e madhe se {min}
sv: Värdet måste vara större än {min}
sw: Thamani lazima iwe kubwa kuliko {min}
ta: மதிப்பு {min}ஐ விட அதிகமாக இருக்க வேண்டும்
th: ค่าต้องมากกว่า {min}
tr: Değer {min} değerinden büyük olmalıdır.
uk: Значення має бути більше ніж {min}
vi: Giá trị phải lớn hơn {min}
zh: 数值必须大于{min}
zh_hant: 數值必須大於 {min}

# greaterThanOrEqualToErrorText
source: Value must be greater than or equal to {min}.
ar: يجب أن تكون القيمة أكبر من أو تساوي {min}.
bg: Стойността трябва да бъде по-голяма или равна на {min}.
bn: মান অবশ্যই {min} এর চেয়ে বড় বা সমান হতে হবে।
ca: El valor ha de ser més gran o igual que {min}.
cs: Hodnota musí být větší nebo rovna {min}.
da: Værdien skal være større end eller lig med {min}.
de: Der Wert muss größer oder gleich {min} sein.
el: Η τιμή πρέπει να είναι μεγαλύτερη ή ίση με {min}.
es: El valor debe ser mayor o igual que {min}.
et: Väärtus peab olema suurem või võrdne kui {min}.
fa: مقدار باید بزرگتر یا مساوی با {min} باشد
fi: Arvon täytyy olla suurempi tai yhtä suuri kuin {min}
fr: La valeur doit être supérieure ou égale à {min}.
he: הערך חייב להיות גדול או שווה ל-{min}
hi: मान {min} से बड़ा या बराबर होना चाहिए
hr: Vrijednost mora biti veća ili jednaka {min}.
hu: Az értéknek nagyobbnak vagy egyenlőnek kell lennie mint {min}.
id: Nilai harus lebih besar dari atau sama dengan {min}.
it: Il valore deve essere maggiore o uguale a {min}.
ja: 値は{min}以上である必要があります
km: តម្លៃត្រូវតែធំជាងឬស្មើ {min}
ko: 값은 {min}보다 크거나 같아야 합니다
ku: Nirx divê ji {min} mezintir an wekhev be
lo: ຄ່າຕ້ອງໃຫຍ່ກວ່າ ຫຼື ເທົ່າກັບ {min}
lv: Vērtībai jābūt lielākai vai vienādai ar {min}
mn: Утга {min}-тай тэнцүү эсвэл түүнээс их байх ёстой
ms: Nilai mesti lebih besar atau sama dengan {min}
ne: मान {min} बराबर वा बढी हुनुपर्छ
nl: Waarde moet groter dan of gelijk zijn aan {min}
no: Verdien må være større enn eller lik {min}
pl: Wartość musi być większa lub równa {min}
pt: O valor deve ser maior ou igual a {min}
ro: Valoarea trebuie să fie mai mare sau egală cu {min}
ru: Значение должно быть больше или равно {min}
sk: Hodnota musí byť väčšia alebo rovná {min}
sl: Vrednost mora biti večja ali enaka {min}
sq: Vlera duhet të jetë më e madhe ose e barabartë me {min}
sv: Värdet måste vara större än eller lika med {min}
sw: Thamani lazima iwe kubwa kuliko au sawa na {min}
ta: மதிப்பு {min}ஐ விட அதிகமாக அல்லது சமமாக இருக்க வேண்டும்
th: ค่าต้องมากกว่าหรือเท่ากับ {min}
tr: Değer {min} değerinden büyük veya eşit olmalıdır.
uk: Значення має бути більше або дорівнювати {min}
vi: Giá trị phải lớn hơn hoặc bằng {min}
zh: 数值必须大于或等于{min}
zh_hant: 數值必須大於或等於 {min}

# isOptionalErrorText
source: The field is optional, otherwise, {nextErrorMessage}'
ar: هذا الحقل اختياري، وإلا، {nextErrorMessage}
bg: Полето е незадължително, в противен случай {nextErrorMessage}
bn: এই ক্ষেত্রটি ঐচ্ছিক, অন্যথায় {nextErrorMessage}
ca: El camp és opcional, en cas contrari, {nextErrorMessage}'
cs: Pole je volitelné, jinak {nextErrorMessage}
da: Feltet er valgfrit, ellers {nextErrorMessage}
de: Das Feld ist optional, andernfalls {nextErrorMessage}
el: Το πεδίο είναι προαιρετικό, διαφορετικά, {nextErrorMessage}'
es: El campo es opcional, de lo contrario, {nextErrorMessage}
et: Väli on valikuline, vastasel juhul {nextErrorMessage}
fa: این فیلد اختیاری است، در غیر این صورت، {nextErrorMessage}
fi: Kenttä on valinnainen, muuten {nextErrorMessage}
fr: Le champ est optionnel, sinon, {nextErrorMessage}
he: השדה הוא אופציונלי, אחרת, {nextErrorMessage}
hi: यह फ़ील्ड वैकल्पिक है, अन्यथा {nextErrorMessage}
hr: Polje je neobavezno, u suprotnom, {nextErrorMessage}
hu: A mező opcionális, különben {nextErrorMessage}
id: Bidang ini bersifat opsional, jika tidak, {nextErrorMessage}
it: Il campo è opzionale, altrimenti, {nextErrorMessage}
ja: このフィールドは任意です。入力する場合は{nextErrorMessage}
km: វាលនេះជាជម្រើស បើមិនដូច្នោះទេ {nextErrorMessage}
ko: 이 필드는 선택사항이며, 입력 시 {nextErrorMessage}
ku: Ev qad bijarte ye, wekî din, {nextErrorMessage}
lo: ຊ່ອງນີ້ເປັນທາງເລືອກ, ຖ້າບໍ່ດັ່ງນັ້ນ, {nextErrorMessage}
lv: Lauks ir neobligāts, pretējā gadījumā {nextErrorMessage}
mn: Талбар нь заавал биш, эсвэл {nextErrorMessage}
ms: Medan ini adalah pilihan, jika tidak, {nextErrorMessage}
ne: यो फिल्ड वैकल्पिक छ, अन्यथा, {nextErrorMessage}
nl: Het veld is optioneel, anders {nextErrorMessage}
no: Feltet er valgfritt, ellers {nextErrorMessage}
pl: Pole jest opcjonalne, w przeciwnym razie {nextErrorMessage}
pt: O campo é opcional, caso contrário, {nextErrorMessage}
ro: Câmpul este opțional, în caz contrar, {nextErrorMessage}
ru: Поле является необязательным, в противном случае {nextErrorMessage}
sk: Pole je voliteľné, v opačnom prípade {nextErrorMessage}
sl: Polje je neobvezno, sicer {nextErrorMessage}
sq: Fusha është opsionale, përndryshe, {nextErrorMessage}
sv: Fältet är valfritt, annars {nextErrorMessage}
sw: Sehemu hii ni hiari, vinginevyo, {nextErrorMessage}
ta: இந்த புலம் விருப்பத்திற்குரியது, இல்லையெனில், {nextErrorMessage}
th: ฟิลด์นี้เป็นตัวเลือก มิฉะนั้น {nextErrorMessage}
tr: Bu alan isteğe bağlıdır, aksi takdirde {nextErrorMessage}
uk: Поле є необов'язковим, в іншому випадку {nextErrorMessage}
vi: Trường này là tùy chọn, nếu không thì {nextErrorMessage}
zh: 此字段是可选的，否则，{nextErrorMessage}
zh_hant: 此欄位為選填，否則，{nextErrorMessage}

# isStringErrorText
source: This field requires a valid string.
ar: يتطلب هذا الحقل نصًا صحيحًا.
bg: Това поле изисква валиден текстов низ.
bn: এই ক্ষেত্রে একটি বৈধ স্ট্রিং প্রয়োজন।
ca: Aquest camp requereix una cadena de text vàlida.
cs: Toto pole vyžaduje platný řetězec.
da: Dette felt kræver en gyldig tekststreng.
de: Dieses Feld erfordert eine gültige Zeichenkette.
el: Αυτό το πεδίο απαιτεί μια έγκυρη συμβολοσειρά.
es: Este campo requiere una cadena de texto válida.
et: See väli nõuab kehtivat teksti.
fa: این فیلد نیاز به یک رشته معتبر دارد
fi: Tämä kenttä vaatii kelvollisen merkkijonon
fr: Ce champ nécessite une chaîne de caractères valide.
he: שדה זה דורש מחרוזת תקינה
hi: इस फ़ील्ड में एक मान्य स्ट्रिंग की आवश्यकता है
hr: Ovo polje zahtijeva valjani tekst.
hu: Ehhez a mezőhöz érvényes szöveg szükséges.
id: Bidang ini memerlukan string yang valid.
it: Questo campo richiede una stringa valida.
ja: このフィールドには有効な文字列が必要です
km: វាលនេះត្រូវការអក្សរត្រឹមត្រូវ
ko: 이 필드는 유효한 문자열이 필요합니다
ku: Ev qad pêdivî bi rêzekeke derbasdar e
lo: ຊ່ອງນີ້ຕ້ອງການຂໍ້ຄວາມທີ່ຖືກຕ້ອງ
lv: Šim laukam nepieciešama derīga teksta virkne
mn: Энэ талбарт зөв текст оруулах шаардлагатай
ms: Medan ini memerlukan rentetan yang sah
ne: यो फिल्डमा मान्य स्ट्रिङ आवश्यक छ
nl: Dit veld vereist een geldige tekst
no: Dette feltet krever en gyldig tekststreng
pl: To pole wymaga prawidłowego ciągu znaków
pt: Este campo requer uma string válida
ro: Acest câmp necesită un șir de caractere valid
ru: Это поле требует действительную строку
sk: Toto pole vyžaduje platný reťazec
sl: To polje zahteva veljaven niz
sq: Kjo fushë kërkon një varg të vlefshëm
sv: Detta fält kräver en giltig sträng
sw: Sehemu hii inahitaji maandishi halali
ta: இந்த புலம் சரியான சரத்தை தேவைப்படுகிறது
th: ฟิลด์นี้ต้องการสตริงที่ถูกต้อง
tr: Bu alan geçerli bir metin gerektirir.
uk: Це поле вимагає дійсного текстового рядка
vi: Trường này yêu cầu một chuỗi hợp lệ
zh: 此字段需要有效的字符串
zh_hant: 此欄位需要有效的字串

# lessThanErrorText
source: Value must be less than {max}.
ar: يجب أن تكون القيمة أقل من {max}.
bg: Стойността трябва да бъде по-малка от {max}.
bn: মান অবশ্যই {max} এর চেয়ে ছোট হতে হবে।
ca: El valor ha de ser més petit que {max}.
cs: Hodnota musí být menší než {max}.
da: Værdien skal være mindre end {max}.
de: Der Wert muss kleiner als {max} sein.
el: Η τιμή πρέπει να είναι μικρότερη από {max}.
es: El valor debe ser menor que {max}.
et: Väärtus peab olema väiksem kui {max}.
fa: مقدار باید کمتر از {max} باشد
fi: Arvon täytyy olla pienempi kuin {max}
fr: La valeur doit être inférieure à {max}.
he: הערך חייב להיות קטן מ-{max}
hi: मान {max} से छोटा होना चाहिए
hr: Vrijednost mora biti manja od {max}.
hu: Az értéknek kisebbnek kell lennie mint {max}.
id: Nilai harus kurang dari {max}.
it: Il valore deve essere minore di {max}.
ja: 値は{max}未満である必要があります
km: តម្លៃត្រូវតែតូចជាង {max}
ko: 값은 {max}보다 작아야 합니다
ku: Nirx divê ji {max} kêmtir be
lo: ຄ່າຕ້ອງນ້ອຍກວ່າ {max}
lv: Vērtībai jābūt mazākai par {max}
mn: Утга {max}-аас бага байх ёстой
ms: Nilai mesti kurang daripada {max}
ne: मान {max} भन्दा कम हुनुपर्छ
nl: Waarde moet kleiner zijn dan {max}
no: Verdien må være mindre enn {max}
pl: Wartość musi być mniejsza niż {max}
pt: O valor deve ser menor que {max}
ro: Valoarea trebuie să fie mai mică decât {max}
ru: Значение должно быть меньше {max}
sk: Hodnota musí byť menšia ako {max}
sl: Vrednost mora biti manjša od {max}
sq: Vlera duhet të jetë më e vogël se {max}
sv: Värdet måste vara mindre än {max}
sw: Thamani lazima iwe ndogo kuliko {max}
ta: மதிப்பு {max}ஐ விட குறைவாக இருக்க வேண்டும்
th: ค่าต้องน้อยกว่า {max}
tr: Değer {max} değerinden küçük olmalıdır.
uk: Значення має бути менше ніж {max}
vi: Giá trị phải nhỏ hơn {max}
zh: 数值必须小于{max}
zh_hant: 數值必須小於 {max}

# lessThanOrEqualToErrorText
source: Value must be less than or equal to {max}.
ar: يجب أن تكون القيمة أقل من أو تساوي {max}.
bg: Стойността трябва да бъде по-малка или равна на {max}.
bn: মান অবশ্যই {max} এর চেয়ে ছোট বা সমান হতে হবে।
ca: El valor ha de ser més petit o igual que {max}.
cs: Hodnota musí být menší nebo rovna {max}.
da: Værdien skal være mindre end eller lig med {max}.
de: Der Wert muss kleiner oder gleich {max} sein.
el: Η τιμή πρέπει να είναι μικρότερη ή ίση με {max}.
es: El valor debe ser menor o igual que {max}.
et: Väärtus peab olema väiksem või võrdne kui {max}.
fa: مقدار باید کمتر یا مساوی با {max} باشد
fi: Arvon täytyy olla pienempi tai yhtä suuri kuin {max}
fr: La valeur doit être inférieure ou égale à {max}.
he: הערך חייב להיות קטן או שווה ל-{max}
hi: मान {max} से छोटा या बराबर होना चाहिए
hr: Vrijednost mora biti manja ili jednaka {max}.
hu: Az értéknek kisebbnek vagy egyenlőnek kell lennie mint {max}.
id: Nilai harus kurang dari atau sama dengan {max}.
it: Il valore deve essere minore o uguale a {max}.
ja: 値は{max}以下である必要があります
km: តម្លៃត្រូវតែតូចជាងឬស្មើ {max}
ko: 값은 {max}보다 작거나 같아야 합니다
ku: Nirx divê ji {max} kêmtir an wekhev be
lo: ຄ່າຕ້ອງນ້ອຍກວ່າ ຫຼື ເທົ່າກັບ {max}
lv: Vērtībai jābūt mazākai vai vienādai ar {max}
mn: Утга {max}-тай тэнцүү эсвэл түүнээс бага байх ёстой
ms: Nilai mesti kurang atau sama dengan {max}
ne: मान {max} बराबर वा कम हुनुपर्छ
nl: Waarde moet kleiner dan of gelijk zijn aan {max}
no: Verdien må være mindre enn eller lik {max}
pl: Wartość musi być mniejsza lub równa {max}
pt: O valor deve ser menor ou igual a {max}
ro: Valoarea trebuie să fie mai mică sau egală cu {max}
ru: Значение должно быть меньше или равно {max}
sk: Hodnota musí byť menšia alebo rovná {max}
sl: Vrednost mora biti manjša ali enaka {max}
sq: Vlera duhet të jetë më e vogël ose e barabartë me {max}
sv: Värdet måste vara mindre än eller lika med {max}
sw: Thamani lazima iwe ndogo kuliko au sawa na {max}
ta: மதிப்பு {max}ஐ விட குறைவாக அல்லது சமமாக இருக்க வேண்டும்
th: ค่าต้องน้อยกว่าหรือเท่ากับ {max}
tr: Değer {max} değerinden küçük veya eşit olmalıdır.
uk: Значення має бути менше або дорівнювати {max}
vi: Giá trị phải nhỏ hơn hoặc bằng {max}
zh: 数值必须小于或等于{max}
zh_hant: 數值必須小於或等於 {max}

# orSeparator
source: or
ar: أو
bg: или
bn: বা
ca: o
cs: nebo
da: eller
de: oder
el: ή
es: o
et: või
fa: یا
fi: tai
fr: ou
he: או
hi: या
hr: ili
hu: vagy
id: atau
it: o
ja: または
km: ឬ
ko: 또는
ku: an
lo: ຫຼື
lv: vai
mn: эсвэл
ms: atau
ne: वा
nl: of
no: eller
pl: lub
pt: ou
ro: sau
ru: или
sk: alebo
sl: ali
sq: ose
sv: eller
sw: au
ta: அல்லது
th: หรือ
tr: veya
uk: або
vi: hoặc
zh: 或
zh_hant: 或

# transformAndValidateErrorTextV1
source: Value is not able to be transformed.
ar: لا يمكن تحويل القيمة.
bg: Стойността не може да бъде трансформирана.
bn: মানটি রূপান্তর করা যাবে না।
ca: El valor no es pot transformar.
cs: Hodnotu nelze transformovat.
da: Værdien kan ikke transformeres.
de: Der Wert kann nicht transformiert werden.
el: Η τιμή δεν μπορεί να μετασχηματιστεί.
es: El valor no puede ser transformado.
et: Väärtust ei ole võimalik teisendada.
fa: مقدار قابل تبدیل نیست
fi: Arvoa ei voida muuntaa
fr: La valeur ne peut pas être transformée.
he: לא ניתן להמיר את הערך
hi: मान को परिवर्तित नहीं किया जा सकता
hr: Vrijednost nije moguće transformirati.
hu: Az érték nem alakítható át.
id: Nilai tidak dapat ditransformasikan.
it: Il valore non può essere trasformato.
ja: 値を変換できません
km: តម្លៃមិនអាចបំលែងបានទេ
ko: 값을 변환할 수 없습니다
ku: Nirx nikare were veguhertin
lo: ບໍ່ສາມາດແປງຄ່າໄດ້
lv: Vērtību nav iespējams pārveidot
mn: Утгыг хөрвүүлэх боломжгүй байна
ms: Nilai tidak dapat diubah
ne: मान रूपान्तरण गर्न सकिएन
nl: Waarde kan niet worden getransformeerd
no: Verdien kan ikke transformeres
pl: Wartość nie może zostać przekształcona
pt: O valor não pode ser transformado
ro: Valoarea nu poate fi transformată
ru: Значение не может быть преобразовано
sk: Hodnotu nie je možné transformovať
sl: Vrednosti ni mogoče pretvoriti
sq: Vlera nuk mund të transformohet
sv: Värdet kan inte omvandlas
sw: Thamani haiwezi kubadilishwa
ta: மதிப்பை மாற்ற முடியவில்லை
th: ไม่สามารถแปลงค่าได้
tr: Değer dönüştürülemiyor.
uk: Значення неможливо перетворити
vi: Không thể chuyển đổi giá trị
zh: 无法转换该值
zh_hant: 無法轉換此數值

# transformAndValidateErrorTextV2
source: Value must be a valid {transformedResultTypeDescription}.
ar: يجب أن تكون القيمة {transformedResultTypeDescription} صحيحة.
bg: Стойността трябва да бъде валиден {transformedResultTypeDescription}.
bn: মানটি অবশ্যই একটি বৈধ {transformedResultTypeDescription} হতে হবে।
ca: El valor ha de ser un {transformedResultTypeDescription} vàlid.
cs: Hodnota musí být platný {transformedResultTypeDescription}.
da: Værdien skal være en gyldig {transformedResultTypeDescription}.
de: Der Wert muss ein gültiger {transformedResultTypeDescription} sein.
el: Η τιμή πρέπει να είναι έγκυρη {transformedResultTypeDescription}.
es: El valor debe ser un {transformedResultTypeDescription} válido.
et: Väärtus peab olema kehtiv {transformedResultTypeDescription}.
fa: مقدار باید یک {transformedResultTypeDescription} معتبر باشد
fi: Arvon täytyy olla kelvollinen {transformedResultTypeDescription}
fr: La valeur doit être un(e) {transformedResultTypeDescription} valide.
he: הערך חייב להיות {transformedResultTypeDescription} תקין
hi: मान एक मान्य {transformedResultTypeDescription} होना चाहिए
hr: Vrijednost mora biti valjani {transformedResultTypeDescription}.
hu: Az értéknek érvényes {transformedResultTypeDescription}-nak/-nek kell lennie.
id: Nilai harus berupa {transformedResultTypeDescription} yang valid.
it: Il valore deve essere un {transformedResultTypeDescription} valido.
ja: 値は有効な{transformedResultTypeDescription}である必要があります
km: តម្លៃត្រូវតែជា {transformedResultTypeDescription} ត្រឹមត្រូវ
ko: 값은 유효한 {transformedResultTypeDescription}이어야 합니다
ku: Nirx divê {transformedResultTypeDescription} ya derbasdar be
lo: ຄ່າຕ້ອງເປັນ {transformedResultTypeDescription} ທີ່ຖືກຕ້ອງ
lv: Vērtībai jābūt derīgai {transformedResultTypeDescription}
mn: Утга нь хүчинтэй {transformedResultTypeDescription} байх ёстой
ms: Nilai mesti {transformedResultTypeDescription} yang sah
ne: मान मान्य {transformedResultTypeDescription} हुनुपर्छ
nl: Waarde moet een geldige {transformedResultTypeDescription} zijn
no: Verdien må være en gyldig {transformedResultTypeDescription}
pl: Wartość musi być prawidłowym {transformedResultTypeDescription}
pt: O valor deve ser um {transformedResultTypeDescription} válido
ro: Valoarea trebuie să fie un {transformedResultTypeDescription} valid
ru: Значение должно быть допустимым {transformedResultTypeDescription}
sk: Hodnota musí byť platná {transformedResultTypeDescription}
sl: Vrednost mora biti veljaven {transformedResultTypeDescription}
sq: Vlera duhet të jetë një {transformedResultTypeDescription} i vlefshëm
sv: Värdet måste vara en giltig {transformedResultTypeDescription}
sw: Thamani lazima iwe {transformedResultTypeDescription} halali
ta: மதிப்பு சரியான {transformedResultTypeDescription}ஆக இருக்க வேண்டும்
th: ค่าต้องเป็น {transformedResultTypeDescription} ที่ถูกต้อง
tr: Değer geçerli bir {transformedResultTypeDescription} olmalıdır.
uk: Значення має бути дійсним {transformedResultTypeDescription}
vi: Giá trị phải là một {transformedResultTypeDescription} hợp lệ
zh: 值必须是有效的{transformedResultTypeDescription}
zh_hant: 數值必須是有效的{transformedResultTypeDescription}
