Repository: flutter-form-builder-ecosystem/form_builder_validators
Catalog: lib/l10n/intl_*.arb
Languages: ar, bg, bn, ca, cs, da, de, el, es, et, fa, fi, fr, he, hi, hr, hu, id, it, ja, ka, km, ko, ku, lo, lv, mn, ms, ne, nl, no, pl, pt, ro, ru, sk, sl, sq, sv, sw, ta, th, tr, uk, vi, zh, zh_hant

# zipCodeErrorText
source: Value must be a valid ZIP code.
ar: يجب أن تكون القيمة رمز بريدي صحيح.
bg: Стойността трябва да бъде валиден пощенски код.
bn: মানটি একটি বৈধ জিপ কোড হতে হবে।
ca: El valor ha de ser un codi postal vàlid.
cs: Hodnota musí být platné PSČ.
da: Værdien skal være en gyldig postnummer.
de: Wert muss eine gültige Postleitzahl sein.
el: Η τιμή πρέπει να είναι έγκυρος ταχυδρομικός κωδικός.
es: El valor debe ser un código ZIP válido.
et: Väärtus peab olema kehtiv postiindeks.
fa: مقدار باید یک کد پستی معتبر باشد.
fi: Arvon tulee olla kelvollinen postinumero.
fr: La valeur doit être un code postal valide.
he: הערך חייב להיות מיקוד תקין.
hi: मान को वैध ज़िप कोड होना चाहिए।
hr: Vrijednost mora biti valjan poštanski broj.
hu: Az értéknek érvényes irányítószámnak kell lennie.
id: Nilai harus merupakan kode ZIP yang valid.
it: Il valore deve essere un codice postale valido.
ja: 値は有効な郵便番号である必要があります。
ka: მნიშვნელობა უნდა იყოს მოქმედი საფოსტო ინდექსი.
km: តម្រូវ​ត្រូវ​ជា​លេខ ZIP​ ដូចជា​ស្រេច
ko: 값은 유효한 우편번호여야 합니다.
ku: گۆڕانکاری دەبێت کۆدی ZIP یەکێکی تاقیبت بێت.
lo: ຄ່າຕ້ອງເປັນລະຫັດໄປສະນີທີ່ຖືກຕ້ອງ.
lv: Vērtībai jābūt derīgam pasta indeksam.
mn: Утга нь баталгаажсан ZIP код байх ёстой.
ms: Nilai harus menjadi kod ZIP yang sah.
ne: मान्य ZIP कोड हुनुपर्छ।
nl: Waarde moet een geldige postcode zijn.
no: Verdien må være en gyldig postnummer.
pl: Wartość musi być prawidłowym kodem pocztowym.
pt: O valor deve ser um código postal válido.
ro: Valoarea trebuie să fie un cod ZIP valid.
ru: Значение должно быть допустимым почтовым индексом.
sk: Hodnota musí byť platným PSČ.
sl: Vrednost mora biti veljaven poštni številka.
sq: Vlera duhet të jetë një kod ZIP i vlefshëm.
sv: Värdet måste vara en giltig postnummer.
sw: Deffee waa lambarka Zip ee saxda ah.
ta: மதிப்பு சரியான ஜிப் குறியீடு இருக்க வேண்டும்.
th: ค่าต้องเป็นรหัสไปรษณีย์ที่ถูกต้อง
tr: Değer geçerli bir Posta Kodu olmalıdır.
uk: Значення повинно бути дійсним поштовим індексом.
vi: Giá trị phải là mã ZIP hợp lệ.
zh: 值必须是一个有效的邮政编码。
zh_hant: 值必須是有效的郵政編碼。

# usernameErrorText
source: Value must be a valid username.
ar: يجب أن تكون القيمة اسم مستخدم صالح.
bg: Стойността трябва да бъде валидно потребителско име.
bn: মানটি একটি বৈধ ব্যবহারকারীর নাম হতে হবে।
ca: El valor ha de ser un nom d'usuari vàlid.
cs: Hodnota musí být platným uživatelským jménem.
da: Værdien skal være et gyldigt brugernavn.
de: Der Wert muss ein gültiger Benutzername sein.
el: Η τιμή πρέπει να είναι ένα έγκυρο όνομα χρήστη.
es: El valor debe ser un nombre de usuario válido.
et: Väärtus peab olema kehtiv kasutajanimi.
fa: مقدار باید یک نام کاربری معتبر باشد.
fi: Arvon täytyy olla kelvollinen käyttäjänimi.
fr: La valeur doit être un nom d'utilisateur valide.
he: הערך חייב להיות שם משתמש תקין.
hi: मान्य उपयोगकर्ता नाम होना चाहिए।
hr: Vrijednost mora biti valjano korisničko ime.
hu: Az értéknek érvényes felhasználónévnek kell lennie.
id: Nilai harus berupa nama pengguna yang valid.
it: Il valore deve essere un nome utente valido.
ja: 値は有効なユーザー名でなければなりません。
ka: მნიშვნელობა უნდა იყოს სწორი მომხმარებლის სახელი.
km: តម្លៃត្រូវតែជាឈ្មោះអ្នកប្រើដែលមានសុពលភាព។
ko: 값이 유효한 사용자 이름이어야 합니다.
ku: تێکستی بەکارهێنەر دەبێت ناوێکی دروست بێت.
lo: ຄ່າຕ້ອງເປັນຊື່ຜູ້ໃຊ້ທີ່ຖືກຕ້ອງ.
lv: Vērtībai jābūt derīgam lietotājvārdam.
mn: Утга нь хүчин төгөлдөр хэрэглэгчийн нэр байх ёстой.
ms: Nilai mesti username yang sah.
ne: मान्य प्रयोगकर्ता नाम हुनु पर्छ।
nl: Waarde moet een geldige gebruikersnaam zijn.
no: Verdien må være et gyldig brukernavn.
pl: Wartość musi być prawidłową nazwą użytkownika.
pt: O valor deve ser um nome de usuário válido.
ro: Valoarea trebuie să fie un nume de utilizator valid.
ru: Значение должно быть допустимым именем пользователя.
sk: Hodnota musí byť platné používateľské meno.
sl: Vrednost mora biti veljavno uporabniško ime.
sq: Vlera duhet të jetë një emër përdoruesi i vlefshëm.
sv: Värdet måste vara ett giltigt användarnamn.
sw: Thamani lazima iwe jina la mtumiaji halali.
ta: விலைமை சரியான பயனர் பெயராக இருக்க வேண்டும்.
th: ค่าต้องเป็นชื่อผู้ใช้ที่ถูกต้อง
tr: Değer geçerli bir kullanıcı adı olmalıdır.
uk: Значення має бути дійсним ім'ям користувача.
vi: Giá trị phải là tên người dùng hợp lệ.
zh: 值必须是有效的用户名。
zh_hant: 值必須是有效的用戶名。

# usernameCannotContainNumbersErrorText
source: Username cannot contain numbers.
ar: لا يمكن لاسم المستخدم أن يحتوي على أرقام.
bg: Потребителското име не може да съдържа цифри.
bn: ব্যবহারকারীর নামের মধ্যে সংখ্যা থাকতে পারবে না।
ca: El nom d'usuari no pot contenir números.
cs: Uživatelské jméno nesmí obsahovat čísla.
da: Brugernavn må ikke indeholde tal.
de: Der Benutzername darf keine Zahlen enthalten.
el: Το όνομα χρήστη δεν μπορεί να περιέχει αριθμούς.
es: El nombre de usuario no puede contener números.
et: Kasutajanimi ei tohi sisaldada numbreid.
fa: نام کاربری نمی‌تواند شامل اعداد باشد.
fi: Käyttäjänimi ei saa sisältää numeroita.
fr: Le nom d'utilisateur ne peut pas contenir de chiffres.
he: שם המשתמש לא יכול להכיל מספרים.
hi: उपयोगकर्ता नाम में संख्याएँ नहीं हो सकतीं।
hr: Korisničko ime ne može sadržavati brojeve.
hu: A felhasználónév nem tartalmazhat számokat.
id: Nama pengguna tidak boleh mengandung angka.
it: Il nome utente non può contenere numeri.
ja: ユーザー名に数字を含めることはできません。
ka: მომხმარებლის სახელი არ შეიძლება შეიცავდეს ციფრებს.
km: ឈ្មោះអ្នកប្រើពុំអាចមានតួលេខបានឡើយ។
ko: 사용자 이름에는 숫자가 포함될 수 없습니다.
ku: ناوی بەکارهێنەر نابێت ژمارە پێوی بگرێت.
lo: ຊື່ຜູ້ໃຊ້ບໍ່ສາມາດມີໂຕເລກ.
lv: Lietotājvārdā nevar būt cipari.
mn: Хэрэглэгчийн нэр тоо агуулж болохгүй.
ms: Nama pengguna tidak boleh mengandungi nombor.
ne: प्रयोगकर्ता नाममा संख्या समावेश गर्नु हुँदैन।
nl: Gebruikersnaam mag geen cijfers bevatten.
no: Brukernavn kan ikke inneholde tall.
pl: Nazwa użytkownika nie może zawierać cyfr.
pt: O nome de usuário não pode conter números.
ro: Numele de utilizator nu poate conţine cifre.
ru: Имя пользователя не может содержать цифры.
sk: Používateľské meno nemôže obsahovať čísla.
sl: Uporabniško ime ne sme vsebovati številk.
sq: Emri i përdoruesit nuk mund të përmbajë numra.
sv: Användarnamnet får inte innehålla siffror.
sw: Jina la mtumiaji haliwezi kuwa na nambari.
ta: பயனர் பெயரில் எண்கள் இருக்கக் கூடாது.
th: ชื่อผู้ใช้ต้องไม่มีตัวเลข
tr: Kullanıcı adı sayı içeremez.
uk: Ім'я користувача не може містити цифри.
vi: Tên người dùng không được chứa số.
zh: 用户名不能包含数字。
zh_hant: 用戶名不能包含數字。

# usernameCannotContainUnderscoreErrorText
source: Username cannot contain underscore.
ar: لا يمكن لاسم المستخدم أن يحتوي على شرطة سفلية.
bg: Потребителското име не може да съдържа долна черта.
bn: ব্যবহারকারীর নামের মধ্যে আন্ডারস্কোর থাকতে পারবে না।
ca: El nom d'usuari no pot contenir subratllats.
cs: Uživatelské jméno nesmí obsahovat podtržítko.
da: Brugernavn må ikke indeholde underscore.
de: Der Benutzername darf keinen Unterstrich enthalten.
el: Το όνομα χρήστη δεν μπορεί να περιέχει κάτω παύλα.
es: El nombre de usuario no puede contener guiones bajos.
et: Kasutajanimi ei tohi sisaldada alakriipse.
fa: نام کاربری نمی‌تواند شامل زیر خط باشد.
fi: Käyttäjänimi ei saa sisältää alaviivaa.
fr: Le nom d'utilisateur ne peut pas contenir de tiret bas.
he: שם המשתמש לא יכול להכיל קו תחתון.
hi: उपयोगकर्ता नाम में अंडरस्कोर नहीं हो सकता।
hr: Korisničko ime ne može sadržavati donju crtu.
hu: A felhasználónév nem tartalmazhat aláhúzásokat.
id: Nama pengguna tidak boleh mengandung garis bawah.
it: Il nome utente non può contenere underscore.
ja: ユーザー名にアンダースコアを含めることはできません。
ka: მომხმარებლის სახელი არ შეიძლება შეიცავდეს ქვედახაზებს.
km: ឈ្មោះអ្នកប្រើពុំអាចមានសញ្ញាអ័ក្សស្រៈក្រោមបានឡើយ។
ko: 사용자 이름에는 밑줄이 포함될 수 없습니다.
ku: ناوی بەکارهێنەر نابێت ھەرفەی ژێر نابەڕە بگرێت.
lo: ຊື່ຜູ້ໃຊ້ບໍ່ສາມາດມີຂີດໃຕ້.
lv: Lietotājvārdā nevar būt pasvītrojumi.
mn: Хэрэглэгчийн нэр доогуур зураас агуулж болохгүй.
ms: Nama pengguna tidak boleh mengandungi garis bawah.
ne: प्रयोगकर्ता नाममा अन्डरस्कोर समावेश गर्नु हुँदैन।
nl: Gebruikersnaam mag geen onderstrepingsteken bevatten.
no: Brukernavn kan ikke inneholde understrek.
pl: Nazwa użytkownika nie może zawierać podkreślenia.
pt: O nome de usuário não pode conter sublinhados.
ro: Numele de utilizator nu poate conţine caractere de subliniere.
ru: Имя пользователя не может содержать символ подчеркивания.
sk: Používateľské meno nemôže obsahovať podtržník.
sl: Uporabniško ime ne sme vsebovati podčrtajev.
sq: Emri i përdoruesit nuk mund të përmbajë vijë të poshtme.
sv: Användarnamnet får inte innehålla understreck.
sw: Jina la mtumiaji haliwezi kuwa na alama ya underscore.
ta: பயனர் பெயரில் அடிக்கோடு இருக்கக் கூடாது.
th: ชื่อผู้ใช้ต้องไม่มีขีดเส้นใต้
tr: Kullanıcı adı alt çizgi içeremez.
uk: Ім'я користувача не може містити символ підкреслення.
vi: Tên người dùng không được chứa dấu gạch dưới.
zh: 用户名不能包含下划线。
zh_hant: 用戶名不能包含底線。

# usernameCannotContainSpecialCharErrorText
source: Username cannot contain special characters.
ar: لا يمكن لاسم المستخدم أن يحتوي على أحرف خاصة.
bg: Потребителското име не може да съдържа специални символи.
bn: ব্যবহারকারীর নামের মধ্যে বিশেষ অক্ষর থাকতে পারবে না।
ca: El nom d'usuari no pot contenir caràcters especials.
cs: Uživatelské jméno nesmí obsahovat speciální znaky.
da: Brugernavn må ikke indeholde specialtegn.
de: Der Benutzername darf keine Sonderzeichen enthalten.
el: Το όνομα χρήστη δεν μπορεί να περιέχει ειδικούς χαρακτήρες.
es: El nombre de usuario no puede contener caracteres especiales.
et: Kasutajanimi ei tohi sisaldada erimärke.
fa: نام کاربری نمی‌تواند شامل کاراکترهای خاص باشد.
fi: Käyttäjänimi ei saa sisältää erikoismerkkejä.
fr: Le nom d'utilisateur ne peut pas contenir de caractères spéciaux.
he: שם המשתמש לא יכול להכיל תווים מיוחדים.
hi: उपयोगकर्ता नाम में विशेष वर्ण नहीं हो सकते।
hr: Korisničko ime ne može sadržavati posebne znakove.
hu: A felhasználónév nem tartalmazhat speciális karaktereket.
id: Nama pengguna tidak boleh mengandung karakter khusus.
it: Il nome utente non può contenere caratteri speciali.
ja: ユーザー名に特殊文字を含めることはできません。
ka: მომხმარებლის სახელი არ შეიძლება შეიცავდეს სპეციალურ სიმბოლოებს.
km: ឈ្មោះអ្នកប្រើពុំអាចមានតួអក្សរពិសេសបានឡើយ។
ko: 사용자 이름에는 특수 문자가 포함될 수 없습니다.
ku: ناوی بەکارهێنەر نابێت پیت و نووسە تایبەتی بگرێت.
lo: ຊື່ຜູ້ໃຊ້ບໍ່ສາມາດມີອັກສອນພິເສດ.
lv: Lietotājvārdā nevar būt speciālas rakstzīmes.
mn: Хэрэглэгчийн нэр тусгай тэмдэгт агуулж болохгүй.
ms: Nama pengguna tidak boleh mengandungi aksara khas.
ne: प्रयोगकर्ता नाममा विशेष वर्णहरू समावेश गर्नु हुँदैन।
nl: Gebruikersnaam mag geen speciale tekens bevatten.
no: Brukernavn kan ikke inneholde spesialtegn.
pl: Nazwa użytkownika nie może zawierać znaków specjalnych.
pt: O nome de usuário não pode conter caracteres especiais.
ro: Numele de utilizator nu poate conţine caractere speciale.
ru: Имя пользователя не может содержать специальные символы.
sk: Používateľské meno nemôže obsahovať špeciálne znaky.
sl: Uporabniško ime ne sme vsebovati posebnih znakov.
sq: Emri i përdoruesit nuk mund të përmbajë karaktere speciale.
sv: Användarnamnet får inte innehålla specialtecken.
sw: Jina la mtumiaji haliwezi kuwa na herufi maalum.
ta: பயனர் பெயரில் சிறப்பு எழுத்துக்கள் இருக்கக் கூடாது.
th: ชื่อผู้ใช้ต้องไม่มีอักขระพิเศษ
tr: Kullanıcı adı özel karakter içeremez.
uk: Ім'я користувача не може містити спеціальні символи.
vi: Tên người dùng không được chứa ký tự đặc biệt.
zh: 用户名不能包含特殊字符。
zh_hant: 用戶名不能包含特殊字符。

# usernameCannotContainSpacesErrorText
source: Username cannot contain spaces.
ar: لا يمكن لاسم المستخدم أن يحتوي على مسافات.
bg: Потребителското име не може да съдържа интервали.
bn: ব্যবহারকারীর নামের মধ্যে স্পেস থাকতে পারবে না।
ca: El nom d'usuari no pot contenir espais.
cs: Uživatelské jméno nesmí obsahovat mezery.
da: Brugernavn må ikke indeholde mellemrum.
de: Der Benutzername darf keine Leerzeichen enthalten.
el: Το όνομα χρήστη δεν μπορεί να περιέχει κενά.
es: El nombre de usuario no puede contener espacios.
et: Kasutajanimi ei tohi sisaldada tühikuid.
fa: نام کاربری نمی‌تواند شامل فاصله باشد.
fi: Käyttäjänimi ei saa sisältää välilyöntejä.
fr: Le nom d'utilisateur ne peut pas contenir d'espaces.
he: שם המשתמש לא יכול להכיל רווחים.
hi: उपयोगकर्ता नाम में रिक्त स्थान नहीं हो सकते।
hr: Korisničko ime ne može sadržavati razmake.
hu: A felhasználónév nem tartalmazhat szóközöket.
id: Nama pengguna tidak boleh mengandung spasi.
it: Il nome utente non può contenere spazi.
ja: ユーザー名にスペースを含めることはできません。
ka: მომხმარებლის სახელი არ შეიძლება შეიცავდეს სივრცეებს.
km: ឈ្មោះអ្នកប្រើពុំអាចមានចន្លោះបានឡើយ។
ko: 사용자 이름에는 공백이 포함될 수 없습니다.
ku: ناوی بەکارهێنەر نابێت بەش ب بەش بێت.
lo: ຊື່ຜູ້ໃຊ້ບໍ່ສາມາດມີຊ່ອງຫວ່າງ.
lv: Lietotājvārdā nevar būt atstarpes.
mn: Хэрэглэгчийн нэр хоосон зай агуулж болохгүй.
ms: Nama pengguna tidak boleh mengandungi ruang.
ne: प्रयोगकर्ता नाममा खाली ठाउँहरू समावेश गर्नु हुँदैन।
nl: Gebruikersnaam mag geen spaties bevatten.
no: Brukernavn kan ikke inneholde mellomrom.
pl: Nazwa użytkownika nie może zawierać spacji.
pt: O nome de usuário não pode conter espaços.
ro: Numele de utilizator nu poate conţine spaţii.
ru: Имя пользователя не может содержать пробелы.
sk: Používateľské meno nemôže obsahovať medzery.
sl: Uporabniško ime ne sme vsebovati presledkov.
sq: Emri i përdoruesit nuk mund të përmbajë hapësira.
sv: Användarnamnet får inte innehålla mellanslag.
sw: Jina la mtumiaji haliwezi kuwa na nafasi.
ta: பயனர் பெயரில் இடைவெளிகள் இருக்கக் கூடாது.
th: ชื่อผู้ใช้ต้องไม่มีช่องว่าง
tr: Kullanıcı adı boşluk içeremez.
uk: Ім'я користувача не може містити пробіли.
vi: Tên người dùng không được chứa khoảng trắng.
zh: 用户名不能包含空格。
zh_hant: 用戶名不能包含空格。

# usernameCannotContainDotsErrorText
source: Username cannot contain dots.
ar: لا يمكن لاسم المستخدم أن يحتوي على نقاط.
bg: Потребителското име не може да съдържа точки.
bn: ব্যবহারকারীর নামের মধ্যে বিন্দু থাকতে পারবে না।
ca: El nom d'usuari no pot contenir punts.
cs: Uživatelské jméno nesmí obsahovat tečky.
da: Brugernavn må ikke indeholde prikker.
de: Der Benutzername darf keine Punkte enthalten.
el: Το όνομα χρήστη δεν μπορεί να περιέχει τελείες.
es: El nombre de usuario no puede contener puntos.
et: Kasutajanimi ei tohi sisaldada punkte.
fa: نام کاربری نمی‌تواند شامل نقطه باشد.
fi: Käyttäjänimi ei saa sisältää pisteitä.
fr: Le nom d'utilisateur ne peut pas contenir de points.
he: שם המשתמש לא יכול להכיל נקודות.
hi: उपयोगकर्ता नाम में बिंदु नहीं हो सकते।
hr: Korisničko ime ne može sadržavati točke.
hu: A felhasználónév nem tartalmazhat pontokat.
id: Nama pengguna tidak boleh mengandung titik.
it: Il nome utente non può contenere punti.
ja: ユーザー名にドットを含めることはできません。
ka: მომხმარებლის სახელი არ შეიძლება შეიცავდეს წერტილებს.
km: ឈ្មោះអ្នកប្រើពុំអាចមានចំណុចបានឡើយ។
ko: 사용자 이름에는 점이 포함될 수 없습니다.
ku: ناوی بەکارهێنەر نابێت نوکتەکان ب گرێت.
lo: ຊື່ຜູ້ໃຊ້ບໍ່ສາມາດມີຈຸດ.
lv: Lietotājvārdā nevar būt punkti.
mn: Хэрэглэгчийн нэр цэг агуулж болохгүй.
ms: Nama pengguna tidak boleh mengandungi titik.
ne: प्रयोगकर्ता नाममा डटहरू समावेश गर्नु हुँदैन।
nl: Gebruikersnaam mag geen punten bevatten.
no: Brukernavn kan ikke inneholde prikker.
pl: Nazwa użytkownika nie może zawierać kropek.
pt: O nome de usuário não pode conter pontos.
ro: Numele de utilizator nu poate conţine puncte.
ru: Имя пользователя не может содержать точки.
sk: Používateľské meno nemôže obsahovať bodky.
sl: Uporabniško ime ne sme vsebovati pik.
sq: Emri i përdoruesit nuk mund të përmbajë pika.
sv: Användarnamnet får inte innehålla punkter.
sw: Jina la mtumiaji haliwezi kuwa na nukta.
ta: பயனர் பெயரில் புள்ளிகள் இருக்கக் கூடாது.
th: ชื่อผู้ใช้ต้องไม่มีจุด
tr: Kullanıcı adı nokta içeremez.
uk: Ім'я користувача не може містити крапки.
vi: Tên người dùng không được chứa dấu chấm.
zh: 用户名不能包含点。
zh_hant: 用戶名不能包含點。

# usernameCannotContainDashesErrorText
source: Username cannot contain dashes.
ar: لا يمكن لاسم المستخدم أن يحتوي على شرطات.
bg: Потребителското име не може да съдържа тирета.
bn: ব্যবহারকারীর নামের মধ্যে ড্যাশ থাকতে পারবে না।
ca: El nom d'usuari no pot contenir guions.
cs: Uživatelské jméno nesmí obsahovat pomlčky.
da: Brugernavn må ikke indeholde bindestreger.
de: Der Benutzername darf keine Bindestriche enthalten.
el: Το όνομα χρήστη δεν μπορεί να περιέχει παύλες.
es: El nombre de usuario no puede contener guiones.
et: Kasutajanimi ei tohi sisaldada kriipse.
fa: نام کاربری نمی‌تواند شامل خط پیوند باشد.
fi: Käyttäjänimi ei saa sisältää viivoja.
fr: Le nom d'utilisateur ne peut pas contenir de tirets.
he: שם המשתמש לא יכול להכיל מקפים.
hi: उपयोगकर्ता नाम में डैश नहीं हो सकते।
hr: Korisničko ime ne može sadržavati crtice.
hu: A felhasználónév nem tartalmazhat kötőjeleket.
id: Nama pengguna tidak boleh mengandung tanda hubung.
it: Il nome utente non può contenere trattini.
ja: ユーザー名にダッシュを含めることはできません。
ka: მომხმარებლის სახელი არ შეიძლება შეიცავდეს დეფისებს.
km: ឈ្មោះអ្នកប្រើពុំអាចមានសញ្ញានិកបានឡើយ។
ko: 사용자 이름에는 대시가 포함될 수 없습니다.
ku: ناوی بەکارهێنەر نابێت تیرە خال ب گرێت.
lo: ຊື່ຜູ້ໃຊ້ບໍ່ສາມາດມີຂີດ.
lv: Lietotājvārdā nevar būt domuzīmes.
mn: Хэрэглэгчийн нэр зураас агуулж болохгүй.
ms: Nama pengguna tidak boleh mengandungi sengkang.
ne: प्रयोगकर्ता नाममा ड्यासहरू समावेश गर्नु हुँदैन।
nl: Gebruikersnaam mag geen streepjes bevatten.
no: Brukernavn kan ikke inneholde bindestreker.
pl: Nazwa użytkownika nie może zawierać myślników.
pt: O nome de usuário não pode conter traços.
ro: Numele de utilizator nu poate conţine cratime.
ru: Имя пользователя не может содержать дефисы.
sk: Používateľské meno nemôže obsahovať pomlčky.
sl: Uporabniško ime ne sme vsebovati vezajev.
sq: Emri i përdoruesit nuk mund të përmbajë vija.
sv: Användarnamnet får inte innehålla bindestreck.
sw: Jina la mtumiaji haliwezi kuwa na mistari ya usawa.
ta: பயனர் பெயரில் கோடுகள் இருக்கக் கூடாது.
th: ชื่อผู้ใช้ต้องไม่มีขีดกลาง
tr: Kullanıcı adı tire içeremez.
uk: Ім'я користувача не може містити дефіси.
vi: Tên người dùng không được chứa dấu gạch ngang.
zh: 用户名不能包含破折号。
zh_hant: 用戶名不能包含破折號。

# invalidMimeTypeErrorText
source: Invalid mime type.
ar: نوع الميم غير صالح
bg: Невалиден MIME тип.
bn: অবৈধ মাইম টাইপ।
ca: Tipus MIME no vàlid.
cs: Neplatný typ MIME.
da: Ugyldig MIME-type.
de: Ungültiger MIME-Typ.
el: Μη έγκυρος τύπος MIME.
es: Tipo MIME inválido.
et: Vigane MIME tüüp.
fa: نوع MIME نامعتبر است.
fi: Virheellinen MIME-tyyppi.
fr: Type MIME invalide.
he: סוג MIME לא חוקי.
hi: अमान्य MIME प्रकार।
hr: Nevažeći MIME tip.
hu: Érvénytelen MIME-típus.
id: Tipe mime tidak valid.
it: Tipo mime non valido.
ja: 無効な MIME タイプです。
ka: არასწორი MIME-ტიპი.
km: ប្រភេទ MIME មិនត្រឹមត្រូវ។
ko: 잘못된 MIME 유형입니다.
ku: Mînka têkeve nîne.
lo: ປະເພດໄຟລທີ່ບໍ່ຖືກຕ້ອງ.
lv: Nederīgs MIME tips.
mn: Буруу mime төрөл.
ms: Jenis MIME tidak sah.
ne: अवैध माइम प्रकार।
nl: Ongeldig MIME-type.
no: Ugyldig mime-type.
pl: Nieprawidłowy typ MIME.
pt: Tipo MIME inválido.
ro: Tip mime invalid.
ru: Неверный MIME-тип.
sk: Neplatný typ MIME.
sl: Neveljavna vrsta MIME.
sq: Lloji mime i pavlefshëm.
sv: Ogiltig MIME-typ.
sw: Aina batili ya mime.
ta: செல்லுபடியாகாத மைம் வகை.
th: ประเภท mime ไม่ถูกต้อง
tr: Geçersiz mime türü.
uk: Недійсний MIME тип.
vi: Loại mime không hợp lệ.
zh: 无效的 MIME 类型。
zh_hant: 無效的 MIME 類型。

# timezoneErrorText
source: Value must be a valid timezone.
ar: يجب أن تكون القيمة منطقة زمنية صالحة.
bg: Стойността трябва да бъде валидна часова зона.
bn: মানটি একটি বৈধ সময় অঞ্চল হতে হবে।
ca: El valor ha de ser una zona horària vàlida.
cs: Hodnota musí být platné časové pásmo.
da: Værdien skal være en gyldig tidszone.
de: Der Wert muss eine gültige Zeitzone sein.
el: Η τιμή πρέπει να είναι μια έγκυρη ζώνη ώρας.
es: El valor debe ser una zona horaria válida.
et: Väärtus peab olema kehtiv ajavöönd.
fa: مقدار باید یک منطقه زمانی معتبر باشد.
fi: Arvon on oltava kelvollinen aikavyöhyke.
fr: La valeur doit être un fuseau horaire valide.
he: הערך חייב להיות אזור זמן חוקי.
hi: मान मान्य समय क्षेत्र होना चाहिए।
hr: Vrijednost mora biti važeća vremenska zona.
hu: Az értéknek egy érvényes időzónának kell lennie.
id: Nilai harus berupa zona waktu yang valid.
it: Il valore deve essere un fuso orario valido.
ja: 値は有効なタイムゾーンでなければなりません。
ka: მნიშვნელობა უნდა იყოს სწორი დროის სარტყელი.
km: តម្លៃត្រូវតែជាតំបន់ពេលវេលាដែលត្រឹមត្រូវ។
ko: 값은 유효한 시간대이어야 합니다.
ku: Nirxî divê yekem saet derbasdar be.
lo: ຄ່າຕ້ອງເປັນເວລາເມືອງທີ່ຖືກຕ້ອງ.
lv: Vērtībai jābūt derīgai laika joslai.
mn: Утга нь хүчин төгөлдөр цагийн бүс байх ёстой.
ms: Nilai mesti zon waktu yang sah.
ne: मान मान्य समयक्षेत्र हुनुपर्छ।
nl: Waarde moet een geldige tijdzone zijn.
no: Verdien må være en gyldig tidssone.
pl: Wartość musi być prawidłową strefą czasową.
pt: O valor deve ser um fuso horário válido.
ro: Valoarea trebuie să fie un fus orar valid.
ru: Значение должно быть действительным часовым поясом.
sk: Hodnota musí byť platné časové pásmo.
sl: Vrednost mora biti veljaven časovni pas.
sq: Vlera duhet të jetë një zonë kohore e vlefshme.
sv: Värdet måste vara en giltig tidszon.
sw: Thamani lazima iwe sauti halali ya muda.
ta: மதிப்பு ஒரு செல்லுபடியான நேரம் மண்டலம் ஆக வேண்டும்.
th: ค่าต้องเป็นเขตเวลาที่ถูกต้อง
tr: Değer geçerli bir saat dilimi olmalıdır.
uk: Значення повинно бути дійсним часовим поясом.
vi: Giá trị phải là một múi giờ hợp lệ.
zh: 值必须是有效的时区。
zh_hant: 值必須是一個有效的時區。

# cityErrorText
source: Value must be a valid city name.
ar: يجب أن تكون القيمة اسم مدينة صالح.
bg: Стойността трябва да бъде валидно име на град.
bn: মানটি একটি বৈধ শহরের নাম হতে হবে।
ca: El valor ha de ser un nom de ciutat vàlid.
cs: Hodnota musí být platný název města.
da: Værdien skal være et gyldigt bynavn.
de: Der Wert muss ein gültiger Stadtname sein.
el: Η τιμή πρέπει να είναι ένα έγκυρο όνομα πόλης.
es: El valor debe ser un nombre de ciudad válido.
et: Väärtus peab olema kehtiv linna nimi.
fa: مقدار باید یک نام شهر معتبر باشد.
fi: Arvon on oltava kelvollinen kaupungin nimi.
fr: La valeur doit être un nom de ville valide.
he: הערך חייב להיות שם עיר חוקי.
hi: मान मान्य शहर का नाम होना चाहिए।
hr: Vrijednost mora biti važeći naziv grada.
hu: Az értéknek egy érvényes városnévnek kell lennie.
id: Nilai harus berupa nama kota yang valid.
it: Il valore deve essere un nome di città valido.
ja: 値は有効な市の名前でなければなりません。
ka: მნიშვნელობა უნდა იყოს ქალაქის სწორი სახელი.
km: តម្លៃត្រូវតែជាឈ្មោះទីក្រុងដែលត្រឹមត្រូវ。
ko: 값은 유효한 도시 이름이어야 합니다.
ku: Nirxî divê yekem navê bajarê derbasdar be.
lo: ຄ່າຕ້ອງເປັນຊື່ເມືອງທີ່ຖືກຕ້ອງ.
lv: Vērtībai jābūt derīgam pilsētas nosaukumam.
mn: Утга нь хүчин төгөлдөр хотын нэр байх ёстой.
ms: Nilai mesti nama bandar yang sah.
ne: मान मान्य शहरको नाम हुनुपर्छ।
nl: Waarde moet een geldige plaatsnaam zijn.
no: Verdien må være et gyldig bynavn.
pl: Wartość musi być prawidłową nazwą miasta.
pt: O valor deve ser um nome de cidade válido.
ro: Valoarea trebuie să fie un nume de oraș valid.
ru: Значение должно быть действительным названием города.
sk: Hodnota musí byť platný názov mesta.
sl: Vrednost mora biti veljavno ime mesta.
sq: Vlera duhet të jetë një emër qyteti i vlefshëm.
sv: Värdet måste vara ett giltigt stadsnamn.
sw: Thamani lazima iwe jina halali la jiji.
ta: மதிப்பு ஒரு செல்லுபடியான நகரத்தின் பெயராக இருக்க வேண்டும்.
th: ค่าต้องเป็นชื่อเมืองที่ถูกต้อง
tr: Değer geçerli bir şehir adı olmalıdır.
uk: Значення повинно бути дійсним назвою міста.
vi: Giá trị phải là tên thành phố hợp lệ.
zh: 值必须是有效的城市名称。
zh_hant: 值必須是一個有效的城市名稱。
