Repository: flutter-form-builder-ecosystem/form_builder_validators
Catalog: lib/l10n/intl_*.arb
Languages: ar, bg, bn, ca, cs, da, de, el, es, et, fa, fi, fr, he, hi, hr, hu, id, it, ja, ka, km, ko, ku, lo, lv, mn, ms, ne, nl, no, pl, pt, ro, ru, sk, sl, sq, sv, sw, ta, th, tr, uk, vi, zh, zh_hant

# countryErrorText
source: Value must be a valid country.
ar: يجب أن تكون القيمة بلد صالح.
bg: Стойността трябва да бъде валидна държава.
bn: মানটি একটি বৈধ দেশের হতে হবে।
ca: El valor ha de ser un país vàlid.
cs: Hodnota musí být platná země.
da: Værdien skal være et gyldigt land.
de: Der Wert muss ein gültiges Land sein.
el: Η τιμή πρέπει να είναι μια έγκυρη χώρα.
es: El valor debe ser un país válido.
et: Väärtus peab olema kehtiv riik.
fa: مقدار باید یک کشور معتبر باشد.
fi: Arvon on oltava kelvollinen maa.
fr: La valeur doit être un pays valide.
he: הערך חייב להיות מדינה חוקית.
hi: मान मान्य देश होना चाहिए।
hr: Vrijednost mora biti važeća država.
hu: Az értéknek egy érvényes országnevet kell lennie.
id: Nilai harus berupa negara yang valid.
it: Il valore deve essere un paese valido.
ja: 値は有効な国でなければなりません。
ka: მნიშვნელობა უნდა იყოს ქვეყნის სწორი სახელი.
km: តម្លៃត្រូវតែជាប្រទេសដែលត្រឹមត្រូវ។
ko: 값은 유효한 국가이어야 합니다.
ku: Nirxî divê yekem navê welatê derbasdar be.
lo: ຄ່າຕ້ອງເປັນຊື່ປະເທດທີ່ຖືກຕ້ອງ.
lv: Vērtībai jābūt derīgai valstij.
mn: Утга нь хүчин төгөлдөр улс байх ёстой.
ms: Nilai mesti negara yang sah.
ne: मान मान्य देश हुनुपर्छ।
nl: Waarde moet een geldig land zijn.
no: Verdien må være et gyldig land.
pl: Wartość musi być prawidłowym krajem.
pt: O valor deve ser um país válido.
ro: Valoarea trebuie să fie o țară validă.
ru: Значение должно быть действительным названием страны.
sk: Hodnota musí byť platná krajina.
sl: Vrednost mora biti veljavna država.
sq: Vlera duhet të jetë një shtet i vlefshëm.
sv: Värdet måste vara ett giltigt land.
sw: Thamani lazima iwe nchi halali.
ta: மதிப்பு ஒரு செல்லுபடியான நாட்டாக இருக்க வேண்டும்.
th: ค่าต้องเป็นประเทศที่ถูกต้อง
tr: Değer geçerli bir ülke olmalıdır.
uk: Значення повинно бути дійсною країною.
vi: Giá trị phải là quốc gia hợp lệ.
zh: 值必须是有效的国家。
zh_hant: 值必須是一個有效的國家。

# stateErrorText
source: Value must be a valid state.
ar: يجب أن تكون القيمة ولاية صالحة.
bg: Стойността трябва да бъде валиден щат.
bn: মানটি একটি বৈধ রাজ্যের হতে হবে।
ca: El valor ha de ser un estat vàlid.
cs: Hodnota musí být platný název státu.
da: Værdien skal være en gyldig stat.
de: Der Wert muss ein gültiger Bundesstaat sein.
el: Η τιμή πρέπει να είναι μια έγκυρη πολιτεία.
es: El valor debe ser un estado válido.
et: Väärtus peab olema kehtiv osariik.
fa: مقدار باید یک ایالت معتبر باشد.
fi: Arvon on oltava kelvollinen osavaltio.
fr: La valeur doit être un état valide.
he: הערך חייב להיות מדינה חוקית.
hi: मान मान्य राज्य होना चाहिए।
hr: Vrijednost mora biti važeća država.
hu: Az értéknek egy érvényes államnak kell lennie.
id: Nilai harus berupa provinsi yang valid.
it: Il valore deve essere uno stato valido.
ja: 値は有効な州でなければなりません。
ka: მნიშვნელობა უნდა იყოს მოქმედი შტატის სახელი.
km: តម្លៃត្រូវតែជារាជធានីដែលត្រឹមត្រូវ។
ko: 값은 유효한 주이어야 합니다.
ku: Nirxî divê yekem navê dewleta herêmê derbasdar be.
lo: ຄ່າຕ້ອງເປັນຊື່ລັດທີ່ຖືກຕ້ອງ.
lv: Vērtībai jābūt derīgam štata vai reģiona nosaukumam.
mn: Утга нь хүчин төгөлдөр муж байх ёстой.
ms: Nilai mesti negeri yang sah.
ne: मान मान्य राज्य हुनुपर्छ।
nl: Waarde moet een geldige staat zijn.
no: Verdien må være en gyldig delstat.
pl: Wartość musi być prawidłowym stanem.
pt: O valor deve ser um estado válido.
ro: Valoarea trebuie să fie un stat valid.
ru: Значение должно быть действительным названием штата.
sk: Hodnota musí byť platný názov štátu.
sl: Vrednost mora biti veljavna zvezna država.
sq: Vlera duhet të jetë një shtet i vlefshëm.
sv: Värdet måste vara en giltig stat.
sw: Thamani lazima iwe jimbo halali.
ta: மதிப்பு ஒரு செல்லுபடியான மாநிலமாக இருக்க வேண்டும்.
th: ค่าต้องเป็นรัฐที่ถูกต้อง
tr: Değer geçerli bir eyalet olmalıdır.
uk: Значення повинно бути дійсним штатом.
vi: Giá trị phải là bang hợp lệ.
zh: 值必须是有效的州。
zh_hant: 值必須是一個有效的州/省。

# streetErrorText
source: Value must be a valid street name.
ar: يجب أن تكون القيمة اسم شارع صالح.
bg: Стойността трябва да бъде валидно име на улица.
bn: মানটি একটি বৈধ রাস্তার নাম হতে হবে।
ca: El valor ha de ser un nom de carrer vàlid.
cs: Hodnota musí být platný název ulice.
da: Værdien skal være et gyldigt gadenavn.
de: Der Wert muss ein gültiger Straßenname sein.
el: Η τιμή πρέπει να είναι ένα έγκυρο όνομα οδού.
es: El valor debe ser un nombre de calle válido.
et: Väärtus peab olema kehtiv tänava nimi.
fa: مقدار باید یک نام خیابان معتبر باشد.
fi: Arvon on oltava kelvollinen kadunnimi.
fr: La valeur doit être un nom de rue valide.
he: הערך חייב להיות שם רחוב חוקי.
hi: मान मान्य सड़क का नाम होना चाहिए।
hr: Vrijednost mora biti važeći naziv ulice.
hu: Az értéknek egy érvényes utcanévnek kell lennie.
id: Nilai harus berupa nama jalan yang valid.
it: Il valore deve essere un nome di via valido.
ja: 値は有効な通り名でなければなりません。
ka: მნიშვნელობა უნდა იყოს სწორი ქუჩის სახელი.
km: តម្លៃត្រូវតែជាឈ្មោះផ្លូវដែលត្រឹមត្រូវ។
ko: 값은 유효한 거리 이름이어야 합니다.
ku: Nirxî divê yekem navê kolanê derbasdar be.
lo: ຄ່າຕ້ອງເປັນຊື່ຖນົນທີ່ຖືກຕ້ອງ.
lv: Vērtībai jābūt derīgam ielas nosaukumam.
mn: Утга нь хүчин төгөлдөр гудамжны нэр байх ёстой.
ms: Nilai mesti nama jalan yang sah.
ne: मान मान्य सडकको नाम हुनुपर्छ।
nl: Waarde moet een geldige straatnaam zijn.
no: Verdien må være et gyldig gatenavn.
pl: Wartość musi być prawidłową nazwą ulicy.
pt: O valor deve ser um nome de rua válido.
ro: Valoarea trebuie să fie un nume de stradă valid.
ru: Значение должно быть действительным названием улицы.
sk: Hodnota musí byť platný názov ulice.
sl: Vrednost mora biti veljavno ime ulice.
sq: Vlera duhet të jetë një emër rrugë e vlefshme.
sv: Värdet måste vara ett giltigt gatunamn.
sw: Thamani lazima iwe jina halali la barabara.
ta: மதிப்பு ஒரு செல்லுபடியான தெருப்பெயராக இருக்க வேண்டும்.
th: ค่าต้องเป็นชื่อถนนที่ถูกต้อง
tr: Değer geçerli bir sokak adı olmalıdır.
uk: Значення повинно бути дійсною назвою вулиці.
vi: Giá trị phải là tên đường hợp lệ.
zh: 值必须是有效的街道名称。
zh_hant: 值必須是一個有效的街道名稱。

# firstNameErrorText
source: Value must be a valid first name.
ar: يجب أن تكون القيمة اسمًا أول صالحًا.
bg: Стойността трябва да бъде валидно собствено име.
bn: মানটি একটি বৈধ প্রথম নাম হতে হবে।
ca: El valor ha de ser un nom de pila vàlid.
cs: Hodnota musí být platné jméno.
da: Værdien skal være et gyldigt fornavn.
de: Der Wert muss ein gültiger Vorname sein.
el: Η τιμή πρέπει να είναι ένα έγκυρο όνομα.
es: El valor debe ser un nombre válido.
et: Väärtus peab olema kehtiv eesnimi.
fa: مقدار باید یک نام معتبر باشد.
fi: Arvon on oltava kelvollinen etunimi.
fr: La valeur doit être un prénom valide.
he: הערך חייב להיות שם פרטי חוקי.
hi: मान मान्य प्रथम नाम होना चाहिए।
hr: Vrijednost mora biti važeće ime.
hu: Az értéknek egy érvényes keresztnévnek kell lennie.
id: Nilai harus berupa nama depan yang valid.
it: Il valore deve essere un nome valido.
ja: 値は有効な名でなければなりません。
ka: მნიშვნელობა უნდა იყოს სწორი სახელი.
km: តម្លៃត្រូវតែជាឈ្មោះដំបូងដែលត្រឹមត្រូវ។
ko: 값은 유효한 이름이어야 합니다.
ku: Nirxî divê yekem navê pêşî derbasdar be.
lo: ຄ່າຕ້ອງເປັນຊື່ຫຼັກທີ່ຖືກຕ້ອງ.
lv: Vērtībai jābūt derīgam vārdam.
mn: Утга нь хүчин төгөлдөр анхны нэр байх ёстой.
ms: Nilai mesti nama pertama yang sah.
ne: मान मान्य पहिलो नाम हुनुपर्छ।
nl: Waarde moet een geldige voornaam zijn.
no: Verdien må være et gyldig fornavn.
pl: Wartość musi być prawidłowym imieniem.
pt: O valor deve ser um primeiro nome válido.
ro: Valoarea trebuie să fie un prenume valid.
ru: Значение должно быть действительным именем.
sk: Hodnota musí byť platné krstné meno.
sl: Vrednost mora biti veljavno ime.
sq: Vlera duhet të jetë një emër i parë i vlefshëm.
sv: Värdet måste vara ett giltigt förnamn.
sw: Thamani lazima iwe jina halali la kwanza.
ta: மதிப்பு ஒரு செல்லுபடியான முதல் பெயராக இருக்க வேண்டும்.
th: ค่าต้องเป็นชื่อจริงที่ถูกต้อง
tr: Değer geçerli bir ad olmalıdır.
uk: Значення повинно бути дійсним ім'ям.
vi: Giá trị phải là tên hợp lệ.
zh: 值必须是有效的名字。
zh_hant: 值必須是一個有效的名字。

# lastNameErrorText
source: Value must be a valid last name.
ar: يجب أن تكون القيمة اسم عائلة صالحًا.
bg: Стойността трябва да бъде валидно фамилно име.
bn: মানটি একটি বৈধ শেষ নাম হতে হবে।
ca: El valor ha de ser un cognom vàlid.
cs: Hodnota musí být platné příjmení.
da: Værdien skal være et gyldigt efternavn.
de: Der Wert muss ein gültiger Nachname sein.
el: Η τιμή πρέπει να είναι ένα έγκυρο επώνυμο.
es: El valor debe ser un apellido válido.
et: Väärtus peab olema kehtiv perekonnanimi.
fa: مقدار باید یک نام خانوادگی معتبر باشد.
fi: Arvon on oltava kelvollinen sukunimi.
fr: La valeur doit être un nom de famille valide.
he: הערך חייב להיות שם משפחה חוקי.
hi: मान मान्य उपनाम होना चाहिए।
hr: Vrijednost mora biti važeće prezime.
hu: Az értéknek egy érvényes vezetéknévnek kell lennie.
id: Nilai harus berupa nama belakang yang valid.
it: Il valore deve essere un cognome valido.
ja: 値は有効な姓でなければなりません。
ka: მნიშვნელობა უნდა იყოს სწორი გვარი.
km: តម្លៃត្រូវតែជាគោត្តនាមដែលត្រឹមត្រូវ។
ko: 값은 유효한 성이어야 합니다.
ku: Nirxî divê yekem navê paşîn derbasdar be.
lo: ຄ່າຕ້ອງເປັນນາມສະກຸນທີ່ຖືກຕ້ອງ.
lv: Vērtībai jābūt derīgam uzvārdam.
mn: Утга нь хүчин төгөлдөр овог байх ёстой.
ms: Nilai mesti nama keluarga yang sah.
ne: मान मान्य थर हुनुपर्छ।
nl: Waarde moet een geldige achternaam zijn.
no: Verdien må være et gyldig etternavn.
pl: Wartość musi być prawidłowym nazwiskiem.
pt: O valor deve ser um sobrenome válido.
ro: Valoarea trebuie să fie un nume de familie valid.
ru: Значение должно быть действительной фамилией.
sk: Hodnota musí byť platné priezvisko.
sl: Vrednost mora biti veljaven priimek.
sq: Vlera duhet të jetë një mbiemër i vlefshëm.
sv: Värdet måste vara ett giltigt efternamn.
sw: Thamani lazima iwe jina halali la mwisho.
ta: மதிப்பு ஒரு செல்லுபடியான இறுதி பெயராக இருக்க வேண்டும்.
th: ค่าต้องเป็นนามสกุลที่ถูกต้อง
tr: Değer geçerli bir soyadı olmalıdır.
uk: Значення повинно бути дійсним прізвищем.
vi: Giá trị phải là họ hợp lệ.
zh: 值必须是有效的姓氏。
zh_hant: 值必須是一個有效的姓氏。

# passportNumberErrorText
source: Value must be a valid passport number.
ar: يجب أن تكون القيمة رقم جواز سفر صالح.
bg: Стойността трябва да бъде валиден номер на паспорт.
bn: মানটি একটি বৈধ পাসপোর্ট নম্বর হতে হবে।
ca: El valor ha de ser un número de passaport vàlid.
cs: Hodnota musí být platné číslo pasu.
da: Værdien skal være et gyldigt pasnummer.
de: Der Wert muss eine gültige Passnummer sein.
el: Η τιμή πρέπει να είναι ένας έγκυρος αριθμός διαβατηρίου.
es: El valor debe ser un número de pasaporte válido.
et: Väärtus peab olema kehtiv passinumber.
fa: مقدار باید یک شماره پاسپورت معتبر باشد.
fi: Arvon on oltava kelvollinen passinumero.
fr: La valeur doit être un numéro de passeport valide.
he: הערך חייב להיות מספר דרכון חוקי.
hi: मान मान्य पासपोर्ट नंबर होना चाहिए।
hr: Vrijednost mora biti važeći broj putovnice.
hu: Az értéknek egy érvényes útlevélszámnak kell lennie.
id: Nilai harus berupa nomor paspor yang valid.
it: Il valore deve essere un numero di passaporto valido.
ja: 値は有効なパスポート番号でなければなりません。
ka: მნიშვნელობა უნდა იყოს მოქმედი პასპორტის ნომერი.
km: តម្លៃត្រូវតែជាលេខលិខិតឆ្លងដែនដែលត្រឹមត្រូវ។
ko: 값은 유효한 여권 번호이어야 합니다.
ku: Nirxî divê yekem hejmarê pasportê derbasdar be.
lo: ຄ່າຕ້ອງເປັນໝາຍເລກພາສະປອດທີ່ຖືກຕ້ອງ.
lv: Vērtībai jābūt derīgam pases numuram.
mn: Утга нь хүчин төгөлдөр паспортын дугаар байх ёстой.
ms: Nilai mesti nombor pasport yang sah.
ne: मान मान्य पासपोर्ट नम्बर हुनुपर्छ।
nl: Waarde moet een geldig paspoortnummer zijn.
no: Verdien må være et gyldig passnummer.
pl: Wartość musi być prawidłowym numerem paszportu.
pt: O valor deve ser um número de passaporte válido.
ro: Valoarea trebuie să fie un număr de pașaport valid.
ru: Значение должно быть действительным номером паспорта.
sk: Hodnota musí byť platné číslo pasu.
sl: Vrednost mora biti veljavna številka potnega lista.
sq: Vlera duhet të jetë një numër pasaporte i vlefshëm.
sv: Värdet måste vara ett giltigt passnummer.
sw: Thamani lazima iwe nambari halali ya pasi.
ta: மதிப்பு ஒரு செல்லுபடியான பாஸ்போர்ட் எணாக இருக்க வேண்டும்.
th: ค่าต้องเป็นหมายเลขหนังสือเดินทางที่ถูกต้อง
tr: Değer geçerli bir pasaport numarası olmalıdır.
uk: Значення повинно бути дійсним номером паспорта.
vi: Giá trị phải là số hộ chiếu hợp lệ.
zh: 值必须是有效的护照号码。
zh_hant: 值必須是一個有效的護照號碼。

# primeNumberErrorText
source: Value must be a prime number.
ar: يجب أن تكون القيمة عدد أولي.
bg: Стойността трябва да бъде просто число.
bn: মানটি একটি মৌলিক সংখ্যা হতে হবে।
ca: El valor ha de ser un nombre primer.
cs: Hodnota musí být prvočíslo.
da: Værdien skal være et primtal.
de: Der Wert muss eine Primzahl sein.
el: Η τιμή πρέπει να είναι ένας πρώτος αριθμός.
es: El valor debe ser un número primo.
et: Väärtus peab olema algarv.
fa: مقدار باید یک عدد اول باشد.
fi: Arvon on oltava alkuluku.
fr: La valeur doit être un nombre premier.
he: הערך חייב להיות מספר ראשוני.
hi: मान एक अभाज्य संख्या होनी चाहिए।
hr: Vrijednost mora biti prost broj.
hu: Az értéknek egy prímszámnak kell lennie.
id: Nilai harus berupa bilangan prima.
it: Il valore deve essere un numero primo.
ja: 値は素数でなければなりません。
ka: მნიშვნელობა უნდა იყოს მარტივი რიცხვი.
km: តម្លៃត្រូវតែជាលេខសឺរលេខ។
ko: 값은 소수이어야 합니다.
ku: Nirxî divê yekem hejmarê binpê derbasdar be.
lo: ຍໍ້ຄ່າຕ້ອງເປັນໝາຍເລກທີ່ຖືກຕ້ອງ.
lv: Vērtībai jābūt pirmskaitlim.
mn: Утга нь анхны тоо байх ёстой.
ms: Nilai mesti nombor perdana.
ne: मान अभाज्य संख्या हुनुपर्छ।
nl: Waarde moet een priemgetal zijn.
no: Verdien må være et primtall.
pl: Wartość musi być liczbą pierwszą.
pt: O valor deve ser um número primo.
ro: Valoarea trebuie să fie un număr prim.
ru: Значение должно быть простым числом.
sk: Hodnota musí byť prvočíslo.
sl: Vrednost mora biti praštevilo.
sq: Vlera duhet të jetë një numër kryesor i vlefshëm.
sv: Värdet måste vara ett primtal.
sw: Thamani lazima iwe nambari tambuzi.
ta: மதிப்பு ஒரு பகോ எணாக இருக்க வேண்டும்.
th: ค่าต้องเป็นเลขเฉพาะที่ถูกต้อง
tr: Değer bir asal sayı olmalıdır.
uk: Значення повинно бути простим числом.
vi: Giá trị phải là số nguyên tố.
zh: 值必须是质数。
zh_hant: 值必須是一個質數。

# dunsErrorText
source: Value must be a valid DUNS number.
ar: يجب أن تكون القيمة رقم DUNS صالح.
bg: Стойността трябва да бъде валиден DUNS номер.
bn: মানটি একটি বৈধ DUNS নম্বর হতে হবে।
ca: El valor ha de ser un número DUNS vàlid.
cs: Hodnota musí být platné číslo DUNS.
da: Værdien skal være et gyldigt DUNS-nummer.
de: Der Wert muss eine gültige DUNS-Nummer sein.
el: Η τιμή πρέπει να είναι ένας έγκυρος αριθμός DUNS.
es: El valor debe ser un número DUNS válido.
et: Väärtus peab olema kehtiv DUNS number.
fa: مقدار باید یک شماره DUNS معتبر باشد.
fi: Arvon on oltava kelvollinen DUNS-numero.
fr: La valeur doit être un numéro DUNS valide.
he: הערך חייב להיות מספר DUNS חוקי.
hi: मान मान्य DUNS नंबर होना चाहिए।
hr: Vrijednost mora biti važeći DUNS broj.
hu: Az értéknek egy érvényes DUNS számnak kell lennie.
id: Nilai harus berupa nomor DUNS yang valid.
it: Il valore deve essere un numero DUNS valido.
ja: 値は有効なDUNS番号でなければなりません。
ka: მნიშვნელობა უნდა იყოს სწორი DUNS ნომერი.
km: តម្លៃត្រូវតែជាលេខ DUNS ដែលត្រឹមត្រូវ។
ko: 값은 유효한 DUNS 번호이어야 합니다.
ku: Nirxî divê yekem hejmarê DUNS derbasdar be.
lo: ຄ່າຕ້ອງເປັນໝາຍເລກ DUNS ທີ່ຖືກຕ້ອງ.
lv: Vērtībai jābūt derīgam DUNS numuram.
mn: Утга нь хүчин төгөлдөр DUNS дугаар байх ёстой.
ms: Nilai mesti nombor DUNS yang sah.
ne: मान मान्य DUNS नम्बर हुनुपर्छ।
nl: Waarde moet een geldig DUNS-nummer zijn.
no: Verdien må være et gyldig DUNS-nummer.
pl: Wartość musi być prawidłowym numerem DUNS.
pt: O valor deve ser um número DUNS válido.
ro: Valoarea trebuie să fie un număr DUNS valid.
ru: Значение должно быть действительным номером DUNS.
sk: Hodnota musí byť platné číslo DUNS.
sl: Vrednost mora biti veljavna DUNS številka.
sq: Vlera duhet të jetë një numër DUNS i vlefshëm.
sv: Värdet måste vara ett giltigt DUNS-nummer.
sw: Thamani lazima iwe nambari halali ya DUNS.
ta: மதிப்பு ஒரு செல்லுபடியான DUNS எணாக இருக்க வேண்டும்.
th: ค่าต้องเป็นเลข DUNS ที่ถูกต้อง
tr: Değer geçerli bir DUNS numarası olmalıdır.
uk: Значення повинно бути дійсним номером DUNS.
vi: Giá trị phải là số DUNS hợp lệ.
zh: 值必须是有效的DUNS编号。
zh_hant: 值必須是一個有效的DUNS號碼。

# licensePlateErrorText
source: Value must be a valid license plate.
ar: يجب أن تكون القيمة لوحة ترخيص صالحة.
bg: Стойността трябва да бъде валиден регистрационен номер.
bn: মানটি একটি বৈধ লাইসেন্স প্লেট হতে হবে।
ca: El valor ha de ser una matrícula vàlida.
cs: Hodnota musí být platná poznávací značka.
da: Værdien skal være en gyldig nummerplade.
de: Der Wert muss ein gültiges Nummernschild sein.
el: Η τιμή πρέπει να είναι μια έγκυρη πινακίδα κυκλοφορίας.
es: El valor debe ser una placa de matrícula válida.
et: Väärtus peab olema kehtiv numbrimärk.
fa: مقدار باید یک شماره پلاک معتبر باشد.
fi: Arvon on oltava kelvollinen rekisterinumero.
fr: La valeur doit être une plaque d'immatriculation valide.
he: הערך חייב להיות מספר רכב חוקי.
hi: मान मान्य लाइसेंस प्लेट होना चाहिए।
hr: Vrijednost mora biti važeća registarska oznaka.
hu: Az értéknek egy érvényes rendszámnak kell lennie.
id: Nilai harus berupa pelat nomor yang valid.
it: Il valore deve essere una targa valida.
ja: 値は有効なナンバープレートでなければなりません。
ka: მნიშვნელობა უნდა იყოს მოქმედი სანომრე ნიშნის ნომერი.
km: តម្លៃត្រូវតែជាបណ្ណកាតសម្លេង។
ko: 값은 유효한 번호판이어야 합니다.
ku: Nirxî divê yekem pelka prezantiyê ya derbasdar be.
lo: ຄ່າຕ້ອງເປັນໝາຍເລກປ້າຍທີ່ຖືກຕ້ອງ.
lv: Vērtībai jābūt derīgai numurzīmei.
mn: Утга нь хүчин төгөлдөр тээврийн хэрэгслийн дугаар байх ёстой.
ms: Nilai mesti nombor plat lesen yang sah.
ne: मान मान्य नम्बर प्लेट हुनुपर्छ।
nl: Waarde moet een geldige kentekenplaat zijn.
no: Verdien må være et gyldig registreringsnummer.
pl: Wartość musi być prawidłowym numerem tablicy rejestracyjnej.
pt: O valor deve ser uma placa de licença válida.
ro: Valoarea trebuie să fie un număr de înmatriculare valid.
ru: Значение должно быть действительным номером номерного знака.
sk: Hodnota musí byť platné číslo evidenčnej značky vozidla.
sl: Vrednost mora biti veljavna registrska tablica.
sq: Vlera duhet të jetë një targë makine e vlefshme.
sv: Värdet måste vara en giltig registreringsskylt.
sw: Thamani lazima iwe nambari sahihi ya leseni.
ta: மதிப்பு ஒரு செல்லுபடியான பதிவு தகடு (license plate) எணாக இருக்க வேண்டும்.
th: ค่าต้องเป็นเลขทะเบียนรถที่ถูกต้อง
tr: Değer geçerli bir plaka olmalıdır.
uk: Значення повинно бути дійсним номерним знаком автомобіля.
vi: Giá trị phải là biển số xe hợp lệ.
zh: 值必须是有效的车牌号。
zh_hant: 值必須是一個有效的車牌號碼。

# vinErrorText
source: Value must be a valid VIN.
ar: يجب أن تكون القيمة رقم VIN صالح.
bg: Стойността трябва да бъде валиден VIN.
bn: মানটি একটি বৈধ VIN হতে হবে।
ca: El valor ha de ser un VIN vàlid.
cs: Hodnota musí být platný VIN.
da: Værdien skal være en gyldig VIN.
de: Der Wert muss eine gültige Fahrzeug-Identifizierungsnummer (VIN) sein.
el: Η τιμή πρέπει να είναι ένας έγκυρος αριθμός VIN.
es: El valor debe ser un VIN válido.
et: Väärtus peab olema kehtiv VIN.
fa: مقدار باید یک شماره VIN معتبر باشد.
fi: Arvon on oltava kelvollinen VIN.
fr: La valeur doit être un numéro VIN valide.
he: הערך חייב להיות מספר VIN חוקי.
hi: मान मान्य VIN होना चाहिए।
hr: Vrijednost mora biti važeći VIN.
hu: Az értéknek egy érvényes járműazonosító számnak kell lennie.
id: Nilai harus berupa VIN yang valid.
it: Il valore deve essere un VIN valido.
ja: 値は有効なVINでなければなりません。
ka: მნიშვნელობა უნდა იყოს მოქმედი VIN.
km: តម្លៃត្រូវតែជាលេខ VIN ដែលត្រឹមត្រូវ។
ko: 값은 유효한 VIN이어야 합니다.
ku: Nirxî divê yekem hejmarê VIN derbasdar be.
lo: ຄ່າຕ້ອງເປັນ VIN ທີ່ຖືກຕ້ອງ.
lv: Vērtībai jābūt derīgam VIN.
mn: Утга нь хүчин төгөлдөр VIN байх ёстой.
ms: Nilai mesti nombor VIN yang sah.
ne: मान मान्य VIN हुनुपर्छ।
nl: Waarde moet een geldig VIN zijn.
no: Verdien må være et gyldig VIN.
pl: Wartość musi być prawidłowym numerem VIN.
pt: O valor deve ser um VIN válido.
ro: Valoarea trebuie să fie un VIN valid.
ru: Значение должно быть действительным VIN.
sk: Hodnota musí byť platné číslo VIN.
sl: Vrednost mora biti veljavna identifikacijska številka vozila (VIN).
sq: Vlera duhet të jetë një VIN i vlefshëm.
sv: Värdet måste vara ett giltigt VIN.
sw: Thamani lazima iwe VIN halali.
ta: மதிப்பு ஒரு செல்லுபடியான வாகன அடையாள எணாக (VIN) இருக்க வேண்டும்.
th: ค่าต้องเป็นหมายเลข VIN ที่ถูกต้อง
tr: Değer geçerli bir VIN numarası olmalıdır.
uk: Значення повинно бути дійсним VIN.
vi: Giá trị phải là số VIN hợp lệ.
zh: 值必须是有效的车辆识别码（VIN）。
zh_hant: 值必須是一個有效的車輛識別號。

# languageCodeErrorText
source: Value must be a valid language code.
ar: يجب أن تكون القيمة رمز لغة صالح.
bg: Стойността трябва да бъде валиден езиков код.
bn: মানটি একটি বৈধ ভাষা কোড হতে হবে।
ca: El valor ha de ser un codi de llengua vàlid.
cs: Hodnota musí být platný kód jazyka.
da: Værdien skal være en gyldig sprogkode.
de: Der Wert muss ein gültiger Sprachcode sein.
el: Η τιμή πρέπει να είναι ένας έγκυρος κωδικός γλώσσας.
es: El valor debe ser un código de idioma válido.
et: Väärtus peab olema kehtiv keelekood.
fa: مقدار باید یک کد زبان معتبر باشد.
fi: Arvon on oltava kelvollinen kielikoodi.
fr: La valeur doit être un code de langue valide.
he: הערך חייב להיות קוד שפה חוקי.
hi: मान मान्य भाषा कोड होना चाहिए।
hr: Vrijednost mora biti važeći jezični kod.
hu: Az értéknek egy érvényes nyelvkódnak kell lennie.
id: Nilai harus berupa kode bahasa yang valid.
it: Il valore deve essere un codice lingua valido.
ja: 値は有効な言語コードでなければなりません。
ka: მნიშვნელობა უნდა იყოს ვალიდური ენის კოდი.
km: តម្លៃត្រូវតែជាកូដភាសាដែលត្រឹមត្រូវ។
ko: 값은 유효한 언어 코드이어야 합니다.
ku: Nirxî divê yekem kodê zimanê derbasdar be.
lo: ຄ່າຕ້ອງເປັນໄລຄໂລດພາສາທີ່ຖືກຕ້ອງ.
lv: Vērtībai jābūt derīgam valodas kodam.
mn: Утга нь хүчин төгөлдөр хэлний код байх ёстой.
ms: Nilai mesti kod bahasa yang sah.
ne: मान मान्य भाषाको कोड हुनुपर्छ।
nl: Waarde moet een geldige taalcode zijn.
no: Verdien må være en gyldig språkkode.
pl: Wartość musi być prawidłowym kodem języka.
pt: O valor deve ser um código de idioma válido.
ro: Valoarea trebuie să fie un cod de limbă valid.
ru: Значение должно быть действительным кодом языка.
sk: Hodnota musí byť platný kód jazyka.
sl: Vrednost mora biti veljavna koda jezika.
sq: Vlera duhet të jetë një kod gjuhe i vlefshëm.
sv: Värdet måste vara en giltig språkkod.
sw: Thamani lazima iwe msimbo halali wa lugha.
ta: மதிப்பு ஒரு செல்லுபடியான மொழி குறியீடாக இருக்க வேண்டும்.
th: ค่าต้องเป็นรหัสภาษาที่ถูกต้อง
tr: Değer geçerli bir dil kodu olmalıdır.
uk: Значення повинно бути дійсним кодом мови.
vi: Giá trị phải là mã ngôn ngữ hợp lệ.
zh: 值必须是有效的语言代码。
zh_hant: 值必須是一個有效的語言代碼。
