Repository: flutter-form-builder-ecosystem/form_builder_validators
Catalog: lib/l10n/intl_*.arb
Languages: ar, bg, bn, ca, cs, da, de, el, es, et, fa, fi, fr, he, hi, hr, hu, id, it, ja, ka, km, ko, ku, lo, lv, mn, ms, ne, nl, no, pl, pt, ro, ru, sk, sl, sq, sv, sw, ta, th, tr, uk, vi, zh, zh_hant

# urlErrorText
source: This field requires a valid URL address.
ar: هذا الحقل يتطلب عنوان URL صالح.
bg: Това поле изисква валиден URL адрес.
bn: একটি বৈধ ওয়েব এড্রেস প্রয়োজন।
ca: Aquest camp requereix una adreça URL vàlida.
cs: Pole vyžaduje platnou adresu URL.
da: Skal være en gyldig URL adresse.
de: Für dieses Feld ist eine gültige URL-Adresse erforderlich.
el: Η τιμή πρέπει να είναι έγκυρη διεύθυνση URL.
es: Este campo requiere una dirección URL válida.
et: Sellele väljale tuleb sisestada korrektne URL.
fa: این ورودی به آدرس اینترنتی معتبر نیاز دارد.
fi: Vaaditaan oikean muotoinen URL-osoite.
fr: Ce champ nécessite une adresse URL valide.
he: שדה זה דורש כתובת URL תקינה.
hi: इस फ़ील्ड में एक मान्य URL पता की आवश्यकता है।
hr: Unesite validnu URL adresu.
hu: A megadott érték nem egy érvényes URL cím.
id: URL tidak valid.
it: Questo campo richiede una URL valida.
ja: 有効なURLを入力してください。
ka: ველი უნდა იყოს URL მისამართი.
km: ទិន្នន័យនេះត្រូវតែជា URL address តែប៉ុណ្ណោះ។
ko: URL 형식이 올바르지 않습니다.
ku: ئەم خانە پێویستە ناونیشانی URL-ێکی دروست هەبێت.
lo: ຄ່າໃນຟອມນີ້ຕ້ອງຢູ່ໃນຮູບແບບຂອງ URL.
lv: Šis lauks prasa derīgu URL adresi.
mn: URL хаяг алдаатай байна.
ms: Ruangan ini memerlukan alamat URL yang sah.
ne: यो फिल्डलाई मान्य URL ठेगाना चाहिन्छ।
nl: Een geldige URL is vereist.
no: Må være en gyldig URL-adresse.
pl: To pole wymaga prawidłowego adresu URL.
pt: Este campo requer um endereço de URL válido.
ro: Acest câmp necesită o adresă URL validă.
ru: Поле должно быть URL адресом.
sk: Toto pole vyžaduje platnú URL adresu.
sl: Vnesite veljaven URL naslov.
sq: Kjo fushë kërkon një adresë URL të vlefshme.
sv: Detta fält kräver en giltig URL-adress.
sw: Sehemu hii inahitaji anwani sahihi ya tovuti.
ta: இந்த உள்ளீட்டுக்கு சரியான URL முகவரி தேவை.
th: ข้อมูลนี้ต้องเป็น URL address เท่านั้น
tr: Bu alan geçerli bir URL adresi gerektirir.
uk: Поле має бути URL адресою.
vi: Nhập đúng địa chỉ URL.
zh: 该字段必须是有效的 URL 地址。
zh_hant: 此欄位需要有效的 URL 地址。

# phoneErrorText
source: This field requires a valid phone number.
ar: هذا الحقل يتطلب رقم هاتف صالح.
bg: Това поле изисква валиден телефонен номер.
bn: একটি বৈধ ফোন নম্বর প্রয়োজন।
ca: Aquest camp requereix un número de telèfon vàlid.
cs: Pole vyžaduje platné telefonní číslo.
da: Dette felt kræver et gyldigt telefonnummer.
de: Dieses Feld erfordert eine gültige Telefonnummer.
el: Η τιμή πρέπει να είναι έγκυρος αριθμός τηλεφώνου.
es: Este campo requiere un número de teléfono válido.
et: Sellele väljale tuleb sisestada korrektne telefoninumber.
fa: این ورودی به شماره تلفن معتبر نیاز دارد.
fi: Vaaditaan oikean muotoinen puhelinnumero.
fr: Ce champ nécessite un numéro de téléphone valide.
he: שדה זה דורש מספר טלפון תקין.
hi: इस फ़ील्ड में एक मान्य फ़ोन नंबर की आवश्यकता है।
hr: Unesite validan telefonski broj.
hu: A megadott érték nem egy érvényes telefonszám.
id: Nomor telepon tidak valid.
it: Questo campo richiede un numero di telefono valido.
ja: 有効な電話番号を入力してください。
ka: ველი უნდა იყოს ტელეფონის ნომერი.
km: ទិន្នន័យនេះត្រូវតែជាលេខទូរស័ព្ទតែប៉ុណ្ណោះ។
ko: 유효한 전화번호를 입력해 주세요.
ku: ئەم خانە پێویستە ژمارەی تەلەفۆنی دروست هەبێت.
lo: ຄ່າໃນຟອມນີ້ຕ້ອງຢູ່ໃນຮູບແບບເລກໂທລະສັບ.
lv: Šis lauks prasa derīgu tālruņa numuru.
mn: Утасны дугаар алдаатай байна.
ms: Ruangan ini memerlukan nombor telefon yang sah.
ne: यो क्षेत्रलाई मान्य फोन नम्बर चाहिन्छ।
nl: Een geldig telefoonnummer is vereist.
no: Dette feltet krever et gyldig telefonnummer.
pl: To pole wymaga prawidłowego numeru telefonu.
pt: Este campo requer um número de telefone válido.
ro: Acest câmp necesită un număr de telefon valid.
ru: Поле должно быть номером телефона.
sk: Toto pole vyžaduje platné telefónne číslo.
sl: Vnesite veljavno telefonsko številko.
sq: Kjo fushë kërkon një numër telefoni të vlefshëm.
sv: Detta fält kräver ett giltigt telefonnummer.
sw: Sehemu hii inahitaji nambari halali ya simu.
ta: இந்த உள்ளீட்டுக்கு சரியான தொலைபேசி எண் தேவை.
th: ข้อมูลนี้ต้องเป็นเบอร์โทรศัพท์ที่ถูกต้อง
tr: Bu alan geçerli bir telefon numarası gerektirir.
uk: Поле має бути дійсним номером телефону.
vi: Yêu cầu nhập số điện thoại hợp lệ.
zh: 该字段必须是有效的电话号码。
zh_hant: 此欄位需要有效的電話號碼。

# creditCardExpirationDateErrorText
source: This field requires a valid expiration date.
ar: هذا الحقل يتطلب تاريخ انتهاء صالح للبطاقة الائتمانية.
bg: Това поле изисква валидна дата на изтичане на кредитната карта.
bn: একটি বৈধ ক্রেডিট কার্ডের মেয়াদ শেষের তারিখ প্রয়োজন।
ca: Aquest camp requereix una data de caducitat de la targeta de crèdit vàlida.
cs: Pole vyžaduje platné datum vypršení platnosti kreditní karty.
da: Dette felt kræver en gyldig udløbsdato for kreditkortet.
de: Dieses Feld erfordert ein gültiges Ablaufdatum der Kreditkarte.
el: Η τιμή πρέπει να είναι έγκυρη ημερομηνία λήξης της πιστωτικής κάρτας.
es: Este campo requiere una fecha de vencimiento válida para la tarjeta de crédito.
et: Sellele väljale tuleb sisestada krediitkaardi kehtivusaeg.
fa: این ورودی به تاریخ انقضای معتبر کارت اعتباری نیاز دارد.
fi: Vaaditaan voimassa oleva luottokortin voimassaoloaika.
fr: Ce champ nécessite une date d'expiration valide pour la carte de crédit.
he: שדה זה דורש תאריך תפוגה תקין לכרטיס האשראי.
hi: इस फ़ील्ड में एक मान्य समाप्ति तिथि की आवश्यकता है।
hr: Unesite validan datum isteka kreditne kartice.
hu: Ez a mező érvényes bankkártya lejárati dátumot igényel.
id: Tanggal kedaluwarsa kartu kredit tidak valid.
it: Questo campo richiede una data di scadenza della carta di credito valida.
ja: 有効なクレジットカードの有効期限を入力してください。
ka: ველი უნდა იყოს საკრედიტო ბარათის ვადის გასვლის მოქმედი თარიღი.
km: ទិន្នន័យនេះត្រូវតែជាកាលបរិច្ឆេទផុតកំណត់នៃកាតឥណទានដែលមានសុពលភាព។
ko: 유효한 신용카드 만료일을 입력해 주세요.
ku: ئەم خانە پێویستە بەرواری بەسەرچوونێکی دروست هەبێت.
lo: ຄ່າໃນຟອມນີ້ຕ້ອງຢູ່ໃນຮູບແບບຂອງວັນໝົດອາຍຸບັດເຄຣດິດ.
lv: Šis lauks prasa derīgu derīguma termiņu.
mn: Кредит картын хүчинтэй хугацааг оруулна уу.
ms: Ruangan ini memerlukan tarikh luput kad kredit yang sah.
ne: यो क्षेत्रलाई मान्य क्रेडिट कार्ड समाप्ति मिति चाहिन्छ।
nl: Een geldige vervaldatum van de creditcard is vereist.
no: Dette feltet krever en gyldig utløpsdato for kredittkortet.
pl: To pole wymaga prawidłowej daty ważności karty kredytowej.
pt: Este campo requer uma data de validade do cartão de crédito válida.
ro: Acest câmp necesită o dată de expirare a cardului de credit validă.
ru: Поле должно быть действительной датой истечения срока действия кредитной карты.
sk: Toto pole vyžaduje platný dátum exspirácie kreditnej karty.
sl: Vnesite veljaven datum poteka kreditne kartice.
sq: Kjo fushë kërkon një datë skadence të vlefshme për kartën e kreditit.
sv: Detta fält kräver ett giltigt utgångsdatum för kreditkortet.
sw: Sehemu hii inahitaji tarehe halali ya kumalizika kwa kadi ya mkopo.
ta: இந்த உள்ளீட்டுக்கு சரியான கிரெடிட் கார்டு காலாவதி தேதியை தேவை.
th: ข้อมูลนี้ต้องเป็นวันหมดอายุของบัตรเครดิตที่ถูกต้อง
tr: Bu alan geçerli bir kredi kartı son kullanma tarihi gerektirir.
uk: Поле має бути дійсною датою закінчення терміну дії кредитної картки.
vi: Yêu cầu nhập đúng ngày hết hạn của thẻ tín dụng.
zh: 该字段必须是有效的信用卡到期日期。
zh_hant: 此欄位需要有效的信用卡到期日期。

# creditCardExpiredErrorText
source: This credit card has expired.
ar: البطاقة الائتمانية منتهية الصلاحية.
bg: Кредитната карта е с изтекъл срок.
bn: ক্রেডিট কার্ডের মেয়াদ শেষ হয়ে গেছে।
ca: La targeta de crèdit ha caducat.
cs: Platnost kreditní karty vypršela.
da: Kreditkortet er udløbet.
de: Die Kreditkarte ist abgelaufen.
el: Η πιστωτική κάρτα έχει λήξει.
es: La tarjeta de crédito ha expirado.
et: Krediitkaardi kehtivusaeg on möödas.
fa: کارت اعتباری منقضی شده است.
fi: Luottokortti on vanhentunut.
fr: La carte de crédit a expiré.
he: כרטיס האשראי פג תוקף.
hi: यह क्रेडिट कार्ड समाप्त हो गया है।
hr: Kreditna kartica je istekla.
hu: A bankkártya lejárt.
id: Kartu kredit telah kedaluwarsa.
it: La carta di credito è scaduta.
ja: クレジットカードの有効期限が切れています。
ka: საკრედიტო ბარათს ვადა გაუვიდა.
km: ប័ណ្ណ​ឥណទាន​នេះ​បាន​ផុត​កំណត់។
ko: 신용카드의 유효기간이 만료되었습니다.
ku: ئەم کارتی کرێدیتە بەسەرچووە.
lo: ບັດເຄຣດິດໝົດອາຍຸແລ້ວ.
lv: Šīs kredītkartes derīguma termiņš ir beidzies.
mn: Кредит картын хүчинтэй хугацаа дууссан байна.
ms: Kad kredit telah tamat tempoh.
ne: क्रेडिट कार्डको म्याद सकिएको छ।
nl: De creditcard is verlopen.
no: Kredittkortet er utløpt.
pl: Karta kredytowa straciła ważność.
pt: O cartão de crédito está expirado.
ro: Cardul de credit a expirat.
ru: Срок действия кредитной карты истек.
sk: Platnosť kreditnej karty vypršala.
sl: Kreditna kartica je potekla.
sq: Karta e kreditit ka skaduar.
sv: Kreditkortet har gått ut.
sw: Kadi ya mkopo imeisha muda wake.
ta: கிரெடிட் கார்டு காலாவதி செய்யப்பட்டுள்ளது.
th: บัตรเครดิตนี้หมดอายุแล้ว
tr: Kredi kartının son kullanma tarihi geçmiş.
uk: Термін дії кредитної картки закінчився.
vi: Thẻ tín dụng đã hết hạn.
zh: 信用卡已过期。
zh_hant: 信用卡已過期。

# creditCardCVCErrorText
source: This field requires a valid CVC code.
ar: هذا الحقل يتطلب رمز CVC صالح للبطاقة الائتمانية.
bg: Това поле изисква валиден CVC код на кредитната карта.
bn: একটি বৈধ ক্রেডিট কার্ড CVC কোড প্রয়োজন।
ca: Aquest camp requereix un codi CVC vàlid de la targeta de crèdit.
cs: Pole vyžaduje platný CVC kód kreditní karty.
da: Dette felt kræver en gyldig CVC-kode for kreditkortet.
de: Dieses Feld erfordert einen gültigen CVC-Code der Kreditkarte.
el: Η τιμή πρέπει να είναι έγκυρος κωδικός CVC της πιστωτικής κάρτας.
es: Este campo requiere un código CVC válido para la tarjeta de crédito.
et: Sellele väljale tuleb sisestada korrektne krediitkaardi CVC kood.
fa: این ورودی به کد CVC معتبر کارت اعتباری نیاز دارد.
fi: Vaaditaan oikean muotoinen luottokortin CVC-koodi.
fr: Ce champ nécessite un code CVC valide pour la carte de crédit.
he: שדה זה דורש קוד CVC תקין לכרטיס האשראי.
hi: इस फ़ील्ड में एक मान्य सीवीसी कोड की आवश्यकता है।
hr: Unesite validan CVC kod kreditne kartice.
hu: Ez a mező érvényes bankkártya CVC kódot igényel.
id: Kode CVC kartu kredit tidak valid.
it: Questo campo richiede un codice CVC della carta di credito valido.
ja: 有効なクレジットカードのCVCコードを入力してください。
ka: ველი უნდა იყოს მოქმედი საკრედიტო ბარათის CVC კოდი.
km: ទិន្នន័យនេះត្រូវតែជាលេខកូដ CVC កាតឥណទានដែលមានសុពលភាព។
ko: 유효한 신용카드 CVC 코드를 입력해 주세요.
ku: ئەم خانە پێویستە کۆدی CVC-ێکی دروست هەبێت.
lo: ຄ່າໃນຟອມນີ້ຕ້ອງແມ່ນ CVC ທີ່ຖືກຕ້ອງ.
lv: Šis lauks prasa derīgu CVC kodu.
mn: Кредит картын CVC код алдаатай байна.
ms: Ruangan ini memerlukan kod CVC kad kredit yang sah.
ne: यो क्षेत्रलाई मान्य क्रेडिट कार्ड CVC कोड चाहिन्छ।
nl: Een geldige CVC-code van de creditcard is vereist.
no: Dette feltet krever en gyldig CVC-kode for kredittkortet.
pl: To pole wymaga prawidłowego kodu CVC karty kredytowej.
pt: Este campo requer um código CVC do cartão de crédito válido.
ro: Acest câmp necesită un cod CVC valid al cardului de credit.
ru: Поле должно быть действительным CVC кодом кредитной карты.
sk: Toto pole vyžaduje platný CVC kód kreditnej karty.
sl: Vnesite veljavno CVC kodo kreditne kartice.
sq: Kjo fushë kërkon një kod CVC të vlefshëm për kartën e kreditit.
sv: Detta fält kräver en giltig CVC-kod för kreditkortet.
sw: Sehemu hii inahitaji msimbo halali wa CVC wa kadi ya mkopo.
ta: இந்த உள்ளீட்டுக்கு சரியான கிரெடிட் கார்டு CVC குறியீடு தேவை.
th: ข้อมูลนี้ต้องเป็นรหัส CVC ของบัตรเครดิตที่ถูกต้อง
tr: Bu alan geçerli bir kredi kartı CVC kodu gerektirir.
uk: Поле має бути дійсним CVC кодом кредитної картки.
vi: Yêu cầu nhập đúng mã CVC của thẻ tín dụng.
zh: 该字段必须是有效的信用卡 CVC 码。
zh_hant: 此欄位需要有效的信用卡 CVC 碼。

# colorCodeErrorText
source: Value should be a valid {colorCode} color code.
ar: هذا الحقل يتطلب رمز لون صالح.
bg: Това поле изисква валиден цветен код.
bn: একটি বৈধ রঙের কোড প্রয়োজন।
ca: Aquest camp requereix un codi de color vàlid.
cs: Pole vyžaduje platný barevný kód.
da: Dette felt kræver en gyldig farvekode.
de: Dieses Feld erfordert einen gültigen Farbcode.
el: Η τιμή πρέπει να είναι έγκυρος κωδικός χρώματος.
es: Este campo requiere un código de color válido.
et: Sellele väljale tuleb sisestada korrektne värvikood.
fa: این ورودی به کد رنگ معتبر نیاز دارد.
fi: Vaaditaan oikean muotoinen värikoodi.
fr: Ce champ nécessite un code couleur valide.
he: שדה זה דורש קוד צבע תקין.
hi: मान को एक मान्य {colorCode} रंग कोड होना चाहिए।
hr: Unesite validan kod boje.
hu: Ez a mező érvényes színkódot igényel.
id: Kode warna tidak valid.
it: Questo campo richiede un codice colore valido.
ja: 有効なカラーコードを入力してください。
ka: ველი უნდა იყოს სწორი ფერის კოდი.
km: ទិន្នន័យ​នេះ​ត្រូវ​តែ​ជាលេខកូដពណ៌ {colorCode} តែប៉ុណ្ណោះ។
ko: 유효한 색상 코드를 입력해 주세요.
ku: نرخ دەبێت کۆدی ڕەنگی دروست بێت {colorCode}.
lo: ຄ່າໃນຟອມນີ້ຕ້ອງແມ່ນລະຫັດສີທີ່ຖືກຕ້ອງ.
lv: Vērtībai jābūt derīgam {colorCode} krāsu kodam.
mn: Өнгөний код алдаатай байна.
ms: Ruangan ini memerlukan kod warna yang sah.
ne: यो क्षेत्रलाई मान्य रङ्ग कोड चाहिन्छ।
nl: Een geldige kleurcode is vereist.
no: Dette feltet krever en gyldig fargekode.
pl: To pole wymaga prawidłowego kodu koloru.
pt: Este campo requer um código de cor válido.
ro: Acest câmp necesită un cod de culoare valid.
ru: Поле должно быть действительным цветовым кодом.
sk: Toto pole vyžaduje platný farebný kód.
sl: Vnesite veljavno barvno kodo.
sq: Kjo fushë kërkon një kod ngjyre të vlefshëm.
sv: Detta fält kräver en giltig färgkod.
sw: Sehemu hii inahitaji msimbo halali wa rangi.
ta: இந்த உள்ளீட்டுக்கு சரியான நிறக் குறியீடு தேவை.
th: ข้อมูลนี้ต้องเป็นรหัสสีที่ถูกต้อง
tr: Bu alan geçerli bir renk kodu gerektirir.
uk: Поле має бути дійсним кольоровим кодом.
vi: Yêu cầu nhập mã màu hợp lệ.
zh: 该字段必须是有效的颜色代码。
zh_hant: 此欄位需要有效的顏色代碼。

# uppercaseErrorText
source: Value must be uppercase.
ar: هذا الحقل يتطلب حروفا كبيرة.
bg: Това поле изисква главни букви.
bn: এই ফিল্ডে বড় হাতের অক্ষর প্রয়োজন।
ca: Aquest camp requereix majúscules.
cs: Pole vyžaduje velká písmena.
da: Dette felt kræver store bogstaver.
de: Dieses Feld erfordert Großbuchstaben.
el: Η τιμή πρέπει να είναι με κεφαλαία γράμματα.
es: Este campo requiere letras mayúsculas.
et: See väli nõuab suurtähti.
fa: این ورودی به حروف بزرگ نیاز دارد.
fi: Kenttä vaatii isoja kirjaimia.
fr: Ce champ nécessite des lettres majuscules.
he: שדה זה דורש אותיות רישיות.
hi: मान अपरकेस होना चाहिए।
hr: Ovo polje zahtijeva velika slova.
hu: Ez a mező nagybetűket igényel.
id: Bidang ini memerlukan huruf besar.
it: Questo campo richiede lettere maiuscole.
ja: 値は大文字で入力してください。
ka: ველი უნდა შეიცავდეს დიდი ასოებით დაწერილს.
km: ទិន្នន័យនេះត្រូវតែជាអក្សរធំ។
ko: 이 필드는 대문자를 포함해야 합니다.
ku: نرخ دەبێت گەورەنووس بێت.
lo: ຄ່າໃນຟອມນີ້ຕ້ອງແມ່ນຕົວໃຫຍ່.
lv: Vērtībai jābūt lielajiem burtiem.
mn: Үсгийг томоор оруулна уу.
ms: Ruangan ini memerlukan huruf besar.
ne: यो क्षेत्रलाई ठूला अक्षर चाहिन्छ।
nl: Dit veld vereist hoofdletters.
no: Dette feltet krever store bokstaver.
pl: To pole wymaga wielkich liter.
pt: Este campo requer letras maiúsculas.
ro: Acest câmp necesită litere mari.
ru: Поле должно содержать заглавные буквы.
sk: Toto pole vyžaduje veľké písmená.
sl: Vrednost mora vsebovati velike črke.
sq: Kjo fushë kërkon shkronja të mëdha.
sv: Detta fält kräver versaler.
sw: Sehemu hii inahitaji herufi kubwa.
ta: இந்த உள்ளீடு பெரிய எழுத்துகளை கொண்டிருக்க வேண்டும்.
th: ข้อมูลนี้ต้องเป็นตัวอักษรพิมพ์ใหญ่
tr: Bu alan büyük harfler içermelidir.
uk: Поле має містити великі літери.
vi: Yêu cầu nhập chữ hoa.
zh: 该字段必须包含大写字母。
zh_hant: 此欄位需要包含大寫字母。

# lowercaseErrorText
source: Value must be lowercase.
ar: هذا الحقل يتطلب حروفا صغيرة.
bg: Това поле изисква малки букви.
bn: এই ফিল্ডে ছোট হাতের অক্ষর প্রয়োজন।
ca: Aquest camp requereix minúscules.
cs: Pole vyžaduje malá písmena.
da: Dette felt kræver små bogstaver.
de: Dieses Feld erfordert Kleinbuchstaben.
el: Η τιμή πρέπει να είναι με μικρά γράμματα.
es: Este campo requiere letras minúsculas.
et: See väli nõuab väiketähti.
fa: این ورودی به حروف کوچک نیاز دارد.
fi: Kenttä vaatii pieniä kirjaimia.
fr: Ce champ nécessite des lettres minuscules.
he: שדה זה דורש אותיות קטנות.
hi: मान लोअरकेस होना चाहिए।
hr: Ovo polje zahtijeva mala slova.
hu: Ez a mező kisbetűket igényel.
id: Bidang ini memerlukan huruf kecil.
it: Questo campo richiede lettere minuscole.
ja: 値は小文字で入力してください。
ka: ველი უნდა შეიცავდეს პატარა ასოებს.
km: ទិន្នន័យនេះត្រូវតែជាអក្សរតូច។
ko: 이 필드는 소문자를 포함해야 합니다.
ku: نرخ دەبێت بچوکنووس بێت.
lo: ຄ່າໃນຟອມນີ້ຕ້ອງແມ່ນຕົວເລັກ.
lv: Vērtībai jābūt mazajiem burtiem.
mn: Үсгийг жижгээр оруулна уу.
ms: Ruangan ini memerlukan huruf kecil.
ne: यो क्षेत्रलाई साना अक्षर चाहिन्छ।
nl: Dit veld vereist kleine letters.
no: Dette feltet krever små bokstaver.
pl: To pole wymaga małych liter.
pt: Este campo requer letras minúsculas.
ro: Acest câmp necesită litere mici.
ru: Поле должно содержать строчные буквы.
sk: Toto pole vyžaduje malé písmená.
sl: Vrednost mora vsebovati male črke.
sq: Kjo fushë kërkon shkronja të vogla.
sv: Detta fält kräver gemener.
sw: Sehemu hii inahitaji herufi ndogo.
ta: இந்த உள்ளீடு சிறிய எழுத்துகளை கொண்டிருக்க வேண்டும்.
th: ข้อมูลนี้ต้องเป็นตัวอักษรพิมพ์เล็ก
tr: Bu alan küçük harfler içermelidir.
uk: Поле має містити малі літери.
vi: Yêu cầu nhập chữ thường.
zh: 该字段必须包含小写字母。
zh_hant: 此欄位需要包含小寫字母。

# fileExtensionErrorText
source: File extension must be {extensions}.
ar: هذا الحقل يتطلب امتداد ملف صالح.
bg: Това поле изисква валидно файлово разширение.
bn: একটি বৈধ ফাইল এক্সটেনশন প্রয়োজন।
ca: Aquest camp requereix una extensió de fitxer vàlida.
cs: Pole vyžaduje platnou příponu souboru.
da: Dette felt kræver en gyldig filendelse.
de: Dieses Feld erfordert eine gültige Dateierweiterung.
el: Η τιμή πρέπει να είναι έγκυρη επέκταση αρχείου.
es: Este campo requiere una extensión de archivo válida.
et: See väli nõuab korrektset faililaiendit.
fa: این ورودی به پسوند فایل معتبر نیاز دارد.
fi: Vaaditaan oikean muotoinen tiedostopääte.
fr: Ce champ nécessite une extension de fichier valide.
he: שדה זה דורש סיומת קובץ תקינה.
hi: फ़ाइल एक्सटेंशन {extensions} होना चाहिए
hr: Unesite validnu ekstenziju fajla.
hu: Ez a mező érvényes fájlkiterjesztést igényel.
id: Ekstensi file tidak valid.
it: Questo campo richiede un'estensione del file valida.
ja: 有効なファイル拡張子を入力してください。
ka: ველი უნდა იყოს ფაილის სწორი გაფართოება.
km: ទិន្នន័យ​នេះ​ត្រូវ​តែ​ជា File ដែលមាន extension {extensions} តែប៉ុណ្ណោះ។
ko: 유효한 파일 확장자를 입력해 주세요.
ku: پەیوەندی پەڕگە دەبێت بێت {extensions}
lo: ຄ່າໃນຟອມນີ້ຕ້ອງແມ່ນນາມສະກຸນໄຟລ໌ທີ່ຖືກຕ້ອງ.
lv: Faila paplašinājumam jābūt {extensions}.
mn: Файлын өргөтгөл алдаатай байна.
ms: Ruangan ini memerlukan sambungan fail yang sah.
ne: यो क्षेत्रलाई मान्य फाइल विस्तार चाहिन्छ।
nl: Een geldige bestandsextensie is vereist.
no: Dette feltet krever en gyldig filtype.
pl: To pole wymaga prawidłowego rozszerzenia pliku.
pt: Este campo requer uma extensão de arquivo válida.
ro: Acest câmp necesită o extensie de fișier validă.
ru: Поле должно быть действительным расширением файла.
sk: Toto pole vyžaduje platnú príponu súboru.
sl: Vnesite veljavno pripono datoteke.
sq: Kjo fushë kërkon një zgjatje skedari të vlefshme.
sv: Detta fält kräver en giltig filtillägg.
sw: Sehemu hii inahitaji kiendelezi halali cha faili.
ta: இந்த உள்ளீட்டுக்கு சரியான கோப்பு நீட்டிப்பு தேவை.
th: ข้อมูลนี้ต้องเป็นนามสกุลไฟล์ที่ถูกต้อง
tr: Bu alan geçerli bir dosya uzantısı gerektirir.
uk: Поле має бути дійсним розширенням файлу.
vi: Yêu cầu nhập đúng đuôi file.
zh: 该字段必须是有效的文件扩展名。
zh_hant: 此欄位需要有效的文件擴展名。

# fileSizeErrorText
source: File size must be less than {maxSize} while it is {fileSize}.
ar: حجم هذا الملف يتجاوز الحجم المسموح به.
bg: Този файл надвишава максимално допустимия размер.
bn: এই ফাইলটি সর্বাধিক অনুমোদিত আকার ছাড়িয়ে গেছে।
ca: Aquest fitxer supera la mida màxima permesa.
cs: Tento soubor překračuje maximální povolenou velikost.
da: Denne fil overstiger den maksimalt tilladte størrelse.
de: Diese Datei überschreitet die maximal zulässige Größe.
el: Αυτό το αρχείο υπερβαίνει το μέγιστο επιτρεπόμενο μέγεθος.
es: Este archivo supera el tamaño máximo permitido.
et: See fail ületab maksimaalse lubatud suuruse.
fa: این فایل از حداکثر اندازه مجاز بیشتر است.
fi: Tiedosto ylittää sallitun enimmäiskoon.
fr: Ce fichier dépasse la taille maximale autorisée.
he: קובץ זה חורג מהגודל המותר.
hi: फ़ाइल की आकार {maxSize} से कम होनी चाहिए जबकि यह {fileSize} है
hr: Ovaj fajl premašuje maksimalnu dozvoljenu veličinu.
hu: Ez a fájl meghaladja a maximálisan megengedett méretet.
id: Ukuran file melebihi batas maksimum yang diizinkan.
it: Questo file supera la dimensione massima consentita.
ja: ファイルサイズが最大許容サイズを超えています。
ka: ფაილი აღემატება მაქსიმალურ დაშვებულ ზომას.
km: ទំហំ File ត្រូវតែតិចជាង {maxSize} តែប៉ុណ្ណោះ។
ko: 파일 크기가 최대 허용 크기를 초과했습니다.
ku: قەبارەی پەڕگە دەبێت کەمتر بێت لە {maxSize} کاتێک ئەوەی {fileSize}
lo: ໄຟລ໌ນີ້ມີຂະໜາດເກີນຂະໜາດທີ່ອະນຸຍາດໄດ້.
lv: Faila izmēram jābūt mazākam par {maxSize}, bet tas ir {fileSize}.
mn: Файлын хэмжээ хэтэрсэн байна.
ms: Fail ini melebihi saiz maksimum yang dibenarkan.
ne: यो फाइलले अनुमत अधिकतम आकार नाघेको छ।
nl: Dit bestand overschrijdt de maximaal toegestane grootte.
no: Denne filen overskrider maksimal tillatt størrelse.
pl: Plik przekracza maksymalny dozwolony rozmiar.
pt: Este arquivo excede o tamanho máximo permitido.
ro: Acest fișier depășește dimensiunea maximă permisă.
ru: Файл превышает максимально допустимый размер.
sk: Tento súbor prekračuje maximálnu povolenú veľkosť.
sl: Datoteka presega največjo dovoljeno velikost.
sq: Ky skedar tejkalon madhësinë maksimale të lejuar.
sv: Denna fil överskrider den maximalt tillåtna storleken.
sw: Faili hili linazidi ukubwa wa juu ulioruhusiwa.
ta: இந்த கோப்பு அதிகபட்ச அனுமதிக்கப்பட்ட அளவை மீறுகிறது.
th: ไฟล์นี้มีขนาดใหญ่เกินไป
tr: Bu dosya, izin verilen maksimum boyutu aşıyor.
uk: Цей файл перевищує максимально допустимий розмір.
vi: File vượt quá kích thước tối đa cho phép.
zh: 该文件超出允许的最大大小。
zh_hant: 此文件超過允許的最大大小。

# dateRangeErrorText
source: Date must be in range {min} - {max}.
ar: التاريخ يجب أن يكون ضمن النطاق المسموح به.
bg: Датата трябва да е в разрешения диапазон.
bn: তারিখটি অনুমোদিত সীমার মধ্যে হতে হবে।
ca: La data ha d'estar dins del rang permès.
cs: Datum musí být v povoleném rozsahu.
da: Datoen skal være inden for det tilladte interval.
de: Das Datum muss im erlaubten Bereich liegen.
el: Η ημερομηνία πρέπει να είναι εντός του επιτρεπόμενου εύρους.
es: La fecha debe estar dentro del rango permitido.
et: Kuupäev peab olema lubatud vahemikus.
fa: تاریخ باید در محدوده مجاز باشد.
fi: Päivämäärän on oltava sallitussa aikavälissä.
fr: La date doit être dans l'intervalle autorisé.
he: התאריך חייב להיות בטווח המותר.
hi: तिथि {min} - {max} सीमा में होनी चाहिए
hr: Datum mora biti u dozvoljenom rasponu.
hu: A dátumnak a megengedett tartományon belül kell lennie.
id: Tanggal harus berada dalam rentang yang diizinkan.
it: La data deve essere compresa nell'intervallo consentito.
ja: 日付は許可された範囲内である必要があります。
ka: თარიღი უნდა იყოს ვალიდურ დიაპაზონში.
km: កាលបរិច្ឆេទត្រូវតែស្ថិតនៅក្នុងចន្លោះ {min} ដល់ {max} តែប៉ុណ្ណោះ។
ko: 날짜는 허용된 범위 내에 있어야 합니다.
ku: بەروار دەبێت لە ماوەی {min} - {max} بێت
lo: ວັນທີຕ້ອງຢູ່ໃນຊ່ວງທີ່ອະນຸຍາດ.
lv: Datumam jābūt diapazonā no {min} līdz {max}.
mn: Огноо зөвшөөрөгдсөн хязгаарт байх ёстой.
ms: Tarikh mesti dalam julat yang dibenarkan.
ne: मिति अनुमत दायरामा हुनुपर्छ।
nl: De datum moet binnen het toegestane bereik liggen.
no: Datoen må være innenfor det tillatte området.
pl: Data musi być w dozwolonym zakresie.
pt: A data deve estar dentro do intervalo permitido.
ro: Data trebuie să fie în intervalul permis.
ru: Дата должна быть в допустимом диапазоне.
sk: Dátum musí byť v povolenom rozsahu.
sl: Datum mora biti v dovoljenem razponu.
sq: Data duhet të jetë brenda intervalit të lejuar.
sv: Datumet måste vara inom det tillåtna intervallet.
sw: Tarehe lazima iwe ndani ya kikomo kilichoruhusiwa.
ta: தேதி அனுமதிக்கப்பட்ட வரம்பில் இருக்க வேண்டும்.
th: วันที่ต้องอยู่ในช่วงที่กำหนด
tr: Tarih izin verilen aralıkta olmalıdır.
uk: Дата має бути в дозволеному діапазоні.
vi: Ngày phải nằm trong khoảng cho phép.
zh: 日期必须在允许的范围内。
zh_hant: 日期必須在允許的範圍內。
