Repository: flutter-form-builder-ecosystem/form_builder_validators
Catalog: lib/l10n/intl_*.arb
Languages: ar, bg, bn, ca, cs, da, de, el, es, et, fa, fi, fr, he, hi, hr, hu, id, it, ja, ka, km, ko, ku, lo, lv, mn, ms, ne, nl, no, pl, pt, ro, ru, sk, sl, sq, sv, sw, ta, th, tr, uk, vi, zh, zh_hant

# maxErrorText
source: Value must be less than or equal to {max}.
ar: يجب أن لا تزيد القيمة المدخلة عن {max}.
bg: Стойността трябва да е по-малка или равна на {max}
bn: মান অবশ্যই {max} এর কম বা সমান হতে হবে।
ca: El valor ha de ser inferior o igual a {max}.
cs: Hodnota musí být menší než nebo rovna {max}.
da: Værdien skal være mindre eller lig med {max}.
de: Der Wert muss kleiner oder gleich {max} sein.
el: Η τιμή πρέπει να είναι μικρότερη ή ίση με {max}.
es: El valor debe ser menor o igual que {max}.
et: Väärtus ei tohi olla üle {max}.
fa: مقدار باید برابر یا کمتر از {max} باشد.
fi: Arvon tulee olla pienempi tai yhtä suuri kuin {max}.
fr: La valeur doit être inférieure ou égale à {max}.
he: ערך זה חייב להיות קטן או שווה ל {max}.
hi: मान {max} से कम या बराबर होना चाहिए
hr: Vrijednost mora biti manja ili jednaka {max}.
hu: Az érték legyen legfeljebb {max}.
id: Nilai harus kurang dari atau sama dengan {max}.
it: Il valore inserito deve essere minore o uguale a {max}.
ja: 値は{max}以下にしてください。
ka: მნიშვნელობა უნდა იყოს ნაკლები ან ტოლი {max}.
km: ទិន្នន័យនេះត្រូវតែតិចជាង ឬស្មើនឹង {max}។
ko: 이 필드의 값은 반드시 {max} 이하이어야 합니다.
ku: نرخ دەبێت کەمتر بێت یان یەکسان بێت بە {max}
lo: ຄ່າໃນຟອມນີ້ຕ້ອງນ້ອຍກວ່າ ຫຼືເທົ່າກັບ {max}.
lv: Vērtībai jābūt mazākai vai vienādai ar {max}.
mn: {max}-аас бага утга оруулна уу.
ms: Nilai wajib kurang daripada atau sama dengan {max}.
ne: मान {max} भन्दा कम वा बराबर हुनुपर्छ।
nl: De waarde moet kleiner of gelijk zijn aan {max}.
no: Verdien må være mindre enn eller lik {max}.
pl: Wartość musi być mniejsza lub równa {max}.
pt: O valor deve ser menor ou igual a {max}.
ro: Valoarea trebuie să fie mai mică sau egală cu {max}.
ru: Значение должно быть меньше или равно {max}.
sk: Hodnota musí byť menšia alebo rovná ako {max}.
sl: Vrednost ne sme presegati {max}.
sq: Vlera duhet të jetë më e vogël ose e barabartë me {max}.
sv: Värdet måste vara mindre än eller lika med {max}.
sw: Thamani lazima iwe chini ya au sawa na {max}.
ta: மதிப்பு {max} ஐ விட குறைவாகவோ அல்லது சமமாகவோ இருக்க வேண்டும்.
th: ข้อมูลนี้ต้องมีค่าน้อยกว่าหรือเท่ากับ {max}
tr: Değer {max} değerinden küçük veya eşit olmalıdır.
uk: Значення має бути менше або дорівнювати {max}.
vi: Giá trị phải nhỏ hơn hoặc bằng {max}.
zh: 该字段必须小于等于 {max}。
zh_hant: 此欄位必須小於或等於 {max}

# maxLengthErrorText
source: Value must have a length less than or equal to {maxLength}.
ar: يجب أن لا يزيد طول القيمة المدخلة عن {maxLength}.
bg: Стойността трябва да има дължина, по-малка или равна на {maxLength}
bn: মান অবশ্যই {maxLength} এর থেকে কম বা সমান সংখ্যা হতে হবে।
ca: El valor ha de tenir una longitud inferior o igual a {maxLength}.
cs: Hodnota musí mít délku menší než nebo rovnu {maxLength}.
da: Værdiens længde skal være mindre eller lig med {maxLength}.
de: Der Wert muss eine Länge haben, die kleiner oder gleich {maxLength} ist.
el: Η τιμή πρέπει να έχει μήκος μικρότερο ή ίσο με {maxLength}.
es: El valor debe tener una longitud menor o igual a {maxLength}.
et: Sisendi pikkus ei tohi olla üle {maxLength}.
fa: طول مقدار باید کمتر یا برابر با {maxLength} باشد.
fi: Merkkijonon pituuden tulee olla pienempi tai yhtä suuri kuin {maxLength}.
fr: La valeur doit avoir une longueur inférieure ou égale à {maxLength}.
he: ערך זה חייב להיות באורך קטן או שווה ל {maxLength}.
hi: मान की लंबाई {maxLength} से कम या बराबर होनी चाहिए
hr: Vrijednost mora biti kraća ili jednaka {maxLength} znakova.
hu: Az érték hossza legfeljebb {maxLength} lehet.
id: Panjang karakter harus kurang dari atau sama dengan {maxLength}.
it: Il valore inserito deve avere una lunghezza minore o uguale a {maxLength}.
ja: 値は{maxLength}文字以下で入力してください。
ka: მნიშვნელობის სიგრძე უნდა იყოს ნაკლები ან ტოლი {maxLength}.
km: ប្រវែងតួអក្សរទិន្នន័យត្រូវតែតិចជាង ឬស្មើនឹង {maxLength}។
ko: 이 필드는 반드시 {maxLength}자 이하이어야 합니다.
ku: نرخ دەبێت درێژایی هەبێت کەمتر یان یەکسان بە {maxLength}
lo: ຄ່າໃນຟອມນີ້ຕ້ອງມີຄວາມຍາວໜ້ອຍກວ່າ ຫຼືເທົ່າກັບ {maxLength}.
lv: Vērtības garumam jābūt mazākam vai vienādam ar {maxLength}.
mn: {maxLength}-аас богино утга оруулна уу.
ms: Nilai mesti mempunyai panjang kurang daripada atau sama dengan {maxLength}.
ne: मानको लम्बाइ {maxLength} भन्दा कम वा बराबर हुनुपर्छ।
nl: De waarde moet een lengte hebben die kleiner of gelijk is aan {maxLength}.
no: Verdien må være mindre enn eller lik {maxLength} tegn.
pl: Wartość nie może mieć więcej niż {maxLength} znaków.
pt: O valor deve ter um comprimento menor ou igual a {maxLength}.
ro: Valoarea trebuie să aibă o lungime mai mică sau egală cu {maxLength}.
ru: Длина значения должна быть меньше или равна {maxLength}.
sk: Hodnota musí mať dĺžku najviac {maxLength} znakov.
sl: Besedilo mora biti krajše ali enako {maxLength} znakov.
sq: Vlera duhet të ketë një gjatësi më të vogël ose të barabartë me {maxLength}.
sv: Värdet måste ha en längd mindre än eller lika med {maxLength}.
sw: Thamani lazima iwe na urefu chini ya au sawa na {maxLength}.
ta: மதிப்பின் நீளம் {maxLength} ஐ விட குறைவாகவோ அல்லது சமமாகவோ இருக்க வேண்டும்.
th: ความยาวตัวอักษาต้องมีจำนวนน้อยกว่าหรือเท่ากับ {maxLength}
tr: Değerin uzunluğu {maxLength} değerinden küçük veya eşit olmalıdır.
uk: Довжина значення має бути менше або дорівнювати {maxLength}.
vi: Độ dài phải nhỏ hơn hoặc bằng {maxLength}.
zh: 该字段的长度必须小于等于 {maxLength}。
zh_hant: 此欄位的長度必須小於或等於 {maxLength}

# maxWordsCountErrorText
source: Value must have a words count less than or equal to {maxWordsCount}.
ar: يجب أن لا يزيد عدد الكلمات المدخلة عن {maxWordsCount}.
bg: Стойността трябва да има брой думи, по-малък или равен на {maxWordsCount}
bn: মান অবশ্যই একটি শব্দের গণনা থাকতে হবে {maxWordsCount} এর চেয়ে কম বা সমান।
ca: El valor ha de tenir un compte de paraules inferior o igual a {maxWordsCount}.
cs: Hodnota musí mít počet slov menší nebo rovná {maxWordsCount}.
da: Værdiens antal af ord skal være mindre eller lig med {maxWordsCount}.
de: Der Wert muss eine Wortanzahl haben, die kleiner oder gleich {maxWordsCount} ist.
el: Η τιμή πρέπει να έχει έναν αριθμό λέξεων μικρότερο ή ίσο με {maxWordsCount}.
es: El valor debe tener un recuento de palabras menor o igual a {maxWordsCount}.
et: Väärtuses peab olema sõnade arv vähem või võrdne {maxWordsCount}.
fa: مقدار باید تعداد کلمات کمتر یا مساوی با {maxWordsCount} داشته باشد.
fi: Sanamäärän tulee olla pienempi tai yhtä suuri kuin {maxWordsCount}.
fr: La valeur doit avoir un nombre de mots inférieur ou égal à {maxWordsCount}.
he: ערך זה חייב להיות באורך מילים קטן או שווה ל {maxWordsCount}.
hi: मान की शब्दों की संख्या {maxWordsCount} से कम या बराबर होनी चाहिए
hr: Vrijednost mora imati riječi manje od ili jednake {maxWordsCount}.
hu: Az érték szavainak száma kevesebb vagy egyenlő kell legyen, mint {maxWordsCount}.
id: Nilai harus memiliki jumlah kata kurang dari atau sama dengan {maxWordsCount}.
it: Il valore deve avere un conteggio di parole inferiore o uguale a {maxWordsCount}.
ja: 値の単語数は{maxWordsCount}以下にしてください。
ka: მნიშვნელობას უნდა ჰქონდეს სიტყვების რაოდენობა ნაკლები ან ტოლი {maxWordsCount}.
km: ចំនួនពាក្យត្រូវតែតិចជាង ឬស្មើនឹង {maxWordsCount}។
ko: 값은 {maxWordsCount}보다 작거나 같은 단어를 가져야 합니다.
ku: نرخ دەبێت ژمارەی وشەکان هەبێت کەمتر یان یەکسان بە {maxWordsCount}
lo: ມູນຄ່າຕ້ອງມີຄຳສັບຫນ້ອຍກວ່າຫຼືເທົ່າກັບ {maxWordsCount}.
lv: Vārdu skaitam jābūt mazākam vai vienādam ar {maxWordsCount}.
mn: Утга нь түүнээс бага буюу тэнцүү тоолох үгстэй байх ёстой {maxWordsCount}.
ms: Nilai mesti mempunyai kata-kata yang kurang daripada atau sama dengan {maxWordsCount}.
ne: मानसँग शब्दहरूको संख्या {maxWordsCount} भन्दा कम वा बराबर हुनुपर्छ।
nl: De waarde moet een aantal woorden tellen die minder of gelijk zijn aan {maxWordsCount}.
no: Antall ord må være mindre enn eller lik {maxWordsCount}.
pl: Wartość musi mieć liczbę słów mniejszych lub równych {maxWordsCount}.
pt: O valor deve ter uma contagem de palavras menor ou igual a {maxWordsCount}.
ro: Valoarea trebuie să aibă un număr de cuvinte mai mic sau egal cu {maxWordsCount}.
ru: Значение должно иметь количество слов, меньшее или равное {maxWordsCount}.
sk: Hodnota musí mať počet slov menší alebo rovný {maxWordsCount}.
sl: Vrednost mora imeti manj ali enako število besed kot {maxWordsCount}.
sq: Vlera duhet të ketë një numër fjalësh më të vogël ose të barabartë me {maxWordsCount}.
sv: Värdet måste ha ett antal ord som är mindre än eller lika med {maxWordsCount}.
sw: Thamani lazima iwe na hesabu ya maneno chini ya au sawa na {maxWordsCount}.
ta: மதிப்பை விட குறைவாகவோ அல்லது சமமாகவோ மதிப்பிடப்பட வேண்டும் {maxWordsCount}.
th: ค่าจะต้องมีคำนับน้อยกว่าหรือเท่ากับ {maxWordsCount}
tr: Değer, {maxWordsCount} 'dan daha az veya eşit bir kelimeye sahip olmalıdır.
uk: Значення повинно мати кількість слів менше або дорівнювати {maxWordsCount}.
vi: Giá trị phải có số từ nhỏ hơn hoặc bằng {maxWordsCount}.
zh: 值必须具有小于或等于 {maxWordsCount} 的单词计数。
zh_hant: 值必須具有小於或等於 {maxWordsCount} 的單詞計數

# minErrorText
source: Value must be greater than or equal to {min}.
ar: يجب أن لا تقل القيمة المدخلة عن {min}.
bg: Стойността трябва да е по-голяма или равна на {min}
bn: মান অবশ্যই {min} এর থেকে বেশি বা সমান হতে হবে।
ca: El valor ha de ser superior o igual a {min}.
cs: Hodnota musí být větší než nebo rovna {min}.
da: Værdien skal være større end eller lig med {min}.
de: Der Wert muss größer oder gleich {min} sein.
el: Η τιμή πρέπει να είναι μεγαλύτερη ή ίση με {min}.
es: El valor debe ser mayor o igual que {min}.
et: Väärtus peab olema vähemalt {min}.
fa: مقدار باید برابر یا بیشتر از {min} باشد.
fi: Kentän arvon tulee olla suurempi tai yhtä suuri kuin {min}.
fr: La valeur doit être supérieure ou égale à {min}.
he: ערך זה חייב להיות גדול או שווה ל {min}.
hi: मान {min} से अधिक या बराबर होना चाहिए
hr: Vrijednost mora biti veća ili jednaka {min}.
hu: Az érték legyen legalább {min}.
id: Nilai harus lebih besar dari atau sama dengan {min}.
it: Il valore inserito deve essere maggiore o uguale a {min}.
ja: 値は{min}以上にしてください。
ka: მნიშვნელობა უნდა იყოს მეტი ან ტოლი {min}.
km: ទិន្នន័យនេះត្រូវតែធំជាង ឬស្មើនឹង {min}។
ko: 이 필드의 값은 반드시 {min} 이상이어야 합니다.
ku: نرخ دەبێت زیاتر بێت یان یەکسان بێت بە {min}
lo: ຄ່າໃນຟອມນີ້ຕ້ອງໃຫຍ່ກວ່າ ຫຼືເທົ່າກັບ {min}.
lv: Vērtībai jābūt lielākai vai vienādai ar {min}.
mn: {min}-аас их утга оруулна уу.
ms: Nilai wajib lebih besar daripada atau sama dengan {min}.
ne: मान {min} भन्दा बढी वा बराबर हुनुपर्छ।
nl: De waarde moet groter of gelijk zijn aan {min}.
no: Verdien må være større enn eller lik {min}.
pl: Wartość musi być większa lub równa {min}.
pt: O valor deve ser maior ou igual a {min}.
ro: Valoarea trebuie să fie mai mare sau egală cu {min}.
ru: Значение должно быть больше или равно {min}.
sk: Hodnota musí byť väčšia alebo rovná ako {min}.
sl: Vrednost mora biti večja ali enaka {min}.
sq: Vlera duhet të jetë më e madhe ose e barabartë me {min}.
sv: Värdet måste vara större än eller lika med {min}.
sw: Thamani lazima iwe kubwa kuliko au sawa na {min}.
ta: மதிப்பு {min} ஐ விட அதிகமாகவோ அல்லது சமமாகவோ இருக்க வேண்டும்.
th: ข้อมูลนี้ต้องมีค่ามากกว่าหรือเท่ากับ {min}
tr: Değer {min} değerinden büyük veya eşit olmalıdır.
uk: Значення має бути більше або дорівнювати {min}.
vi: Giá trị phải lớn hơn hoặc bằng {min}.
zh: 该字段必须大于等于 {min}。
zh_hant: 此欄位必須大於或等於 {min}

# minLengthErrorText
source: Value must have a length greater than or equal to {minLength}.
ar: يجب أن لا يقل طول القيمة المدخلة عن {minLength}.
bg: Стойността трябва да има дължина, по-голяма или равна на {minLength}
bn: মান অবশ্যই {minLength} এর চেয়ে বেশি বা সমান সংখ্যা হতে হবে।
ca: El valor ha de tenir una longitud superior o igual a {minLength}.
cs: Hodnota musí mít délku větší než nebo rovnu {minLength}.
da: Værdien skal være større end eller lig med {minLength}.
de: Der Wert muss eine Länge haben, die größer oder gleich {minLength} ist.
el: Η τιμή πρέπει να έχει μήκος μεγαλύτερο ή ίσο με {minLength}.
es: El valor debe tener una longitud mayor o igual a {minLength}.
et: Sisendi pikkus peab olema vähemalt {minLength}.
fa: طول مقدار باید بیشتر یا برابر با {minLength} باشد.
fi: Merkkijonon pituuden tulee olla suurempi tai yhtä suuri kuin {minLength}.
fr: La valeur doit avoir une longueur supérieure ou égale à {minLength}.
he: ערך זה חייב להיות באורך גדול או שווה ל {minLength}.
hi: मान की लंबाई {minLength} से अधिक या बराबर होनी चाहिए
hr: Vrijednost mora biti duža ili jednaka {minLength} znakova.
hu: Az érték hossza legalább {minLength} karakter kell legyen.
id: Panjang karakter harus lebih besar dari atau sama dengan {minLength}.
it: Il valore inserito deve avere una lunghezza maggiore o uguale a {minLength}.
ja: 値は{minLength}文字以上で入力してください。
ka: მნიშვნელობის სიგრძე უნდა იყოს მეტი ან ტოლი {minLength}.
km: ប្រវែងតួអក្សរទិន្នន័យត្រូវតែធំជាង ឬស្មើនឹង {minLength}។
ko: 이 필드는 반드시 {minLength}자 이상이어야 합니다.
ku: نرخ دەبێت درێژایی هەبێت زیاتر یان یەکسان بە {minLength}
lo: ຄ່າໃນຟອມນີ້ຕ້ອງມີຄວາມຍາວຫຼາຍກວ່າ ຫຼືເທົ່າກັບ {minLength}.
lv: Vērtības garumam jābūt lielākam vai vienādam ar {minLength}.
mn: {minLength}-аас урт утга оруулна уу.
ms: Nilai mesti mempunyai panjang lebih besar daripada atau sama dengan {minLength}.
ne: मानको लम्बाइ {minLength} भन्दा बढी वा बराबर हुनुपर्छ।
nl: De waarde moet een lengte hebben die groter of gelijk is aan {minLength}.
no: Verdien må være større enn eller lik {minLength} tegn.
pl: Wartość musi mieć co najmniej {minLength} znaków.
pt: O valor deve ter um comprimento maior ou igual a {minLength}.
ro: Valoarea trebuie să aibă o lungime mai mare sau egală cu {minLength}.
ru: Длина значения должна быть больше или равна {minLength}.
sk: Hodnota musí mať dĺžku aspoň {minLength} znakov.
sl: Besedilo mora biti daljše ali enako {minLength} znakov.
sq: Vlera duhet të ketë një gjatësi më të madhe ose të barabartë me {minLength}.
sv: Värdet måste ha en längd större än eller lika med {minLength}.
sw: Thamani lazima iwe na urefu mkubwa kuliko au sawa na {minLength}.
ta: மதிப்பு {minLength} ஐ விட அதிகமாக அல்லது அதற்கு சமமான நீளத்தைக் கொண்டிருக்க வேண்டும்.
th: ความยาวตัวอักษาต้องมีจำนวนมากกว่าหรือเท่ากับ {minLength}
tr: Değerin uzunluğu {minLength} değerinden büyük veya eşit olmalıdır.
uk: Довжина значення має бути більше або дорівнювати {minLength}.
vi: Độ dài phải lớn hơn hoặc bằng {minLength}.
zh: 该字段的长度必须大于等于 {minLength}。
zh_hant: 此欄位的長度必須大於或等於 {minLength}

# minWordsCountErrorText
source: Value must have a words count greater than or equal to {minWordsCount}.
ar: يجب أن لا يقل عدد الكلمات المدخلة عن {minWordsCount}.
bg: Стойността трябва да има брой думи, по-голям или равен на {minWordsCount}
bn: মান অবশ্যই একটি শব্দের গণনা থাকতে হবে {minWordsCount} এর চেয়ে বেশি বা সমান।
ca: El valor ha de tenir un compte de paraules superior o igual a {minWordsCount}.
cs: Hodnota musí mít počet slov větší nebo rovná {minWordsCount}.
da: Antallet af ord skal være større eller lig med {minWordsCount}.
de: Der Wert muss eine Wortanzahl haben, die größer oder gleich {minWordsCount} ist.
el: Η τιμή πρέπει να έχει έναν αριθμό λέξεων μεγαλύτερο ή ίσο με {minWordsCount}.
es: El valor debe tener un recuento de palabras mayor o igual a {minWordsCount}.
et: Väärtuse sõnade arv peab olema suurem kui {minWordsCount}.
fa: مقدار باید تعداد کلمات بیشتر یا مساوی با {minWordsCount} داشته باشد.
fi: Sanamäärän tulee olla suurempi tai yhtä suuri kuin {minWordsCount}.
fr: La valeur doit avoir un nombre de mots supérieur ou égal à {minWordsCount}.
he: ערך זה חייב להיות באורך מילים גדול או שווה ל {minWordsCount}.
hi: मान की शब्दों की संख्या {minWordsCount} से अधिक या बराबर होनी चाहिए
hr: Vrijednost mora imati broj riječi veći ili jednak {minWordsCount}.
hu: Az érték szavainak száma nagyobb vagy egyenlő kell legyen, mint {minWordsCount}.
id: Nilai harus memiliki kata yang diperhitungkan lebih besar dari atau sama dengan {minWordsCount}.
it: Il valore deve avere un conteggio di parole maggiore o uguale a {minWordsCount}.
ja: 値の単語数は{minWordsCount}以上にしてください。
ka: მნიშვნელობას უნდა ჰქონდეს სიტყვების რაოდენობა მეტი ან ტოლი {minWordsCount}.
km: ចំនួនពាក្យត្រូវតែធំជាង ឬស្មើនឹង {minWordsCount}។
ko: 값은 {minWordsCount}보다 큰 단어 수를 가져야 합니다.
ku: نرخ دەبێت ژمارەی وشەکان هەبێت زیاتر یان یەکسان بە {minWordsCount}
lo: ມູນຄ່າຕ້ອງມີຄຳສັບທີ່ໃຫຍ່ກວ່າຫຼືເທົ່າກັບ {minWordsCount}.
lv: Vārdu skaitam jābūt lielākam vai vienādam ar {minWordsCount}.
mn: Утга нь түүнээс их буюу тэнцүү тооны үгтэй байх ёстой {minWordsCount}.
ms: Nilai mesti mempunyai kata-kata yang lebih besar daripada atau sama dengan {minWordsCount}.
ne: मानसँग शब्दहरूको संख्या {minWordsCount} भन्दा बढी वा बराबर हुनुपर्छ।
nl: De waarde moet een aantal woorden tellen groter of gelijk aan {minWordsCount}.
no: Antall ord må være større enn eller lik {minWordsCount}.
pl: Wartość musi mieć liczbę słów większą lub równą {minWordsCount}.
pt: O valor deve ter uma contagem de palavras maior ou igual a {minWordsCount}.
ro: Valoarea trebuie să aibă un număr de cuvinte mai mare sau egal cu {minWordsCount}.
ru: Значение должно иметь количество слов, большее или равное {minWordsCount}.
sk: Hodnota musí mať počet slov väčší alebo rovný {minWordsCount}.
sl: Vrednost mora imeti več ali enako število besed kot {minWordsCount}.
sq: Vlera duhet të ketë një numër fjalësh më të madh ose të barabartë me {minWordsCount}.
sv: Värdet måste ha ett antal ord som är större än eller lika med {minWordsCount}.
sw: Thamani lazima iwe na maneno kuhesabu kubwa kuliko au sawa na {minWordsCount}.
ta: மதிப்பை விட அதிகமாகவோ அல்லது சமமாகவோ மதிப்பிடப்பட வேண்டும் {minWordsCount}.
th: ค่าจะต้องมีคำจำนวนมากกว่าหรือเท่ากับ {minWordsCount}
tr: Değer, {minWordsCount} 'dan daha büyük veya eşit bir kelimeye sahip olmalıdır.
uk: Значення повинно мати кількість слів більше або дорівнювати {minWordsCount}.
vi: Giá trị phải có số từ lớn hơn hoặc bằng {minWordsCount}.
zh: 值必须具有大于或等于 {minWordsCount} 的单词计数。
zh_hant: 值必須具有大於或等於 {minWordsCount} 的單詞計數

# notEqualErrorText
source: This field value must not be equal to {value}.
ar: يجب أن لا تكون القيمة المدخلة مساوية لـ {value}.
bg: Стойността на това поле не трябва да е равна на {value}.
bn: মান {value} এর সমান হওয়া উচিত নয়।
ca: Aquest valor de camp no ha de ser igual a {value}.
cs: Hodnota se nesmí rovnat {value}.
da: Feltets værdi må ikke være lig med {value}.
de: Dieser Feldwert darf nicht gleich {value} sein.
el: Η τιμή δεν πρέπει να είναι ίση με {value}.
es: Este campo no debe ser igual a {value}.
et: See väärtus ei tohi olla {value}.
fa: مقدار این ورودی نباید برابر با {value} باشد.
fi: Tämän kentän arvo ei saa olla sama kuin {value}.
fr: Cette valeur de champ ne doit pas être égale à {value}.
he: ערך זה חייב להיות שונה מ {value}.
hi: इस फील्ड का मान {value} के बराबर नहीं होना चाहिए।
hr: Vrijednost ne smije biti jednaka {value}.
hu: Ez a mezőérték nem lehet egyenlő {value}.
id: Nilai bidang ini tidak boleh sama dengan {value}.
it: Questo valore di campo non deve essere uguale a {value}.
ja: 値は{value}と異なる必要があります。
ka: ველის მნიშვნელობა არ უნდა იყოს ტოლი {value}.
km: ទិន្នន័យនេះមិនអាចស្មើនឹង {value} នោះទេ។
ko: 이 필드의 값은 반드시 {value}와 달라야 합니다.
ku: نرخی ئەم خانەیە دەبێت نەبێت یەکسان بە {value}.
lo: ຄ່າໃນຟອມນີ້ຕ້ອງບໍ່ເທົ່າກັບ {value}.
lv: Šī lauka vērtībai nevajadzētu būt vienādai ar {value}.
mn: {value}-тэй тэнцүү биш утга оруулна уу.
ms: Nilai ruangan ini wajib tidak sama dengan {value}.
ne: यो क्षेत्रको मान {value} बराबर हुनु हुँदैन।
nl: De waarde mag niet gelijk zijn aan {value}.
no: Verdien i feltet må ikke være lik {value}.
pl: Wartość tego pola nie może być {value}.
pt: O valor não deve ser igual a {value}.
ro: Valoarea câmpului nu trebuie să fie egală cu {value}.
ru: Значение поля не должно быть равно {value}.
sk: Hodnota tohto poľa nesmie byť {value}.
sl: Vrednost ne sme biti enaka {value}.
sq: Kjo vlerë nuk duhet të jetë e barabartë me {value}.
sv: Detta fältvärde får inte vara lika med {value}.
sw: Thamani hii ya sehemu haifai kuwa sawa na {value}.
ta: இந்த உள்ளீடு மதிப்பு {value}க்கு சமமாக இருக்கக்கூடாது.
th: ข้อมูลนี้ต้องไม่เท่ากับ {value}
tr: Bu alanın değeri, {value} değerine eşit olmamalıdır.
uk: Значення поля не повинно дорівнювати {value}.
vi: Bắt buộc khác {value}.
zh: 该字段不能等于 {value}。
zh_hant: 此欄位不得等於 {value}

# numericErrorText
source: Value must be numeric.
ar: القيمة المدخلة ليست رقما.
bg: Стойността трябва да е числова.
bn: মান অবশ্যই সংখ্যায় হতে হবে।
ca: El valor ha de ser numèric.
cs: Hodnota musí být číslo.
da: Værdien skal være numerisk.
de: Der Wert muss numerisch sein.
el: Η τιμή πρέπει να είναι αριθμητική.
es: El valor debe ser numérico.
et: Sisend peab olema arv.
fa: مقدار باید عددی باشد.
fi: Arvon tulee olla numeerinen.
fr: La valeur doit être numérique.
he: ערך זה חייב להיות מספרי.
hi: मान संख्यात्मक होना चाहिए।
hr: Vrijednost mora biti brojčana.
hu: Ebbe a mezőbe csak számot lehet írni.
id: Nilai harus berupa angka.
it: Il valore deve essere numerico.
ja: 値は数字で入力してください。
ka: მნიშვნელობა უნდა იყოს რიცხვი.
km: ទិន្នន័យ​នេះ​ត្រូវ​តែ​ជា​លេខតែប៉ុណ្ណោះ។
ko: 숫자만 입력 가능합니다.
ku: نرخ دەبێت ژمارەی بێت.
lo: ຄ່າທີ່ປ້ອນໃສ່ຕ້ອງເປັນໂຕເລກເທົ່ານັ້ນ.
lv: Vērtībai jābūt skaitliskai.
mn: Тоон утга оруулна уу.
ms: Nilai wajib dalam bentuk angka.
ne: मान संख्यात्मक हुनुपर्छ।
nl: De waarde moet numeriek zijn.
no: Verdien må være numerisk.
pl: Wartość musi być liczbą.
pt: O valor deve ser numérico.
ro: Valoarea trebuie să fie numerică.
ru: Значение должно быть числом.
sk: Hodnota musí byť číslo.
sl: Vrednost polja mora biti numerična.
sq: Vlera duhet të jetë numerike.
sv: Värdet måste vara numeriskt.
sw: Thamani lazima iwe nambari.
ta: மதிப்பு எண்களாக இருக்க வேண்டும்.
th: ข้อมูลนี้ต้องเป็นตัวเลขเท่านั้น
tr: Değer sayısal olmalıdır.
uk: Значення має бути числом.
vi: Yêu cầu nhập một số.
zh: 该字段必须是数字。
zh_hant: 此欄位必須是數字。

# requiredErrorText
source: This field cannot be empty.
ar: هذا الحقل يجب ملؤه.
bg: Това поле не може да бъде празно.
bn: খালি রাখা যাবে না।
ca: Aquest camp no pot estar buit.
cs: Pole nemůže být prázdné.
da: Feltet skal udfyldes.
de: Dieses Feld darf nicht leer sein.
el: Το πεδίο δεν μπορεί να είναι κενό.
es: Este campo no puede estar vacío.
et: See väli ei tohi olla tühi.
fa: این ورودی نمی‌تواند خالی باشد.
fi: Kenttä ei voi olla tyhjä.
fr: Ce champ ne peut pas être vide.
he: שדה זה אינו יכול להיות ריק.
hi: यह फ़ील्ड खाली नहीं हो सकता।
hr: Ovo polje ne smije biti prazno.
hu: Ennek a mezőnek értéket kell adni.
id: Bidang ini tidak boleh kosong.
it: Questo campo non può essere vuoto.
ja: このフィールドは必須です。
ka: ველი არ შეიძლება იყოს ცარიელი.
km: ទិន្នន័យនេះមិនអាចទទេបានទេ។
ko: 이 필드는 반드시 입력해야 합니다.
ku: ئەم خانە ناتوانرێت بەتاڵ بێت.
lo: ແບບຟອມນີ້ບໍ່ສາມາດຫວ່າງເປົ່າໄດ້.
lv: Šis lauks nedrīkst būt tukšs.
mn: Заавал бөглөнө үү.
ms: Ruangan ini wajib diisi.
ne: यो क्षेत्र खाली हुन सक्दैन।
nl: Dit veld mag niet leeg zijn.
no: Dette feltet må fylles ut.
pl: To pole nie może być puste.
pt: Este campo não pode ficar vazio.
ro: Acest câmp nu poate fi gol.
ru: Поле не может быть пустым.
sk: Toto pole nesmie byť prázdne.
sl: Polje ne sme biti prazno.
sq: Kjo fushë nuk mund të jetë bosh.
sv: Detta fält får inte vara tomt.
sw: Sehemu hii haiwezi kuwa tupu.
ta: இந்த உள்ளீடு காலியாக இருக்கக்கூடாது.
th: กรุณาระบุข้อมูล
tr: Bu alan boş olamaz.
uk: Поле не може бути порожнім.
vi: Không được bỏ trống.
zh: 该字段不能为空。
zh_hant: 此欄位不能為空。
